[Killed] MethodCallRemoval
identityAccessManagement/Authentication.php:36:13
                 return UnauthorizedResponse::noHeader($this->url);
             }
 
-            $this->jwtManagement->validate($request, $this->session);
+            
         } catch (Throwable $throwable) {
             return ErrorResponse::unauthorized($this->url, $throwable);
killedBy: norsk\api\app\identityAccessManagement\AuthenticationTest::testCanProcessAValidRequest
statusReason: 1) norsk\api\app\identityAccessManagement\AuthenticationTest::testCanProcessAValidRequest
Expectation failed for method name is "validate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
