[Killed] MethodCallRemoval
NorskApi.php:38:9
         );
 
         $session = Session::create();
-        $this->router->run($this->app, $session);
+        
         $this->app->run();
         $session->destroy();
killedBy: norsk\api\app\NorskApiTest::testCanRun
statusReason: 1) norsk\api\app\NorskApiTest::testCanRun
Expectation failed for method name is "run" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
NorskApi.php:39:9
 
         $session = Session::create();
         $this->router->run($this->app, $session);
-        $this->app->run();
+        
         $session->destroy();
         $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
killedBy: norsk\api\app\NorskApiTest::testCanRun
statusReason: 1) norsk\api\app\NorskApiTest::testCanRun
Expectation failed for method name is "run" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Survived] MethodCallRemoval
NorskApi.php:40:9
         $session = Session::create();
         $this->router->run($this->app, $session);
         $this->app->run();
-        $session->destroy();
+        
         $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
     }

[Killed] MethodCallRemoval
NorskApi.php:41:9
         $this->router->run($this->app, $session);
         $this->app->run();
         $session->destroy();
-        $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
+        
     }
 }
killedBy: norsk\api\app\NorskApiTest::testCanRun
statusReason: 1) norsk\api\app\NorskApiTest::testCanRun
Expectation failed for method name is "info" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
