[Survived] ArrayItemRemoval
identityAccessManagement/AuthenticationAlgorithm.php:39:9
      */
     private static function getAlgorithmList(): array
     {
-        return [
-            'HS256',
-            'HS384',
-            'HS512',
-            'PS256',
-            'PS384',
-            'PS512',
-            'RS256',
-            'RS384',
-            'RS512',
-            'ES256',
-            'ES256K',
-            'ES384',
-            'ES512',
-            'EdDSA',
-        ];
+        return ['HS384', 'HS512', 'PS256', 'PS384', 'PS512', 'RS256', 'RS384', 'RS512', 'ES256', 'ES256K', 'ES384', 'ES512', 'EdDSA'];
     }
 
