[Killed] Concat
config/AppConfig.php:92:21
         foreach (array_keys($expectedKeys) as $configKey) {
             if (count($configItems[$configKey]) === 0) {
                 throw new KeyHasEmptyValueException(
-                    'Key is empty: ' . $configKey,
+                    throw new KeyHasEmptyValueException($configKey . 'Key is empty: ', ResponseCode::unprocessable->value);
                     ResponseCode::unprocessable->value
                 );
statusReason: 1) norsk\api\app\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'logsKey is empty: ' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LogicalOrNegation
config/AppConfig.php:114:13
     private static function displayErrorForDebug(array $configItems): void
     {
         if (
-            self::noDebugEntryInConfig($configItems)
-            || self::debugEntryIsTurnedOffByFalse(
-                $configItems[self::ERROR]['debug']
-            )
+            if (!(self::noDebugEntryInConfig($configItems) || self::debugEntryIsTurnedOffByFalse($configItems[self::ERROR]['debug']))) {
         ) {
             error_reporting(E_ERROR | E_PARSE);
killedBy: norsk\api\app\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
statusReason: 1) norsk\api\app\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
E_ERROR | E_PARSE aktiv
Failed asserting that 32767 is identical to 5.

/app/api/tests/unit/app/config/AppConfigTest.php:360

FAILURES!
Tests: 32, Assertions: 57, Failures: 1.

[Killed] ConcatOperandRemoval
config/AppConfig.php:128:17
     {
         if ($configItems === '') {
             throw new KeyHasEmptyValueException(
-                'Key is empty: ' . $param,
+                throw new KeyHasEmptyValueException($param, ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
statusReason: 1) norsk\api\app\config\AppConfigTest::testThrowsExceptionIfConfigParamValueIsEmpty with data set "path" ('[logs]\rpath = \rdisplayError... x\r\r', 'path')
Failed asserting that exception message 'path' contains 'Key is empty: path'.

FAILURES!
Tests: 15, Assertions: 30, Failures: 1.

[Killed] ConcatOperandRemoval
config/AppConfig.php:137:9
 
     private static function readLoggerConfig(array $logConfigItems): AppLoggerConfig
     {
-        $path = Path::fromString(__DIR__ . self::API_ROOT . $logConfigItems['path']);
+        $path = Path::fromString(__DIR__ . $logConfigItems['path']);
         $displayErrorDetails = $logConfigItems['displayErrorDetails'];
         $logErrors = $logConfigItems['logErrors'];
killedBy: norsk\api\app\config\AppConfigTest::testCanGetLogPath
statusReason: 1) norsk\api\app\config\AppConfigTest::testCanGetLogPath
Failed asserting that false is identical to '/app/api/logs'.

/app/api/tests/unit/app/config/AppConfigTest.php:249

FAILURES!
Tests: 27, Assertions: 52, Failures: 1.

[Killed] ConcatOperandRemoval
config/AppConfig.php:137:9
 
     private static function readLoggerConfig(array $logConfigItems): AppLoggerConfig
     {
-        $path = Path::fromString(__DIR__ . self::API_ROOT . $logConfigItems['path']);
+        $path = Path::fromString(self::API_ROOT . $logConfigItems['path']);
         $displayErrorDetails = $logConfigItems['displayErrorDetails'];
         $logErrors = $logConfigItems['logErrors'];
killedBy: norsk\api\app\config\AppConfigTest::testCanGetLogPath
statusReason: 1) norsk\api\app\config\AppConfigTest::testCanGetLogPath
Failed asserting that false is identical to '/app/api/logs'.

/app/api/tests/unit/app/config/AppConfigTest.php:249

FAILURES!
Tests: 27, Assertions: 52, Failures: 1.

[Survived] CastBool
config/AppConfig.php:142:9
         $logErrors = $logConfigItems['logErrors'];
         $logErrorDetails = $logConfigItems['logErrorDetails'];
 
-        return AppLoggerConfig::by($path, (bool)$displayErrorDetails, (bool)$logErrors, (bool)$logErrorDetails);
+        return AppLoggerConfig::by($path, $displayErrorDetails, (bool) $logErrors, (bool) $logErrorDetails);
     }
 

[Survived] CastBool
config/AppConfig.php:142:9
         $logErrors = $logConfigItems['logErrors'];
         $logErrorDetails = $logConfigItems['logErrorDetails'];
 
-        return AppLoggerConfig::by($path, (bool)$displayErrorDetails, (bool)$logErrors, (bool)$logErrorDetails);
+        return AppLoggerConfig::by($path, (bool) $displayErrorDetails, $logErrors, (bool) $logErrorDetails);
     }
 

[Killed] TrueValue
config/AppConfig.php:165:9
 
     private static function debugEntryIsTurnedOffByFalse(int|string|bool $debug): bool
     {
-        return $debug !== true;
+        return $debug !== false;
     }
 
killedBy: norsk\api\app\config\AppConfigTest::testDoestNotSetErrorLevelToProductionLevelWithoutWarningsIfDebugIsInConfig
statusReason: 1) norsk\api\app\config\AppConfigTest::testDoestNotSetErrorLevelToProductionLevelWithoutWarningsIfDebugIsInConfig
E_ALL aktiv
Failed asserting that 5 is identical to 32767.

/app/api/tests/unit/app/config/AppConfigTest.php:371

FAILURES!
Tests: 33, Assertions: 58, Failures: 1.
