[Killed] IfNegation
identityAccessManagement/Authorization.php:34:13
     {
         $userName = null;
         try {
-            if (Session::isValidManager()) {
-                $userName = Session::getUserName();
-                $this->usersReader->isActiveManager($userName);
-
-                $logMessage = LogMessage::fromString('Authenticated manager: ' . $userName->asString());
-                $this->logger->info($logMessage);
-
-                return $handler->handle($request);
-            }
+            if (!Session::isValidManager()) {
         } catch (Throwable $throwable) {
             $logMessage = $this->getLogMessage($userName);
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
identityAccessManagement/Authorization.php:36:17
         try {
             if (Session::isValidManager()) {
                 $userName = Session::getUserName();
-                $this->usersReader->isActiveManager($userName);
+                
 
                 $logMessage = LogMessage::fromString('Authenticated manager: ' . $userName->asString());
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "isActiveManager" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
identityAccessManagement/Authorization.php:38:17
                 $userName = Session::getUserName();
                 $this->usersReader->isActiveManager($userName);
 
-                $logMessage = LogMessage::fromString('Authenticated manager: ' . $userName->asString());
+                $logMessage = LogMessage::fromString($userName->asString());
                 $this->logger->info($logMessage);
 
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
norsk\api\app\logging\Logger::info(norsk\api\app\logging\LogMessage Object (...)): void was not expected to be called more than once.

/app/api/src/app/identityAccessManagement/Authorization.php:36
/app/api/tests/unit/app/identityAccessManagement/AuthorizationTest.php:68

FAILURES!
Tests: 1, Assertion

[Killed] ConcatOperandRemoval
identityAccessManagement/Authorization.php:38:17
                 $userName = Session::getUserName();
                 $this->usersReader->isActiveManager($userName);
 
-                $logMessage = LogMessage::fromString('Authenticated manager: ' . $userName->asString());
+                $logMessage = LogMessage::fromString('Authenticated manager: ');
                 $this->logger->info($logMessage);
 
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
norsk\api\app\logging\Logger::info(norsk\api\app\logging\LogMessage Object (...)): void was not expected to be called more than once.

/app/api/src/app/identityAccessManagement/Authorization.php:36
/app/api/tests/unit/app/identityAccessManagement/AuthorizationTest.php:68

FAILURES!
Tests: 1, Assertion

[Killed] MethodCallRemoval
identityAccessManagement/Authorization.php:39:17
                 $this->usersReader->isActiveManager($userName);
 
                 $logMessage = LogMessage::fromString('Authenticated manager: ' . $userName->asString());
-                $this->logger->info($logMessage);
+                
 
                 return $handler->handle($request);
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
identityAccessManagement/Authorization.php:45:13
             }
         } catch (Throwable $throwable) {
             $logMessage = $this->getLogMessage($userName);
-            $this->logger->info(LogMessage::fromString($logMessage));
+            
             $this->logger->error($throwable);
 
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 21, Failures: 1.

[Killed] MethodCallRemoval
identityAccessManagement/Authorization.php:46:13
         } catch (Throwable $throwable) {
             $logMessage = $this->getLogMessage($userName);
             $this->logger->info(LogMessage::fromString($logMessage));
-            $this->logger->error($throwable);
+            
 
             return ErrorResponse::unauthorized($this->url, $throwable);
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 21, Failures: 1.

[Killed] InstanceOf_
identityAccessManagement/Authorization.php:57:9
 
     private function getLogMessage(?UserName $userName): string
     {
-        if ($userName instanceof UserName) {
+        if (true) {
             return 'Could not authenticate manager: ' . $userName->asString();
         }
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameIsEmpty
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameIsEmpty
Error: Call to a member function asString() on null

/app/api/src/app/identityAccessManagement/Authorization.php:45
/app/api/src/app/identityAccessManagement/Authorization.php:35
/app/api/tests/unit/app/identityAccessManagement/AuthorizationTest.php:188

ERRORS!

[Killed] InstanceOf_
identityAccessManagement/Authorization.php:57:9
 
     private function getLogMessage(?UserName $userName): string
     {
-        if ($userName instanceof UserName) {
+        if (false) {
             return 'Could not authenticate manager: ' . $userName->asString();
         }
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
Expectation failed for method name is "info" when invoked 1 time
Parameter 0 for invocation norsk\api\app\logging\Logger::info(norsk\api\app\logging\LogMessage Object (...)): void does not match expected value.
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\app\log

[Killed] ConcatOperandRemoval
identityAccessManagement/Authorization.php:58:13
     private function getLogMessage(?UserName $userName): string
     {
         if ($userName instanceof UserName) {
-            return 'Could not authenticate manager: ' . $userName->asString();
+            return 'Could not authenticate manager: ';
         }
 
killedBy: norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
statusReason: 1) norsk\api\app\identityAccessManagement\AuthorizationTest::testCanHandleErrorIfUserNameExists
Expectation failed for method name is "info" when invoked 1 time
Parameter 0 for invocation norsk\api\app\logging\Logger::info(norsk\api\app\logging\LogMessage Object (...)): void does not match expected value.
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\app\log
