[Killed] ConcatOperandRemoval
config/DbConfig.php:68:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $configItems[self::DATABASE])) {
-                throw new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
+                throw new KeyIsNotSetException($neededKey, ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\app\config\DbConfigTest::testThrowsExceptionIfKeyDoesNotExist with data set "host" ('[database]', 'db_server')
Failed asserting that exception message 'db_server' contains 'db_server is not set.'.

FAILURES!
Tests: 7, Assertions: 20, Failures: 1.

[Killed] Throw_
config/DbConfig.php:95:17
 
         foreach ($neededKeys as $neededKey) {
             if ($configItems[self::DATABASE][$neededKey] === '') {
-                throw new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
+                new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\app\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "Host is not set" at
/app/api/src/app/persistence/Host.php:28
/app/api/src/app/persistence/Host.php:19
/app/api/src/app
