[Killed] PublicVisibility
identityAccessManagement/Clock.php:28:5
     }
 
 
-    public function addSeconds(int $seconds): self
+    protected function addSeconds(int $seconds): self
     {
         $newTime = $this->clock->modify('+' . $seconds . ' seconds');
killedBy: norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
Error: Call to protected method norsk\api\app\identityAccessManagement\Clock::addSeconds() from scope norsk\api\app\identityAccessManagement\ClockTest

/app/api/tests/unit/app/identityAccessManagement/ClockTest.php:30

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] ConcatOperandRemoval
identityAccessManagement/Clock.php:30:9
 
     public function addSeconds(int $seconds): self
     {
-        $newTime = $this->clock->modify('+' . $seconds . ' seconds');
+        $newTime = $this->clock->modify('+' . ' seconds');
         $newTime = $newTime->setTimezone(new DateTimeZone(self::EUROPE_BERLIN));
 
killedBy: norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
DateMalformedStringException: DateTimeImmutable::modify(): Failed to parse time string (+ seconds) at position 0 (+): Unexpected character

/app/api/src/app/identityAccessManagement/Clock.php:22
/app/api/tests/unit/app/identityAccessManagement/ClockTest.php:30

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] ConcatOperandRemoval
identityAccessManagement/Clock.php:30:9
 
     public function addSeconds(int $seconds): self
     {
-        $newTime = $this->clock->modify('+' . $seconds . ' seconds');
+        $newTime = $this->clock->modify('+' . $seconds);
         $newTime = $newTime->setTimezone(new DateTimeZone(self::EUROPE_BERLIN));
 
killedBy: norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\app\identityAccessManagement\ClockTest::testCanAddSecondsToTimestamp
DateMalformedStringException: DateTimeImmutable::modify(): Failed to parse time string (+7200) at position 4 (0): Unexpected character

/app/api/src/app/identityAccessManagement/Clock.php:22
/app/api/tests/unit/app/identityAccessManagement/ClockTest.php:30

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
