[Killed] PublicVisibility
identityAccessManagement/IdentityAccessManagementFactory.php:24:5
     }
 
 
-    public function createAuthorization(): Authorization
+    protected function createAuthorization(): Authorization
     {
         return new Authorization($this->logger, $this->usersReader, $this->url);
killedBy: norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthorization
statusReason: 1) norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthorization
Error: Call to protected method norsk\api\app\identityAccessManagement\IdentityAccessManagementFactory::createAuthorization() from scope norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit/app/identityAccessManagement/IdentityAccessManagementFactoryT

[Killed] PublicVisibility
identityAccessManagement/IdentityAccessManagementFactory.php:30:5
     }
 
 
-    public function createAuthentication(Session $session): Authentication
+    protected function createAuthentication(Session $session): Authentication
     {
         return new Authentication($this->createJwtManagement(), $session, $this->url);
killedBy: norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthentication
statusReason: 1) norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthentication
Error: Call to protected method norsk\api\app\identityAccessManagement\IdentityAccessManagementFactory::createAuthentication() from scope norsk\api\app\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit/app/identityAccessManagement/IdentityAccessManagementFactor
