[Killed] Identical
identityAccessManagement/Session.php:21:9
 
     private function __construct()
     {
-        if (session_status() === PHP_SESSION_NONE) {
+        if (session_status() !== PHP_SESSION_NONE) {
             session_start();
         }
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanCreateSession
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanCreateSession
Failed asserting that false is true.

/app/api/tests/unit/app/identityAccessManagement/SessionTest.php:31

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCallRemoval
identityAccessManagement/Session.php:22:13
     private function __construct()
     {
         if (session_status() === PHP_SESSION_NONE) {
-            session_start();
+            
         }
     }
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanCreateSession
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanCreateSession
Failed asserting that false is true.

/app/api/tests/unit/app/identityAccessManagement/SessionTest.php:31

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
identityAccessManagement/Session.php:33:5
     }
 
 
-    public static function getUserName(): UserName
+    protected static function getUserName(): UserName
     {
         $userName = $_SESSION['user'];
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanGetUserName
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanGetUserName
Error: Call to protected method norsk\api\app\identityAccessManagement\Session::getUserName() from scope norsk\api\app\identityAccessManagement\SessionTest

/app/api/tests/unit/app/identityAccessManagement/SessionTest.php:39

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] MethodCallRemoval
identityAccessManagement/Session.php:36:9
     public static function getUserName(): UserName
     {
         $userName = $_SESSION['user'];
-        self::ensureIsNotNull($userName);
+        
 
         return UserName::by($userName);
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanGetUnsetUserName
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanGetUnsetUserName
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "norsk\api\user\UserName::by(): Argument #1 ($userName) must be of type string, null given, called in /app/api/src/app/identityAccessManagement/Session.php on line 29" at
/app/api/src/user/UserName.php

[Killed] Identical
identityAccessManagement/Session.php:44:9
 
     private static function ensureIsNotNull(?string $userName): void
     {
-        if ($userName === null) {
+        if ($userName !== null) {
             throw new InvalidArgumentException('Session user is not set.', ResponseCode::serverError->value);
         }
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanGetUserName
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanGetUserName
InvalidArgumentException: Session user is not set.

/app/api/src/app/identityAccessManagement/Session.php:34
/app/api/src/app/identityAccessManagement/Session.php:28
/app/api/tests/unit/app/identityAccessManagement/SessionTest.php:39

ERRORS!

[Killed] Throw_
identityAccessManagement/Session.php:45:13
     private static function ensureIsNotNull(?string $userName): void
     {
         if ($userName === null) {
-            throw new InvalidArgumentException('Session user is not set.', ResponseCode::serverError->value);
+            new InvalidArgumentException('Session user is not set.', ResponseCode::serverError->value);
         }
     }
killedBy: norsk\api\app\identityAccessManagement\SessionTest::testCanGetUnsetUserName
statusReason: 1) norsk\api\app\identityAccessManagement\SessionTest::testCanGetUnsetUserName
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "norsk\api\user\UserName::by(): Argument #1 ($userName) must be of type string, null given, called in /app/api/src/app/identityAccessManagement/Session.php on line 29" at
/app/api/src/user/UserName.php
