[Survived] PregMatchRemoveCaret
identityAccessManagement/JsonWebToken.php:26:9
 
     private static function ensureTokenIsJwtValid(string $token): void
     {
-        if (!preg_match("/^([a-zA-Z0-9_=]{4,36})\.([a-zA-Z0-9_=]{4,})\.([a-zA-Z0-9_\-+\/=]{4,86})$/", $token)) {
+        if (!preg_match("/([a-zA-Z0-9_=]{4,36})\\.([a-zA-Z0-9_=]{4,})\\.([a-zA-Z0-9_\\-+\\/=]{4,86})\$/", $token)) {
             throw new InvalidArgumentException('Token has no valid format');
         }
