[Killed] PublicVisibility
identityAccessManagement/JwtManagement.php:42:5
     }
 
 
-    public function create(ValidatedUser $validatedUser): JsonWebToken
+    protected function create(ValidatedUser $validatedUser): JsonWebToken
     {
         $role = $validatedUser->getRole();
killedBy: norsk\api\app\identityAccessManagement\JwtManagementTest::testCanCreateJwt
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanCreateJwt
Error: Call to protected method norsk\api\app\identityAccessManagement\JwtManagement::create() from scope norsk\api\app\identityAccessManagement\JwtManagementTest

/app/api/tests/unit/app/identityAccessManagement/JwtManagementTest.php:145

ERRORS!
Tests: 9, Assertions: 44, Errors: 1.

[Killed] PublicVisibility
identityAccessManagement/JwtManagement.php:67:5
     }
 
 
-    public function validate(ServerRequestInterface $request, Session $session): void
+    protected function validate(ServerRequestInterface $request, Session $session): void
     {
         $tokenString = $request->getHeader('Authorization')[0];
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
Error: Call to protected method norsk\api\app\identityAccessManagement\JwtManagement::validate() from scope norsk\api\app\identityAccessManagement\JwtManagementTest

/app/api/tests/unit/app/identityAccessManagement/JwtManagementTest.php:215

ERRORS!
Tes

[Killed] MethodCallRemoval
identityAccessManagement/JwtManagement.php:73:9
         $token = JsonWebToken::fromBearerString(SanitizedClientInput::of($tokenString)->asString());
 
         $decodedPayload = $this->validateJwtToken($token);
-        $this->validateJwtContent($decodedPayload, $session);
+        
 
         $this->logger->info(LogMessage::fromString('Jwt is valid'));
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
Expectation failed for method name is "addJwtContent" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] InstanceOf_
identityAccessManagement/JwtManagement.php:91:17
             $this->logger->error($throwable);
 
             return match (true) {
-                $throwable instanceof ExpiredException => throw new RuntimeException(
+                true => throw new RuntimeException('Token expired: ' . $throwable->getMessage()),
                     'Token expired: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "SignatureInvalid" ('invalidSignature.jwt', 'Invalid token signature')
Failed asserting that exception message 'Token expired: Signature verification failed' contains 'Invalid token signature'.

FAILURES!
Tests: 6, Assertions: 28, Failures: 1.

[Killed] InstanceOf_
identityAccessManagement/JwtManagement.php:94:17
                 $throwable instanceof ExpiredException => throw new RuntimeException(
                     'Token expired: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof SignatureInvalidException => throw new RuntimeException(
+                true => throw new RuntimeException('Invalid token signature: ' . $throwable->getMessage()),
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "BeforeValid" ('invalidNotValidYet.jwt', 'Token not valid yet')
Failed asserting that exception message 'Invalid token signature: Cannot handle token with iat prior to 2200-09-28T13:37:27+0200' contains 'Token not valid yet'.

FAILURES!
Tests: 7, Assertions: 34, Failures: 1.

[Killed] InstanceOf_
identityAccessManagement/JwtManagement.php:94:17
                 $throwable instanceof ExpiredException => throw new RuntimeException(
                     'Token expired: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof SignatureInvalidException => throw new RuntimeException(
+                false => throw new RuntimeException('Invalid token signature: ' . $throwable->getMessage()),
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "SignatureInvalid" ('invalidSignature.jwt', 'Invalid token signature')
Failed asserting that exception message 'Invalid token: Signature verification failed' contains 'Invalid token signature'.

FAILURES!
Tests: 6, Assertions: 28, Failures: 1.

[Killed] InstanceOf_
identityAccessManagement/JwtManagement.php:97:17
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof BeforeValidException => throw new RuntimeException(
+                true => throw new RuntimeException('Token not valid yet: ' . $throwable->getMessage()),
                     'Token not valid yet: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "GeneralInvalidToken" ('invalid.jwt', 'Invalid token')
Failed asserting that exception message 'Token not valid yet: Incorrect key for this algorithm' contains 'Invalid token'.

FAILURES!
Tests: 8, Assertions: 40, Failures: 1.

[Survived] ConcatOperandRemoval
identityAccessManagement/JwtManagement.php:98:21
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(
-                    'Token not valid yet: ' . $throwable->getMessage()
+                    $throwable instanceof BeforeValidException => throw new RuntimeException('Token not valid yet: '),
                 ),
 

[Killed] Throw_
identityAccessManagement/JwtManagement.php:101:17
                     'Token not valid yet: ' . $throwable->getMessage()
                 ),
 
-                default => throw new RuntimeException('Invalid token: ' . $throwable->getMessage()),
+                default => new RuntimeException('Invalid token: ' . $throwable->getMessage()),
             };
         }
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "GeneralInvalidToken" ('invalid.jwt', 'Invalid token')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\app\identityAccessManagement\JwtManagement::validateJwtToken(): Return value must be of type stdClass, RuntimeE

[Killed] MethodCallRemoval
identityAccessManagement/JwtManagement.php:113:9
         $this->ensureAudienceIsValid($decodedPayload);
 
         $payload = Payload::by($decodedPayload);
-        $session->addJwtContent($payload, $this->usersReader);
+        
     }
 
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
Expectation failed for method name is "addJwtContent" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] NotIdentical
identityAccessManagement/JwtManagement.php:119:9
 
     private function ensureSubjectIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'sub') || $decodedPayload->sub !== self::NORSK_APP_SUB) {
+        if (!property_exists($decodedPayload, 'sub') || $decodedPayload->sub === self::NORSK_APP_SUB) {
             throw new InvalidArgumentException('Token was not generated by Api');
         }
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
InvalidArgumentException: Token was not generated by Api

/app/api/src/app/identityAccessManagement/JwtManagement.php:76
/app/api/src/app/identityAccessManagement/JwtManagement.php:68
/app/api/src/app/identityAccessManagement/JwtManagement.php:46
/app/a

[Killed] LogicalNot
identityAccessManagement/JwtManagement.php:127:9
 
     private function ensureAudienceIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
+        if (property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
             throw new InvalidArgumentException('Token was not sent from Client');
         }
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
InvalidArgumentException: Token was not sent from Client

/app/api/src/app/identityAccessManagement/JwtManagement.php:82
/app/api/src/app/identityAccessManagement/JwtManagement.php:69
/app/api/src/app/identityAccessManagement/JwtManagement.php:46
/app/a

[Killed] LogicalOrNegation
identityAccessManagement/JwtManagement.php:127:9
 
     private function ensureAudienceIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
+        if (!(!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT)) {
             throw new InvalidArgumentException('Token was not sent from Client');
         }
statusReason: 1) norsk\api\app\identityAccessManagement\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
InvalidArgumentException: Token was not sent from Client

/app/api/src/app/identityAccessManagement/JwtManagement.php:82
/app/api/src/app/identityAccessManagement/JwtManagement.php:69
/app/api/src/app/identityAccessManagement/JwtManagement.php:46
/app/a
