[Killed] PublicVisibility
infrastructure/Factory.php:32:5
     }
 
 
-    public static function fromConfigs(AppConfig $appConfig, DbConfig $dbConfig): self
+    protected static function fromConfigs(AppConfig $appConfig, DbConfig $dbConfig): self
     {
         return new self($appConfig, $dbConfig);
killedBy: norsk\api\infrastructure\FactoryTest::testCanCreateNorskApi
statusReason: 1) norsk\api\infrastructure\FactoryTest::testCanCreateNorskApi
Error: Call to protected method norsk\api\infrastructure\Factory::fromConfigs() from scope norsk\api\infrastructure\FactoryTest

/app/api/tests/unit/infrastructure/FactoryTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/Factory.php:38:5
     }
 
 
-    public function createNorskApi(): NorskApi
+    protected function createNorskApi(): NorskApi
     {
         $this->logger = Logger::create($this->appConfig->getLogPath());
killedBy: norsk\api\infrastructure\FactoryTest::testCanCreateNorskApi
statusReason: 1) norsk\api\infrastructure\FactoryTest::testCanCreateNorskApi
Error: Call to protected method norsk\api\infrastructure\Factory::createNorskApi() from scope norsk\api\infrastructure\FactoryTest

/app/api/tests/unit/infrastructure/FactoryTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
