[Killed] PublicVisibility
infrastructure/persistence/Password.php:18:5
     }
 
 
-    public static function fromString(
+    protected static function fromString(
         #[SensitiveParameter]
         string $password
statusReason: 1) norsk\api\infrastructure\persistence\PasswordTest::testFailsIfPasswordIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to protected method norsk\api\infrastructure\persistence\Password::fromString() from scope norsk\api\infrastructure\persistence\PasswordTest" at
/app/api/tests/unit/i

[Killed] MethodCallRemoval
infrastructure/persistence/Password.php:22:9
         #[SensitiveParameter]
         string $password
     ): self {
-        self::ensureIsNotEmpty(trim($password));
+        
 
         return new self($password);
statusReason: 1) norsk\api\infrastructure\persistence\PasswordTest::testFailsIfPasswordIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] UnwrapTrim
infrastructure/persistence/Password.php:22:9
         #[SensitiveParameter]
         string $password
     ): self {
-        self::ensureIsNotEmpty(trim($password));
+        self::ensureIsNotEmpty($password);
 
         return new self($password);
statusReason: 1) norsk\api\infrastructure\persistence\PasswordTest::testFailsIfPasswordIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
infrastructure/persistence/Password.php:31:13
     private static function ensureIsNotEmpty(string $password): void
     {
         if ($password === '') {
-            throw new InvalidArgumentException('Password is not set', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('Password is not set', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\persistence\PasswordTest::testFailsIfPasswordIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
