[Killed] PublicVisibility
infrastructure/NorskApi.php:26:5
     }
 
 
-    public function run(): void
+    protected function run(): void
     {
         $this->logger->info(LogMessage::fromString('Starting Norsk API'));
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Error: Call to protected method norsk\api\infrastructure\NorskApi::run() from scope norsk\api\infrastructure\NorskApiTest

/app/api/tests/unit/infrastructure/NorskApiTest.php:63

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:28:9
 
     public function run(): void
     {
-        $this->logger->info(LogMessage::fromString('Starting Norsk API'));
+        
 
         $this->app->addBodyParsingMiddleware();
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => norsk\api\infrastructure\logging\LogMessage Object (
-        'message' => 'Starting Norsk API'

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:30:9
     {
         $this->logger->info(LogMessage::fromString('Starting Norsk API'));
 
-        $this->app->addBodyParsingMiddleware();
+        
         $this->app->addRoutingMiddleware();
         $this->app->addErrorMiddleware(
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "addBodyParsingMiddleware" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:31:9
         $this->logger->info(LogMessage::fromString('Starting Norsk API'));
 
         $this->app->addBodyParsingMiddleware();
-        $this->app->addRoutingMiddleware();
+        
         $this->app->addErrorMiddleware(
             $this->appLoggerConfig->isDisplayErrorDetails(),
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "addRoutingMiddleware" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:32:9
 
         $this->app->addBodyParsingMiddleware();
         $this->app->addRoutingMiddleware();
-        $this->app->addErrorMiddleware(
-            $this->appLoggerConfig->isDisplayErrorDetails(),
-            $this->appLoggerConfig->isLogErrors(),
-            $this->appLoggerConfig->isLogErrorDetails()
-        );
+        
         $this->app->addMiddleware($this->corsMiddleware);
 
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "addErrorMiddleware" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Survived] MethodCallRemoval
infrastructure/NorskApi.php:37:9
             $this->appLoggerConfig->isLogErrors(),
             $this->appLoggerConfig->isLogErrorDetails()
         );
-        $this->app->addMiddleware($this->corsMiddleware);
+        
 
         $this->router->run($this->app);

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:39:9
         );
         $this->app->addMiddleware($this->corsMiddleware);
 
-        $this->router->run($this->app);
+        
         $this->app->run();
         $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "run" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:40:9
         $this->app->addMiddleware($this->corsMiddleware);
 
         $this->router->run($this->app);
-        $this->app->run();
+        
         $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
     }
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "run" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/NorskApi.php:41:9
 
         $this->router->run($this->app);
         $this->app->run();
-        $this->logger->info(LogMessage::fromString('Stopping Norsk API'));
+        
     }
 }
killedBy: norsk\api\infrastructure\NorskApiTest::testCanRun
statusReason: 1) norsk\api\infrastructure\NorskApiTest::testCanRun
Expectation failed for method name is "info" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
