[Killed] PublicVisibility
infrastructure/routing/Router.php:22:5
     }
 
 
-    public function run(App $app): void
+    protected function run(App $app): void
     {
         $app->group('/api/v1', function (RouteCollectorProxy $group): void {
killedBy: norsk\api\infrastructure\routing\RouterTest::testRunCallsIdentityAccessManagementForAuthenticationForGeneralApiRoute
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRunCallsIdentityAccessManagementForAuthenticationForGeneralApiRoute
Error: Call to protected method norsk\api\infrastructure\routing\Router::run() from scope norsk\api\infrastructure\routing\RouterTest

/app/api/tests/unit/infrastructure/routing/RouterTest.php:43

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:24:9
 
     public function run(App $app): void
     {
-        $app->group('/api/v1', function (RouteCollectorProxy $group): void {
-            $this->defineApiRoutes($group);
-        }
-        )->addMiddleware($this->identityAccessManagement->createAuthentication());
+        
     }
 
killedBy: norsk\api\infrastructure\routing\RouterTest::testRunCallsIdentityAccessManagementForAuthenticationForGeneralApiRoute
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRunCallsIdentityAccessManagementForAuthenticationForGeneralApiRoute
Expectation failed for method name is "createAuthentication" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:25:13
     public function run(App $app): void
     {
         $app->group('/api/v1', function (RouteCollectorProxy $group): void {
-            $this->defineApiRoutes($group);
+            
         }
         )->addMiddleware($this->identityAccessManagement->createAuthentication());
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
Expectation failed for method name is "post" when invoked 2 times.
Method was expected to be called 2 times, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:33:9
 
     private function defineApiRoutes(RouteCollectorProxy $group): void
     {
-        $this->routeUsers($group);
+        
         $this->defineTrainRoutes($group);
         $this->defineManageRoutes($group);
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
Expectation failed for method name is "post" when invoked 2 times.
Method was expected to be called 2 times, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Survived] MethodCallRemoval
infrastructure/routing/Router.php:34:9
     private function defineApiRoutes(RouteCollectorProxy $group): void
     {
         $this->routeUsers($group);
-        $this->defineTrainRoutes($group);
+        
         $this->defineManageRoutes($group);
     }

[Survived] MethodCallRemoval
infrastructure/routing/Router.php:35:9
     {
         $this->routeUsers($group);
         $this->defineTrainRoutes($group);
-        $this->defineManageRoutes($group);
+        
     }
 

[Survived] MethodCallRemoval
infrastructure/routing/Router.php:41:9
 
     private function defineTrainRoutes(RouteCollectorProxy $group): void
     {
-        $group->group(
-            pattern: '/train',
-            callable: function (RouteCollectorProxy $trainGroup): void {
-                $this->trainWords($trainGroup);
-                $this->trainVerbs($trainGroup);
-            }
-        )->addMiddleware($this->identityAccessManagement->createTrainerAuthorization());
+        
     }
 

[Survived] MethodCallRemoval
infrastructure/routing/Router.php:53:9
 
     private function defineManageRoutes(RouteCollectorProxy $group): void
     {
-        $group->group(
-            pattern: '/manage',
-            callable: function (RouteCollectorProxy $manageGroup): void {
-                $this->manageWords($manageGroup);
-                $this->manageVerbs($manageGroup);
-            }
-        )->addMiddleware($this->identityAccessManagement->createManagerAuthorization());
+        
     }
 

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:65:9
 
     private function routeUsers(RouteCollectorProxy $group): void
     {
-        $group->post(
-            pattern: '/user/new',
-            callable: [$this->context->userManagement()->registration(), 'registerUser',]
-        );
+        
         $group->post(
             pattern: '/user',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
Expectation failed for method name is "post" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:69:9
             pattern: '/user/new',
             callable: [$this->context->userManagement()->registration(), 'registerUser',]
         );
-        $group->post(
-            pattern: '/user',
-            callable: [$this->context->userManagement()->login(), 'run']
-        );
+        
     }
 
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteUserNewIsRegistered
Expectation failed for method name is "post" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:78:9
 
     private function trainWords(RouteCollectorProxy $group): void
     {
-        $group->get(
-            pattern: '/words',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->trainer()->wordTrainer()),
-                Method::of('getWordToTrain')
-            )
-        );
+        
         $group->patch(
             pattern: '/words/{id:[0-9a-zA-Z]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteWordTrainingAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteWordTrainingAddsCorrectRoutes
Expectation failed for method name is "get" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:86:9
                 Method::of('getWordToTrain')
             )
         );
-        $group->patch(
-            pattern: '/words/{id:[0-9a-zA-Z]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->trainer()->wordTrainer()),
-                Method::of('saveSuccess')
-            )
-        );
+        
     }
 
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteWordTrainingAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteWordTrainingAddsCorrectRoutes
Expectation failed for method name is "patch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:99:9
 
     private function trainVerbs(RouteCollectorProxy $group): void
     {
-        $group->get(
-            pattern: '/verbs',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->trainer()->verbTrainer()),
-                Method::of('getVerbToTrain')
-            )
-        );
+        
         $group->patch(
             pattern: '/verbs/{id:[0-9a-zA-Z]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteVerbTrainingAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteVerbTrainingAddsCorrectRoutes
Expectation failed for method name is "get" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:107:9
                 Method::of('getVerbToTrain')
             )
         );
-        $group->patch(
-            pattern: '/verbs/{id:[0-9a-zA-Z]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->trainer()->verbTrainer()),
-                Method::of('saveSuccess')
-            )
-        );
+        
     }
 
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteVerbTrainingAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteVerbTrainingAddsCorrectRoutes
Expectation failed for method name is "patch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:120:9
 
     private function manageWords(RouteCollectorProxy $group): void
     {
-        $group->get(
-            pattern: '/words',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->wordManager()),
-                Method::of('getAllWords')
-            )
-        );
+        
         $group->post(
             pattern: '/words',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
Expectation failed for method name is "get" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 23, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:128:9
                 Method::of('getAllWords')
             )
         );
-        $group->post(
-            pattern: '/words',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->wordManager()),
-                Method::of('createWord')
-            )
-        );
+        
         $group->put(
             pattern: '/words/{id:[0-9]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
Expectation failed for method name is "post" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 23, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:136:9
                 Method::of('createWord')
             )
         );
-        $group->put(
-            pattern: '/words/{id:[0-9]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->wordManager()),
-                Method::of('update')
-            )
-        );
+        
         $group->delete(
             pattern: '/words/{id:[0-9]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
Expectation failed for method name is "put" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 23, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:144:9
                 Method::of('update')
             )
         );
-        $group->delete(
-            pattern: '/words/{id:[0-9]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->wordManager()),
-                Method::of('delete')
-            )
-        );
+        
     }
 
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageWordsAddsCorrectRoutes
Expectation failed for method name is "delete" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 23, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:157:9
 
     private function manageVerbs(RouteCollectorProxy $group): void
     {
-        $group->get(
-            pattern: '/verbs',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->verbManager()),
-                Method::of('getAllVerbs')
-            )
-        );
+        
         $group->post(
             pattern: '/verbs',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
Expectation failed for method name is "get" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:165:9
                 Method::of('getAllVerbs')
             )
         );
-        $group->post(
-            pattern: '/verbs',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->verbManager()),
-                Method::of('createVerb')
-            )
-        );
+        
         $group->put(
             pattern: '/verbs/{id:[0-9]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
Expectation failed for method name is "post" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:173:9
                 Method::of('createVerb')
             )
         );
-        $group->put(
-            pattern: '/verbs/{id:[0-9]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->verbManager()),
-                Method::of('update')
-            )
-        );
+        
         $group->delete(
             pattern: '/verbs/{id:[0-9]+}',
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
Expectation failed for method name is "put" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Router.php:181:9
                 Method::of('update')
             )
         );
-        $group->delete(
-            pattern: '/verbs/{id:[0-9]+}',
-            callable: RouteHandlerWithAuthenticatedUser::by(
-                $this->controllerResolver,
-                ControllerName::of($this->context->manager()->verbManager()),
-                Method::of('delete')
-            )
-        );
+        
     }
 }
killedBy: norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
statusReason: 1) norsk\api\infrastructure\routing\RouterTest::testRouteManageVerbsAddsCorrectRoutes
Expectation failed for method name is "delete" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.
