[Killed] PublicVisibility
infrastructure/config/AppConfig.php:38:5
     }
 
 
-    public static function fromPath(Path $configPath): self
+    protected static function fromPath(Path $configPath): self
     {
         $file = File::fromPath($configPath);
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::fromPath() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:34

ERRORS!
Tests: 1, Assert

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:42:9
     {
         $file = File::fromPath($configPath);
         $configItems = $file->parseIniFile()->asArray();
-        self::ensureConfigIsValid($configItems);
+        
 
         self::displayErrorForDebug($configItems);
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
/app/api/src/infrastructure/config/AppConfig.php:84
/app/api/src/infrastructure/config/AppConfig.php:34
/app/api/tests/unit/infrastructure/config/AppConfigTest.php:312
.

FAILURES!

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:44:9
         $configItems = $file->parseIniFile()->asArray();
         self::ensureConfigIsValid($configItems);
 
-        self::displayErrorForDebug($configItems);
+        
 
         return new self(
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
E_ERROR | E_PARSE aktiv
Failed asserting that 32767 is identical to 5.

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:365

FAILURES!
Tests: 32, Assertions: 57, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:62:9
             self::AUTH => self::AUTH_SECOND_LEVEL,
         ];
 
-        self::ensureKeysExist($configItems, $expectedKeys);
+        
         self::ensureKeyHasValue($configItems, $expectedKeys);
         self::ensureParamsExist($configItems, $expectedKeys);
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "count(): Argument #1 ($value) must be of type Countable|array, null given" at
/app/api/src/infrastructure/config/AppCon

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:63:9
         ];
 
         self::ensureKeysExist($configItems, $expectedKeys);
-        self::ensureKeyHasValue($configItems, $expectedKeys);
+        
         self::ensureParamsExist($configItems, $expectedKeys);
     }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'Key is not set: path' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:64:9
 
         self::ensureKeysExist($configItems, $expectedKeys);
         self::ensureKeyHasValue($configItems, $expectedKeys);
-        self::ensureParamsExist($configItems, $expectedKeys);
+        
     }
 
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamKeyIsMissing with data set "path" ('[logs]\rdisplayErrorDetails =... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] Foreach_
infrastructure/config/AppConfig.php:70:9
 
     private static function ensureKeysExist(array $configItems, array $expectedKeys): void
     {
-        foreach (array_keys($expectedKeys) as $configKey) {
-            self::ensureKeyIsSet($configKey, $configItems);
-        }
+        foreach ([] as $configKey) {
     }
 
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "count(): Argument #1 ($value) must be of type Countable|array, null given" at
/app/api/src/infrastructure/config/AppCon

[Killed] UnwrapArrayKeys
infrastructure/config/AppConfig.php:70:9
 
     private static function ensureKeysExist(array $configItems, array $expectedKeys): void
     {
-        foreach (array_keys($expectedKeys) as $configKey) {
+        foreach ($expectedKeys as $configKey) {
             self::ensureKeyIsSet($configKey, $configItems);
         }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
TypeError: norsk\api\infrastructure\config\AppConfig::ensureKeyIsSet(): Argument #1 ($param) must be of type string|int|bool|null, array given, called in /app/api/src/infrastructure/config/AppConfig.php on line 46

/app/api/src/infr

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:71:13
     private static function ensureKeysExist(array $configItems, array $expectedKeys): void
     {
         foreach (array_keys($expectedKeys) as $configKey) {
-            self::ensureKeyIsSet($configKey, $configItems);
+            
         }
     }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "count(): Argument #1 ($value) must be of type Countable|array, null given" at
/app/api/src/infrastructure/config/AppCon

[Killed] LogicalNot
infrastructure/config/AppConfig.php:78:9
 
     private static function ensureKeyIsSet(string|int|bool|null $param, array $array): void
     {
-        if (!array_key_exists($param, $array)) {
+        if (array_key_exists($param, $array)) {
             throw new KeyIsNotSetException(
                 'Key is not set: ' . $param,
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
norsk\api\infrastructure\config\exceptions\KeyIsNotSetException: Key is not set: logs

/app/api/src/infrastructure/config/AppConfig.php:52
/app/api/src/infrastructure/config/AppConfig.php:46
/app/api/src/infrastructure/config/AppCon

[Killed] Throw_
infrastructure/config/AppConfig.php:79:13
     private static function ensureKeyIsSet(string|int|bool|null $param, array $array): void
     {
         if (!array_key_exists($param, $array)) {
-            throw new KeyIsNotSetException(
-                'Key is not set: ' . $param,
-                ResponseCode::unprocessable->value
-            );
+            new KeyIsNotSetException('Key is not set: ' . $param, ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "count(): Argument #1 ($value) must be of type Countable|array, null given" at
/app/api/src/infrastructure/config/AppCon

[Killed] Concat
infrastructure/config/AppConfig.php:80:17
     {
         if (!array_key_exists($param, $array)) {
             throw new KeyIsNotSetException(
-                'Key is not set: ' . $param,
+                throw new KeyIsNotSetException($param . 'Key is not set: ', ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception message 'logsKey is not set: ' contains 'Key is not set: logs'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/config/AppConfig.php:80:17
     {
         if (!array_key_exists($param, $array)) {
             throw new KeyIsNotSetException(
-                'Key is not set: ' . $param,
+                throw new KeyIsNotSetException($param, ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
Failed asserting that exception message 'logs' contains 'Key is not set: logs'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Foreach_
infrastructure/config/AppConfig.php:89:9
 
     private static function ensureKeyHasValue(array $configItems, array $expectedKeys): void
     {
-        foreach (array_keys($expectedKeys) as $configKey) {
-            if (count($configItems[$configKey]) === 0) {
-                throw new KeyHasEmptyValueException(
-                    'Key is empty: ' . $configKey,
-                    ResponseCode::unprocessable->value
-                );
-            }
-        }
+        foreach ([] as $configKey) {
     }
 
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'Key is not set: path' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] Identical
infrastructure/config/AppConfig.php:90:13
     private static function ensureKeyHasValue(array $configItems, array $expectedKeys): void
     {
         foreach (array_keys($expectedKeys) as $configKey) {
-            if (count($configItems[$configKey]) === 0) {
+            if (count($configItems[$configKey]) !== 0) {
                 throw new KeyHasEmptyValueException(
                     'Key is empty: ' . $configKey,
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
norsk\api\infrastructure\config\exceptions\KeyHasEmptyValueException: Key is empty: logs

/app/api/src/infrastructure/config/AppConfig.php:59
/app/api/src/infrastructure/config/AppConfig.php:40
/app/api/src/infrastructure/config/App

[Killed] Throw_
infrastructure/config/AppConfig.php:91:17
     {
         foreach (array_keys($expectedKeys) as $configKey) {
             if (count($configItems[$configKey]) === 0) {
-                throw new KeyHasEmptyValueException(
-                    'Key is empty: ' . $configKey,
-                    ResponseCode::unprocessable->value
-                );
+                new KeyHasEmptyValueException('Key is empty: ' . $configKey, ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'Key is not set: path' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/config/AppConfig.php:92:21
         foreach (array_keys($expectedKeys) as $configKey) {
             if (count($configItems[$configKey]) === 0) {
                 throw new KeyHasEmptyValueException(
-                    'Key is empty: ' . $configKey,
+                    throw new KeyHasEmptyValueException('Key is empty: ', ResponseCode::unprocessable->value);
                     ResponseCode::unprocessable->value
                 );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'Key is empty: ' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/config/AppConfig.php:92:21
         foreach (array_keys($expectedKeys) as $configKey) {
             if (count($configItems[$configKey]) === 0) {
                 throw new KeyHasEmptyValueException(
-                    'Key is empty: ' . $configKey,
+                    throw new KeyHasEmptyValueException($configKey, ResponseCode::unprocessable->value);
                     ResponseCode::unprocessable->value
                 );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsEmpty with data set #0 ('[logs]\r[auth]\rfo=o', 'logs')
Failed asserting that exception message 'logs' contains 'Key is empty: logs'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] Foreach_
infrastructure/config/AppConfig.php:102:9
 
     private static function ensureParamsExist(array $configItems, array $expectedKeys): void
     {
-        foreach ($expectedKeys as $configKey => $params) {
-            foreach ($params as $param) {
-                self::ensureKeyIsSet($param, $configItems[$configKey]);
-                self::ensureKeyIsNotEmpty($configItems[$configKey][$param], $param);
-            }
-        }
+        foreach ([] as $configKey => $params) {
     }
 
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamKeyIsMissing with data set "path" ('[logs]\rdisplayErrorDetails =... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] Foreach_
infrastructure/config/AppConfig.php:103:13
     private static function ensureParamsExist(array $configItems, array $expectedKeys): void
     {
         foreach ($expectedKeys as $configKey => $params) {
-            foreach ($params as $param) {
-                self::ensureKeyIsSet($param, $configItems[$configKey]);
-                self::ensureKeyIsNotEmpty($configItems[$configKey][$param], $param);
-            }
+            foreach ([] as $param) {
         }
     }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamKeyIsMissing with data set "path" ('[logs]\rdisplayErrorDetails =... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:104:17
     {
         foreach ($expectedKeys as $configKey => $params) {
             foreach ($params as $param) {
-                self::ensureKeyIsSet($param, $configItems[$configKey]);
+                
                 self::ensureKeyIsNotEmpty($configItems[$configKey][$param], $param);
             }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamKeyIsMissing with data set "path" ('[logs]\rdisplayErrorDetails =... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] MethodCallRemoval
infrastructure/config/AppConfig.php:105:17
         foreach ($expectedKeys as $configKey => $params) {
             foreach ($params as $param) {
                 self::ensureKeyIsSet($param, $configItems[$configKey]);
-                self::ensureKeyIsNotEmpty($configItems[$configKey][$param], $param);
+                
             }
         }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamValueIsEmpty with data set "path" ('[logs]\rpath = \rdisplayError... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] LogicalOrSingleSubExprNegation
infrastructure/config/AppConfig.php:114:13
     private static function displayErrorForDebug(array $configItems): void
     {
         if (
-            self::noDebugEntryInConfig($configItems)
-            || self::debugEntryIsTurnedOffByFalse(
-                $configItems[self::ERROR]['debug']
-            )
+            if (!self::noDebugEntryInConfig($configItems) || self::debugEntryIsTurnedOffByFalse($configItems[self::ERROR]['debug'])) {
         ) {
             error_reporting(E_ERROR | E_PARSE);
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
TypeError: norsk\api\infrastructure\config\AppConfig::debugEntryIsTurnedOffByFalse(): Argument #1 ($debug) must be of type string|int|bool, null given, called in /app/api/src/infrastructure/config/AppConfig.php on line 74

/app/api/

[Killed] LogicalOr
infrastructure/config/AppConfig.php:114:13
     private static function displayErrorForDebug(array $configItems): void
     {
         if (
-            self::noDebugEntryInConfig($configItems)
-            || self::debugEntryIsTurnedOffByFalse(
-                $configItems[self::ERROR]['debug']
-            )
+            if (self::noDebugEntryInConfig($configItems) && self::debugEntryIsTurnedOffByFalse($configItems[self::ERROR]['debug'])) {
         ) {
             error_reporting(E_ERROR | E_PARSE);
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
TypeError: norsk\api\infrastructure\config\AppConfig::debugEntryIsTurnedOffByFalse(): Argument #1 ($debug) must be of type string|int|bool, null given, called in /app/api/src/infrastructure/config/AppConfig.php on line 74

/app/api/

[Killed] BitwiseOr
infrastructure/config/AppConfig.php:119:13
                 $configItems[self::ERROR]['debug']
             )
         ) {
-            error_reporting(E_ERROR | E_PARSE);
+            error_reporting(E_ERROR & E_PARSE);
         }
     }
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
E_ERROR | E_PARSE aktiv
Failed asserting that 0 is identical to 5.

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:365

FAILURES!
Tests: 32, Assertions: 57, Failures: 1.

[Killed] FunctionCallRemoval
infrastructure/config/AppConfig.php:119:13
                 $configItems[self::ERROR]['debug']
             )
         ) {
-            error_reporting(E_ERROR | E_PARSE);
+            
         }
     }
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanSetErrorLevelToProductionLevelWithoutWarnings
E_ERROR | E_PARSE aktiv
Failed asserting that 32767 is identical to 5.

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:365

FAILURES!
Tests: 32, Assertions: 57, Failures: 1.

[Killed] Identical
infrastructure/config/AppConfig.php:126:9
 
     private static function ensureKeyIsNotEmpty(string|int|bool|null $configItems, string $param): void
     {
-        if ($configItems === '') {
+        if ($configItems !== '') {
             throw new KeyHasEmptyValueException(
                 'Key is empty: ' . $param,
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
norsk\api\infrastructure\config\exceptions\KeyHasEmptyValueException: Key is empty: path

/app/api/src/infrastructure/config/AppConfig.php:81
/app/api/src/infrastructure/config/AppConfig.php:68
/app/api/src/infrastructure/config/App

[Killed] Throw_
infrastructure/config/AppConfig.php:127:13
     private static function ensureKeyIsNotEmpty(string|int|bool|null $configItems, string $param): void
     {
         if ($configItems === '') {
-            throw new KeyHasEmptyValueException(
-                'Key is empty: ' . $param,
-                ResponseCode::unprocessable->value
-            );
+            new KeyHasEmptyValueException('Key is empty: ' . $param, ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamValueIsEmpty with data set "path" ('[logs]\rpath = \rdisplayError... x\r\r', 'path')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "The given URL is not a valid URL: x" at
/app/api/src/shared/infrastructure/http/response/Url.php:28
/app/

[Killed] ConcatOperandRemoval
infrastructure/config/AppConfig.php:128:17
     {
         if ($configItems === '') {
             throw new KeyHasEmptyValueException(
-                'Key is empty: ' . $param,
+                throw new KeyHasEmptyValueException('Key is empty: ', ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamValueIsEmpty with data set "path" ('[logs]\rpath = \rdisplayError... x\r\r', 'path')
Failed asserting that exception message 'Key is empty: ' contains 'Key is empty: path'.

FAILURES!
Tests: 15, Assertions: 30, Failures: 1.

[Killed] Concat
infrastructure/config/AppConfig.php:128:17
     {
         if ($configItems === '') {
             throw new KeyHasEmptyValueException(
-                'Key is empty: ' . $param,
+                throw new KeyHasEmptyValueException($param . 'Key is empty: ', ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigParamValueIsEmpty with data set "path" ('[logs]\rpath = \rdisplayError... x\r\r', 'path')
Failed asserting that exception message 'pathKey is empty: ' contains 'Key is empty: path'.

FAILURES!
Tests: 15, Assertions: 30, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/config/AppConfig.php:137:9
 
     private static function readLoggerConfig(array $logConfigItems): AppLoggerConfig
     {
-        $path = Path::fromString(__DIR__ . self::API_ROOT . $logConfigItems['path']);
+        $path = Path::fromString(__DIR__ . self::API_ROOT);
         $displayErrorDetails = $logConfigItems['displayErrorDetails'];
         $logErrors = $logConfigItems['logErrors'];
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'/app/api/logs'
+'/app/api'

[Killed] Concat
infrastructure/config/AppConfig.php:137:9
 
     private static function readLoggerConfig(array $logConfigItems): AppLoggerConfig
     {
-        $path = Path::fromString(__DIR__ . self::API_ROOT . $logConfigItems['path']);
+        $path = Path::fromString(self::API_ROOT . __DIR__ . $logConfigItems['path']);
         $displayErrorDetails = $logConfigItems['displayErrorDetails'];
         $logErrors = $logConfigItems['logErrors'];
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
Failed asserting that false is identical to '/app/api/logs'.

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:249

FAILURES!
Tests: 27, Assertions: 52, Failures: 1.

[Killed] LogicalNot
infrastructure/config/AppConfig.php:159:9
 
     private static function noDebugEntryInConfig(array $configItems): bool
     {
-        return !isset($configItems[self::ERROR]['debug']);
+        return isset($configItems[self::ERROR]['debug']);
     }
 
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testThrowsExceptionIfConfigFirstLevelKeyIsMissing with data set "logs" ('[empty]\rempty=x\r[auth]\rmethod=x', 'logs')
TypeError: norsk\api\infrastructure\config\AppConfig::debugEntryIsTurnedOffByFalse(): Argument #1 ($debug) must be of type string|int|bool, null given, called in /app/api/src/infrastructure/config/AppConfig.php on line 74

/app/api/

[Killed] NotIdentical
infrastructure/config/AppConfig.php:165:9
 
     private static function debugEntryIsTurnedOffByFalse(int|string|bool $debug): bool
     {
-        return $debug !== true;
+        return $debug === true;
     }
 
killedBy: norsk\api\infrastructure\config\AppConfigTest::testDoestNotSetErrorLevelToProductionLevelWithoutWarningsIfDebugIsInConfig
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testDoestNotSetErrorLevelToProductionLevelWithoutWarningsIfDebugIsInConfig
E_ALL aktiv
Failed asserting that 5 is identical to 32767.

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:376

FAILURES!
Tests: 33, Assertions: 58, Failures: 1.

[Killed] PublicVisibility
infrastructure/config/AppConfig.php:169:5
     }
 
 
-    public function getLogPath(): Path
+    protected function getLogPath(): Path
     {
         return $this->appLoggerConfig->getPath();
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanGetLogPath
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::getLogPath() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:253

ERRORS!
Tests: 27, Assertions: 51, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/AppConfig.php:175:5
     }
 
 
-    public function getJwtConfig(): JwtConfig
+    protected function getJwtConfig(): JwtConfig
     {
         return $this->jwtConfig;
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCanGetJwtCredentials
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCanGetJwtCredentials
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::getJwtConfig() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:267

ERRORS!
Tests: 28, Assertions: 52, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/AppConfig.php:181:5
     }
 
 
-    public function getPepper(): Pepper
+    protected function getPepper(): Pepper
     {
         return $this->pepper;
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCenGetPepper
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCenGetPepper
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::getPepper() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:276

ERRORS!
Tests: 29, Assertions: 53, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/AppConfig.php:187:5
     }
 
 
-    public function getUrl(): Url
+    protected function getUrl(): Url
     {
         return $this->url;
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCenGetUrl
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCenGetUrl
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::getUrl() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:285

ERRORS!
Tests: 30, Assertions: 54, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/AppConfig.php:193:5
     }
 
 
-    public function getAppLoggerConfig(): AppLoggerConfig
+    protected function getAppLoggerConfig(): AppLoggerConfig
     {
         return $this->appLoggerConfig;
killedBy: norsk\api\infrastructure\config\AppConfigTest::testCenGetAppLoggerConfig
statusReason: 1) norsk\api\infrastructure\config\AppConfigTest::testCenGetAppLoggerConfig
Error: Call to protected method norsk\api\infrastructure\config\AppConfig::getAppLoggerConfig() from scope norsk\api\infrastructure\config\AppConfigTest

/app/api/tests/unit/infrastructure/config/AppConfigTest.php:299

ERRORS!
Tests: 31, Assertions: 55, Errors: 1.
