[Killed] PublicVisibility
infrastructure/http/response/ResponseHeaders.php:27:5
     }
 
 
-    public static function create(Url $url): self
+    protected static function create(Url $url): self
     {
         return new self($url);
killedBy: norsk\api\infrastructure\response\ResponseHeadersTest::testCanBeUsedAsArray
statusReason: 1) norsk\api\infrastructure\response\ResponseHeadersTest::testCanBeUsedAsArray
Error: Call to protected method norsk\api\shared\infrastructure\http\response\ResponseHeaders::create() from scope norsk\api\infrastructure\response\ResponseHeadersTest

/app/api/tests/unit/infrastructure/response/ResponseHeadersTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
