[Killed] MethodCallRemoval
infrastructure/config/DbConfig.php:57:9
      */
     private static function ensureConfigIsValid(array $configItems): void
     {
-        self::ensureKeysExist($configItems);
+        
         self::ensureKeysHaveValues($configItems);
     }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfKeyDoesNotExist with data set "host" ('[database]', 'db_server')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\infrastructure\persistence\Host::fromString(): Argument #1 ($host) must be of type string, null given, called in /app/api/src/infrastructure/c

[Killed] MethodCallRemoval
infrastructure/config/DbConfig.php:58:9
     private static function ensureConfigIsValid(array $configItems): void
     {
         self::ensureKeysExist($configItems);
-        self::ensureKeysHaveValues($configItems);
+        
     }
 
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "Host is not set" at
/app/api/src/infrastructure/persistence/Host.php:28
/app/api/src/infrastructure/persist

[Killed] Foreach_
infrastructure/config/DbConfig.php:66:9
     {
         $neededKeys = self::getKeys();
 
-        foreach ($neededKeys as $neededKey) {
-            if (!array_key_exists($neededKey, $configItems[self::DATABASE])) {
-                throw new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
-            }
-        }
+        foreach ([] as $neededKey) {
     }
 
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfKeyDoesNotExist with data set "host" ('[database]', 'db_server')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\infrastructure\persistence\Host::fromString(): Argument #1 ($host) must be of type string, null given, called in /app/api/src/infrastructure/c

[Killed] LogicalNot
infrastructure/config/DbConfig.php:67:13
         $neededKeys = self::getKeys();
 
         foreach ($neededKeys as $neededKey) {
-            if (!array_key_exists($neededKey, $configItems[self::DATABASE])) {
+            if (array_key_exists($neededKey, $configItems[self::DATABASE])) {
                 throw new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
             }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
norsk\api\infrastructure\config\exceptions\KeyIsNotSetException: db_server is not set.

/app/api/src/infrastructure/config/DbConfig.php:45
/app/api/src/infrastructure/config/DbConfig.php:37
/app/api/src/infrastructure/config/DbConfig.p

[Killed] Throw_
infrastructure/config/DbConfig.php:68:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $configItems[self::DATABASE])) {
-                throw new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
+                new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfKeyDoesNotExist with data set "host" ('[database]', 'db_server')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\infrastructure\persistence\Host::fromString(): Argument #1 ($host) must be of type string, null given, called in /app/api/src/infrastructure/c

[Killed] Concat
infrastructure/config/DbConfig.php:68:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $configItems[self::DATABASE])) {
-                throw new KeyIsNotSetException($neededKey . ' is not set.', ResponseCode::unprocessable->value);
+                throw new KeyIsNotSetException(' is not set.' . $neededKey, ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfKeyDoesNotExist with data set "host" ('[database]', 'db_server')
Failed asserting that exception message ' is not set.db_server' contains 'db_server is not set.'.

FAILURES!
Tests: 7, Assertions: 20, Failures: 1.

[Killed] Foreach_
infrastructure/config/DbConfig.php:93:9
     {
         $neededKeys = self::getKeys();
 
-        foreach ($neededKeys as $neededKey) {
-            if ($configItems[self::DATABASE][$neededKey] === '') {
-                throw new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
-            }
-        }
+        foreach ([] as $neededKey) {
     }
 
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
Failed asserting that exception of type "InvalidArgumentException" matches expected exception "RuntimeException". Message was: "Host is not set" at
/app/api/src/infrastructure/persistence/Host.php:28
/app/api/src/infrastructure/persist

[Killed] Identical
infrastructure/config/DbConfig.php:94:13
         $neededKeys = self::getKeys();
 
         foreach ($neededKeys as $neededKey) {
-            if ($configItems[self::DATABASE][$neededKey] === '') {
+            if ($configItems[self::DATABASE][$neededKey] !== '') {
                 throw new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
             }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
norsk\api\infrastructure\config\exceptions\KeyHasEmptyValueException: db_server is empty.

/app/api/src/infrastructure/config/DbConfig.php:61
/app/api/src/infrastructure/config/DbConfig.php:38
/app/api/src/infrastructure/config/DbConfi

[Killed] ConcatOperandRemoval
infrastructure/config/DbConfig.php:95:17
 
         foreach ($neededKeys as $neededKey) {
             if ($configItems[self::DATABASE][$neededKey] === '') {
-                throw new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
+                throw new KeyHasEmptyValueException(' is empty.', ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
Failed asserting that exception message ' is empty.' contains 'db_server is empty.'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/config/DbConfig.php:95:17
 
         foreach ($neededKeys as $neededKey) {
             if ($configItems[self::DATABASE][$neededKey] === '') {
-                throw new KeyHasEmptyValueException($neededKey . ' is empty.', ResponseCode::unprocessable->value);
+                throw new KeyHasEmptyValueException($neededKey, ResponseCode::unprocessable->value);
             }
         }
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testThrowsExceptionIfValueDoesNotExist with data set "host" ('[database]\rdb_server = \rdb_... = foo', 'db_server')
Failed asserting that exception message 'db_server' contains 'db_server is empty.'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
infrastructure/config/DbConfig.php:101:5
     }
 
 
-    public function host(): Host
+    protected function host(): Host
     {
         return $this->host;
killedBy: norsk\api\infrastructure\config\DbConfigTest::testCanReadDbServer
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testCanReadDbServer
Error: Call to protected method norsk\api\infrastructure\config\DbConfig::host() from scope norsk\api\infrastructure\config\DbConfigTest

/app/api/tests/unit/infrastructure/config/DbConfigTest.php:71

ERRORS!
Tests: 12, Assertions: 33, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/DbConfig.php:107:5
     }
 
 
-    public function database(): DatabaseName
+    protected function database(): DatabaseName
     {
         return $this->name;
killedBy: norsk\api\infrastructure\config\DbConfigTest::testCanReadDatabaseName
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testCanReadDatabaseName
Error: Call to protected method norsk\api\infrastructure\config\DbConfig::database() from scope norsk\api\infrastructure\config\DbConfigTest

/app/api/tests/unit/infrastructure/config/DbConfigTest.php:77

ERRORS!
Tests: 13, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/DbConfig.php:113:5
     }
 
 
-    public function user(): User
+    protected function user(): User
     {
         return $this->user;
killedBy: norsk\api\infrastructure\config\DbConfigTest::testCanReadDbUser
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testCanReadDbUser
Error: Call to protected method norsk\api\infrastructure\config\DbConfig::user() from scope norsk\api\infrastructure\config\DbConfigTest

/app/api/tests/unit/infrastructure/config/DbConfigTest.php:95

ERRORS!
Tests: 16, Assertions: 37, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/DbConfig.php:119:5
     }
 
 
-    public function password(): Password
+    protected function password(): Password
     {
         return $this->password;
killedBy: norsk\api\infrastructure\config\DbConfigTest::testCanReadDbPassword
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testCanReadDbPassword
Error: Call to protected method norsk\api\infrastructure\config\DbConfig::password() from scope norsk\api\infrastructure\config\DbConfigTest

/app/api/tests/unit/infrastructure/config/DbConfigTest.php:83

ERRORS!
Tests: 14, Assertions: 35, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/DbConfig.php:125:5
     }
 
 
-    public function port(): Port
+    protected function port(): Port
     {
         return $this->port;
killedBy: norsk\api\infrastructure\config\DbConfigTest::testCanReadPort
statusReason: 1) norsk\api\infrastructure\config\DbConfigTest::testCanReadPort
Error: Call to protected method norsk\api\infrastructure\config\DbConfig::port() from scope norsk\api\infrastructure\config\DbConfigTest

/app/api/tests/unit/infrastructure/config/DbConfigTest.php:89

ERRORS!
Tests: 15, Assertions: 36, Errors: 1.
