[Killed] PublicVisibility
infrastructure/http/response/UnauthorizedResponse.php:11:5
 
 class UnauthorizedResponse
 {
-    public static function noHeader(Url $url): Response
+    protected static function noHeader(Url $url): Response
     {
         return new Response(
killedBy: norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoHeaderResponse
statusReason: 1) norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoHeaderResponse
Error: Call to protected method norsk\api\shared\infrastructure\http\response\UnauthorizedResponse::noHeader() from scope norsk\api\infrastructure\response\UnauthorizedResponseTest

/app/api/tests/unit/infrastructure/response/UnauthorizedResponseTest.php:36

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/http/response/UnauthorizedResponse.php:21:5
     }
 
 
-    public static function noManagingRights(Url $url): Response
+    protected static function noManagingRights(Url $url): Response
     {
         return new Response(
killedBy: norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoRightsForManagerResponse
statusReason: 1) norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoRightsForManagerResponse
Error: Call to protected method norsk\api\shared\infrastructure\http\response\UnauthorizedResponse::noManagingRights() from scope norsk\api\infrastructure\response\UnauthorizedResponseTest

/app/api/tests/unit/infrastructure/response/UnauthorizedResponseTest.php:47

ERRORS!
Tests: 2, Assertions

[Killed] PublicVisibility
infrastructure/http/response/UnauthorizedResponse.php:31:5
     }
 
 
-    public static function noTrainingRights(Url $url): Response
+    protected static function noTrainingRights(Url $url): Response
     {
         return new Response(
killedBy: norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoRightsForTrainerResponse
statusReason: 1) norsk\api\infrastructure\response\UnauthorizedResponseTest::testCanCreateAsNoRightsForTrainerResponse
Error: Call to protected method norsk\api\shared\infrastructure\http\response\UnauthorizedResponse::noTrainingRights() from scope norsk\api\infrastructure\response\UnauthorizedResponseTest

/app/api/tests/unit/infrastructure/response/UnauthorizedResponseTest.php:58

ERRORS!
Tests: 3, Assertions
