[Killed] PublicVisibility
infrastructure/config/File.php:16:5
     }
 
 
-    public static function fromPath(Path $path): self
+    protected static function fromPath(Path $path): self
     {
         return new self($path);
killedBy: norsk\api\infrastructure\config\FileTest::testCanGetPath
statusReason: 1) norsk\api\infrastructure\config\FileTest::testCanGetPath
Error: Call to protected method norsk\api\infrastructure\config\File::fromPath() from scope norsk\api\infrastructure\config\FileTest

/app/api/tests/unit/infrastructure/config/FileTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/File.php:22:5
     }
 
 
-    public function parseIniFile(): IniItems
+    protected function parseIniFile(): IniItems
     {
         $this->isReadable();
killedBy: norsk\api\infrastructure\config\FileTest::testCanParseIniFile
statusReason: 1) norsk\api\infrastructure\config\FileTest::testCanParseIniFile
Error: Call to protected method norsk\api\infrastructure\config\File::parseIniFile() from scope norsk\api\infrastructure\config\FileTest

/app/api/tests/unit/infrastructure/config/FileTest.php:29

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/config/File.php:24:9
 
     public function parseIniFile(): IniItems
     {
-        $this->isReadable();
+        
         $content = parse_ini_file($this->getPath()->asString(), true, INI_SCANNER_TYPED);
 
killedBy: norsk\api\infrastructure\config\FileTest::testThrowsExceptionIfFileIsNotReadable
statusReason: 1) norsk\api\infrastructure\config\FileTest::testThrowsExceptionIfFileIsNotReadable
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\infrastructure\config\IniItems::fromAssocArray(): Argument #1 ($items) must be of type array, false given, called in /app/api/src/infrastructure/config/File.php on line 20" at
/app/api/src/infr

[Killed] LogicalNot
infrastructure/config/File.php:33:9
 
     private function isReadable(): void
     {
-        if (!is_readable($this->path->asString())) {
+        if (is_readable($this->path->asString())) {
             throw new RuntimeException("Cannot read file: {$this->path->asString()}");
         }
killedBy: norsk\api\infrastructure\config\FileTest::testCanParseIniFile
statusReason: 1) norsk\api\infrastructure\config\FileTest::testCanParseIniFile
RuntimeException: Cannot read file: /app/api/tests/unit/infrastructure/config/../resources/mySqlConfig.test.ini

/app/api/src/infrastructure/config/File.php:25
/app/api/src/infrastructure/config/File.php:18
/app/api/tests/unit/infrastructure/config/FileTest.php:29

ERRORS!

[Killed] Throw_
infrastructure/config/File.php:34:13
     private function isReadable(): void
     {
         if (!is_readable($this->path->asString())) {
-            throw new RuntimeException("Cannot read file: {$this->path->asString()}");
+            new RuntimeException("Cannot read file: {$this->path->asString()}");
         }
     }
killedBy: norsk\api\infrastructure\config\FileTest::testThrowsExceptionIfFileIsNotReadable
statusReason: 1) norsk\api\infrastructure\config\FileTest::testThrowsExceptionIfFileIsNotReadable
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\infrastructure\config\IniItems::fromAssocArray(): Argument #1 ($items) must be of type array, false given, called in /app/api/src/infrastructure/config/File.php on line 20" at
/app/api/src/infr

[Killed] PublicVisibility
infrastructure/config/File.php:39:5
     }
 
 
-    public function getPath(): Path
+    protected function getPath(): Path
     {
         return $this->path;
killedBy: norsk\api\infrastructure\config\FileTest::testCanGetPath
statusReason: 1) norsk\api\infrastructure\config\FileTest::testCanGetPath
Error: Call to protected method norsk\api\infrastructure\config\File::getPath() from scope norsk\api\infrastructure\config\FileTest

/app/api/tests/unit/infrastructure/config/FileTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
