[Killed] PublicVisibility
http/response/exceptionMapper/LoginExceptionMapper.php:18:5
 
 class LoginExceptionMapper
 {
-    public static function map(Throwable|Exception $throwable, Url $url): ResponseInterface
+    protected static function map(Throwable|Exception $throwable, Url $url): ResponseInterface
     {
         $code = $throwable->getCode();
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "ParameterMissingException" (norsk\api\user\domain\exceptions\ParameterMissingException Object (...), 400)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\exceptionMapper\LoginExceptionMapper::map() from scope norsk\api\infrastructure\response\exceptionMapper\LoginExce

[Killed] MatchArmRemoval
http/response/exceptionMapper/LoginExceptionMapper.php:22:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value
-            => self::parameterMissingResponse($url, $throwable),
-
-            $code === ResponseCode::unauthorized->value
-            => self::credentialsAreInvalidOrUserDoesNotExistResponse($url, $throwable),
-
-            $code === ResponseCode::forbidden->value
-            => self::noActiveUserResponse($url, $throwable),
-
-            $code === ResponseCode::unprocessable->value
-            => self::inputNotValidResponse($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        $throwable instanceof ParameterMissingException => self::parameterMissingResponse($url, $throwable),
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Failed asserting that 500 matches expected 400.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] MatchArmRemoval
http/response/exceptionMapper/LoginExceptionMapper.php:22:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value
-            => self::parameterMissingResponse($url, $throwable),
-
-            $code === ResponseCode::unauthorized->value
-            => self::credentialsAreInvalidOrUserDoesNotExistResponse($url, $throwable),
-
-            $code === ResponseCode::forbidden->value
-            => self::noActiveUserResponse($url, $throwable),
-
-            $code === ResponseCode::unprocessable->value
-            => self::inputNotValidResponse($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "UnauthorizedException" (Exception Object (...), 401)
Failed asserting that 500 matches expected 401.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] InstanceOf_
http/response/exceptionMapper/LoginExceptionMapper.php:23:13
         $code = $throwable->getCode();
 
         return match (true) {
-            $throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value
+            !$throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value => self::parameterMissingResponse($url, $throwable),
             => self::parameterMissingResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "UnauthorizedException" (Exception Object (...), 401)
Failed asserting that 400 matches expected 401.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/LoginExceptionMapper.php:23:13
         $code = $throwable->getCode();
 
         return match (true) {
-            $throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value
+            $throwable instanceof ParameterMissingException, $code !== ResponseCode::badRequest->value => self::parameterMissingResponse($url, $throwable),
             => self::parameterMissingResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Failed asserting that 500 matches expected 400.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/LoginExceptionMapper.php:26:13
             $throwable instanceof ParameterMissingException, $code === ResponseCode::badRequest->value
             => self::parameterMissingResponse($url, $throwable),
 
-            $code === ResponseCode::unauthorized->value
+            $code !== ResponseCode::unauthorized->value => self::credentialsAreInvalidOrUserDoesNotExistResponse($url, $throwable),
             => self::credentialsAreInvalidOrUserDoesNotExistResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "UnauthorizedException" (Exception Object (...), 401)
Failed asserting that 500 matches expected 401.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/LoginExceptionMapper.php:29:13
             $code === ResponseCode::unauthorized->value
             => self::credentialsAreInvalidOrUserDoesNotExistResponse($url, $throwable),
 
-            $code === ResponseCode::forbidden->value
+            $code !== ResponseCode::forbidden->value => self::noActiveUserResponse($url, $throwable),
             => self::noActiveUserResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "ForbiddenException" (Exception Object (...), 403)
Failed asserting that 500 matches expected 403.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/LoginExceptionMapper.php:32:13
             $code === ResponseCode::forbidden->value
             => self::noActiveUserResponse($url, $throwable),
 
-            $code === ResponseCode::unprocessable->value
+            $code !== ResponseCode::unprocessable->value => self::inputNotValidResponse($url, $throwable),
             => self::inputNotValidResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\LoginExceptionMapperTest::testMap with data set "UnprocessableException" (Exception Object (...), 422)
Failed asserting that 500 matches expected 422.

/app/api/tests/unit/infrastructure/response/exceptionMapper/LoginExceptionMapperTest.php:35

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.
