[Killed] PublicVisibility
infrastructure/config/IniItems.php:17:5
     }
 
 
-    public static function fromAssocArray(array $items): self
+    protected static function fromAssocArray(array $items): self
     {
         return new self($items);
killedBy: norsk\api\infrastructure\config\IniItemsTest::testCanBeUsedAsArray
statusReason: 1) norsk\api\infrastructure\config\IniItemsTest::testCanBeUsedAsArray
Error: Call to protected method norsk\api\infrastructure\config\IniItems::fromAssocArray() from scope norsk\api\infrastructure\config\IniItemsTest

/app/api/tests/unit/infrastructure/config/IniItemsTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/IniItems.php:23:5
     }
 
 
-    public function asArray(): array
+    protected function asArray(): array
     {
         return $this->items;
killedBy: norsk\api\infrastructure\config\IniItemsTest::testCanBeUsedAsArray
statusReason: 1) norsk\api\infrastructure\config\IniItemsTest::testCanBeUsedAsArray
Error: Call to protected method norsk\api\infrastructure\config\IniItems::asArray() from scope norsk\api\infrastructure\config\IniItemsTest

/app/api/tests/unit/infrastructure/config/IniItemsTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
