[Killed] PublicVisibility
infrastructure/config/Path.php:14:5
     }
 
 
-    public static function fromString(string $path): self
+    protected static function fromString(string $path): self
     {
         return new self($path);
killedBy: norsk\api\infrastructure\config\PathTest::testCanBeUsedAsString
statusReason: 1) norsk\api\infrastructure\config\PathTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\infrastructure\config\Path::fromString() from scope norsk\api\infrastructure\config\PathTest

/app/api/tests/unit/infrastructure/config/PathTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/config/Path.php:20:5
     }
 
 
-    public function asString(): string
+    protected function asString(): string
     {
         return $this->path;
killedBy: norsk\api\infrastructure\config\PathTest::testCanBeUsedAsString
statusReason: 1) norsk\api\infrastructure\config\PathTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\infrastructure\config\Path::asString() from scope norsk\api\infrastructure\config\PathTest

/app/api/tests/unit/infrastructure/config/PathTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
