[Killed] PublicVisibility
user/application/UserLogin.php:23:5
     }
 
 
-    public function handle(LoginUser $command): LoggedInUser
+    protected function handle(LoginUser $command): LoggedInUser
     {
         $validatedUser = $this->userRepository->getDataFor(
killedBy: norsk\api\user\application\UserLoginTest::testCanHandleCommand
statusReason: 1) norsk\api\user\application\UserLoginTest::testCanHandleCommand
Error: Call to protected method norsk\api\user\application\UserLogin::handle() from scope norsk\api\user\application\UserLoginTest

/app/api/tests/unit/user/application/UserLoginTest.php:50

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
