[Killed] MethodCallRemoval
user/application/useCases/LoginUser.php:29:9
     public static function by(Payload $payload): self
     {
         $payloadArray = $payload->asArray();
-        self::ensureFieldsExists($payloadArray);
+        
 
         $userName = UserName::by($payloadArray[self::USERNAME]);
statusReason: 1) norsk\api\user\application\useCases\LoginUserTest::testThrowsExceptionIfFieldIsMissing with data set "missing username" (['shhhhhhhhhhhhhhhhhhhhhhhhhh!!'])
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/LoginUser.php:22
/app/api/tests/unit/user/application/useCases/LoginUserTest.php:64
.

FAILURES!

[Killed] Foreach_
user/application/useCases/LoginUser.php:40:9
 
     private static function ensureFieldsExists(array $payloadArray): void
     {
-        foreach ([self::USERNAME, self::PASSWORD] as $field) {
-            if (empty($payloadArray[$field])) {
-                throw new ParameterMissingException(Parameter::by($field));
-            }
-        }
+        foreach ([] as $field) {
     }
 
statusReason: 1) norsk\api\user\application\useCases\LoginUserTest::testThrowsExceptionIfFieldIsMissing with data set "missing username" (['shhhhhhhhhhhhhhhhhhhhhhhhhh!!'])
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/LoginUser.php:22
/app/api/tests/unit/user/application/useCases/LoginUserTest.php:64
.

FAILURES!

[Killed] ArrayItemRemoval
user/application/useCases/LoginUser.php:40:9
 
     private static function ensureFieldsExists(array $payloadArray): void
     {
-        foreach ([self::USERNAME, self::PASSWORD] as $field) {
+        foreach ([self::PASSWORD] as $field) {
             if (empty($payloadArray[$field])) {
                 throw new ParameterMissingException(Parameter::by($field));
statusReason: 1) norsk\api\user\application\useCases\LoginUserTest::testThrowsExceptionIfFieldIsMissing with data set "missing username" (['shhhhhhhhhhhhhhhhhhhhhhhhhh!!'])
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/LoginUser.php:22
/app/api/tests/unit/user/application/useCases/LoginUserTest.php:64
.

FAILURES!

[Killed] Throw_
user/application/useCases/LoginUser.php:42:17
     {
         foreach ([self::USERNAME, self::PASSWORD] as $field) {
             if (empty($payloadArray[$field])) {
-                throw new ParameterMissingException(Parameter::by($field));
+                new ParameterMissingException(Parameter::by($field));
             }
         }
statusReason: 1) norsk\api\user\application\useCases\LoginUserTest::testThrowsExceptionIfFieldIsMissing with data set "missing username" (['shhhhhhhhhhhhhhhhhhhhhhhhhh!!'])
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/LoginUser.php:22
/app/api/tests/unit/user/application/useCases/LoginUserTest.php:64
.

FAILURES!

[Killed] PublicVisibility
user/application/useCases/LoginUser.php:54:5
     }
 
 
-    public function getPassword(): InputPassword
+    protected function getPassword(): InputPassword
     {
         return $this->password;
killedBy: norsk\api\user\application\useCases\LoginUserTest::testCanGetPassword
statusReason: 1) norsk\api\user\application\useCases\LoginUserTest::testCanGetPassword
Error: Call to protected method norsk\api\user\application\useCases\LoginUser::getPassword() from scope norsk\api\user\application\useCases\LoginUserTest

/app/api/tests/unit/user/application/useCases/LoginUserTest.php:51

ERRORS!
Tests: 6, Assertions: 5, Errors: 1.
