[Killed] PublicVisibility
infrastructure/logging/AppLoggerConfig.php:20:5
     }
 
 
-    public static function by(
+    protected static function by(Path $path, bool $displayErrorDetails, bool $logErrors, bool $logErrorDetails): self
         Path $path,
         bool $displayErrorDetails,
killedBy: norsk\api\infrastructure\logging\AppLoggerConfigTest::testCanGetPath
statusReason: 1) norsk\api\infrastructure\logging\AppLoggerConfigTest::testCanGetPath
Error: Call to protected method norsk\api\infrastructure\logging\AppLoggerConfig::by() from scope norsk\api\infrastructure\logging\AppLoggerConfigTest

/app/api/tests/unit/infrastructure/logging/AppLoggerConfigTest.php:72

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/logging/AppLoggerConfig.php:36:5
     }
 
 
-    public function isDisplayErrorDetails(): bool
+    protected function isDisplayErrorDetails(): bool
     {
         return $this->displayErrorDetails;
killedBy: norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsTrueForDisplayErrorDetails
statusReason: 1) norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsTrueForDisplayErrorDetails
Error: Call to protected method norsk\api\infrastructure\logging\AppLoggerConfig::isDisplayErrorDetails() from scope norsk\api\infrastructure\logging\AppLoggerConfigTest

/app/api/tests/unit/infrastructure/logging/AppLoggerConfigTest.php:34

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
infrastructure/logging/AppLoggerConfig.php:42:5
     }
 
 
-    public function isLogErrors(): bool
+    protected function isLogErrors(): bool
     {
         return $this->logErrors;
killedBy: norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsTrueForLogErrors
statusReason: 1) norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsTrueForLogErrors
Error: Call to protected method norsk\api\infrastructure\logging\AppLoggerConfig::isLogErrors() from scope norsk\api\infrastructure\logging\AppLoggerConfigTest

/app/api/tests/unit/infrastructure/logging/AppLoggerConfigTest.php:40

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
infrastructure/logging/AppLoggerConfig.php:48:5
     }
 
 
-    public function isLogErrorDetails(): bool
+    protected function isLogErrorDetails(): bool
     {
         return $this->logErrorDetails;
killedBy: norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsFalseForLogErrorDetails
statusReason: 1) norsk\api\infrastructure\logging\AppLoggerConfigTest::testReturnsFalseForLogErrorDetails
Error: Call to protected method norsk\api\infrastructure\logging\AppLoggerConfig::isLogErrorDetails() from scope norsk\api\infrastructure\logging\AppLoggerConfigTest

/app/api/tests/unit/infrastructure/logging/AppLoggerConfigTest.php:64

ERRORS!
Tests: 7, Assertions: 6, Errors: 1.
