[Killed] PublicVisibility
infrastructure/logging/LogMessage.php:14:5
     }
 
 
-    public static function fromString(string $string): self
+    protected static function fromString(string $string): self
     {
         return new self($string);
killedBy: norsk\api\infrastructure\logging\LogMessageTest::testCanBeUsedAsString
statusReason: 1) norsk\api\infrastructure\logging\LogMessageTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\infrastructure\logging\LogMessage::fromString() from scope norsk\api\infrastructure\logging\LogMessageTest

/app/api/tests/unit/infrastructure/logging/LogMessageTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
