[Killed] PublicVisibility
user/domain/model/JwtAuthenticatedUser.php:25:5
     }
 
 
-    public static function byPayload(Payload $payload): self
+    protected static function byPayload(Payload $payload): self
     {
         $decodedPayload = $payload->asArray();
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
Error: Call to protected method norsk\api\user\domain\model\JwtAuthenticatedUser::byPayload() from scope norsk\api\user\domain\model\JwtAuthenticatedUserTest

/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:32

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
user/domain/model/JwtAuthenticatedUser.php:29:9
     {
         $decodedPayload = $payload->asArray();
 
-        self::ensureNicknameExists($decodedPayload);
+        
         $role = self::getScope($decodedPayload);
 
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfNicknameDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfNicknameDoesNotExist
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:22
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:82
.

FAILURES!

[Killed] LogicalNot
user/domain/model/JwtAuthenticatedUser.php:41:9
 
     private static function ensureNicknameExists(array $decodedPayload): void
     {
-        if (!array_key_exists('nickname', $decodedPayload)) {
+        if (array_key_exists('nickname', $decodedPayload)) {
             throw new InvalidArgumentException('Nickname not found in JWT payload.');
         }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
InvalidArgumentException: Nickname not found in JWT payload.

/app/api/src/user/domain/model/JwtAuthenticatedUser.php:27
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:20
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:32

ERRORS!

[Killed] Throw_
user/domain/model/JwtAuthenticatedUser.php:42:13
     private static function ensureNicknameExists(array $decodedPayload): void
     {
         if (!array_key_exists('nickname', $decodedPayload)) {
-            throw new InvalidArgumentException('Nickname not found in JWT payload.');
+            new InvalidArgumentException('Nickname not found in JWT payload.');
         }
     }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfNicknameDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfNicknameDoesNotExist
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:22
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:82
.

FAILURES!

[Killed] MethodCallRemoval
user/domain/model/JwtAuthenticatedUser.php:49:9
 
     private static function getScope(array $decodedPayload): Role
     {
-        self::ensureScopeExists($decodedPayload);
+        
 
         $scopeValue = str_replace(search: 'is:', replace: '', subject: $decodedPayload['scope']);
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeDoesNotExist
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "str_replace(): Argument #3 ($subject) must be of type array|string, null given" at
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:33
/app/api/src/user/domain/model/JwtAuthent

[Killed] UnwrapStrReplace
user/domain/model/JwtAuthenticatedUser.php:51:9
     {
         self::ensureScopeExists($decodedPayload);
 
-        $scopeValue = str_replace(search: 'is:', replace: '', subject: $decodedPayload['scope']);
+        $scopeValue = $decodedPayload['scope'];
         $role = Role::tryFrom($scopeValue);
 
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
InvalidArgumentException: Invalid scope in JWT payload: is:user

/app/api/src/user/domain/model/JwtAuthenticatedUser.php:47
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:35
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:21
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:32

[Killed] MethodCallRemoval
user/domain/model/JwtAuthenticatedUser.php:54:9
         $scopeValue = str_replace(search: 'is:', replace: '', subject: $decodedPayload['scope']);
         $role = Role::tryFrom($scopeValue);
 
-        self::ensureScopeIsValid($role, $scopeValue);
+        
 
         return $role;
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "norsk\api\user\domain\model\JwtAuthenticatedUser::getScope(): Return value must be of type norsk\api\user\domain\model\Role, null returned" at
/app/api/src/user/domain/model/JwtAuthenti

[Killed] LogicalNot
user/domain/model/JwtAuthenticatedUser.php:62:9
 
     private static function ensureScopeExists(array $decodedPayload): void
     {
-        if (!array_key_exists('scope', $decodedPayload)) {
+        if (array_key_exists('scope', $decodedPayload)) {
             throw new InvalidArgumentException('Scope not found in JWT payload.');
         }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
InvalidArgumentException: Scope not found in JWT payload.

/app/api/src/user/domain/model/JwtAuthenticatedUser.php:41
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:32
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:21
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:32

[Killed] Throw_
user/domain/model/JwtAuthenticatedUser.php:63:13
     private static function ensureScopeExists(array $decodedPayload): void
     {
         if (!array_key_exists('scope', $decodedPayload)) {
-            throw new InvalidArgumentException('Scope not found in JWT payload.');
+            new InvalidArgumentException('Scope not found in JWT payload.');
         }
     }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeDoesNotExist
Failed asserting that exception of type "TypeError" matches expected exception "InvalidArgumentException". Message was: "str_replace(): Argument #3 ($subject) must be of type array|string, null given" at
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:33
/app/api/src/user/domain/model/JwtAuthent

[Killed] Identical
user/domain/model/JwtAuthenticatedUser.php:70:9
 
     private static function ensureScopeIsValid(?Role $role, string $scopeValue): void
     {
-        if ($role === null) {
+        if ($role !== null) {
             throw new InvalidArgumentException('Invalid scope in JWT payload: ' . $scopeValue);
         }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByClass
InvalidArgumentException: Invalid scope in JWT payload: user

/app/api/src/user/domain/model/JwtAuthenticatedUser.php:47
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:35
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:21
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:32

[Killed] ConcatOperandRemoval
user/domain/model/JwtAuthenticatedUser.php:71:13
     private static function ensureScopeIsValid(?Role $role, string $scopeValue): void
     {
         if ($role === null) {
-            throw new InvalidArgumentException('Invalid scope in JWT payload: ' . $scopeValue);
+            throw new InvalidArgumentException($scopeValue);
         }
     }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
Failed asserting that exception message 'invalid' contains 'Invalid scope in JWT payload: invalid'.

FAILURES!
Tests: 8, Assertions: 13, Failures: 1.

[Killed] Concat
user/domain/model/JwtAuthenticatedUser.php:71:13
     private static function ensureScopeIsValid(?Role $role, string $scopeValue): void
     {
         if ($role === null) {
-            throw new InvalidArgumentException('Invalid scope in JWT payload: ' . $scopeValue);
+            throw new InvalidArgumentException($scopeValue . 'Invalid scope in JWT payload: ');
         }
     }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfScopeIsNotValid
Failed asserting that exception message 'invalidInvalid scope in JWT payload: ' contains 'Invalid scope in JWT payload: invalid'.

FAILURES!
Tests: 8, Assertions: 13, Failures: 1.

[Killed] PublicVisibility
user/domain/model/JwtAuthenticatedUser.php:76:5
     }
 
 
-    public static function byRequest(ServerRequestInterface $request): self
+    protected static function byRequest(ServerRequestInterface $request): self
     {
         $user = $request->getAttribute(self::AUTHENTICATED_USER);
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByRequest
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByRequest
Error: Call to protected method norsk\api\user\domain\model\JwtAuthenticatedUser::byRequest() from scope norsk\api\user\domain\model\JwtAuthenticatedUserTest

/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:45

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
user/domain/model/JwtAuthenticatedUser.php:79:9
     public static function byRequest(ServerRequestInterface $request): self
     {
         $user = $request->getAttribute(self::AUTHENTICATED_USER);
-        self::ensureAuthenticatedUserExists($user);
+        
 
         return new self($user->getUserName(), $user->getRole());
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfAuthenticatedUserDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfAuthenticatedUserDoesNotExist
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to a member function getUserName() on null" at
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:54
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.p

[Killed] Identical
user/domain/model/JwtAuthenticatedUser.php:99:9
 
     private static function ensureAuthenticatedUserExists(?JwtAuthenticatedUser $user): void
     {
-        if ($user === null) {
+        if ($user !== null) {
             throw new InvalidArgumentException('Authenticated user not found in JWT payload.');
         }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByRequest
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testCanBeCreatedByRequest
InvalidArgumentException: Authenticated user not found in JWT payload.

/app/api/src/user/domain/model/JwtAuthenticatedUser.php:67
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:53
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:45

ERRORS!

[Killed] Throw_
user/domain/model/JwtAuthenticatedUser.php:100:13
     private static function ensureAuthenticatedUserExists(?JwtAuthenticatedUser $user): void
     {
         if ($user === null) {
-            throw new InvalidArgumentException('Authenticated user not found in JWT payload.');
+            new InvalidArgumentException('Authenticated user not found in JWT payload.');
         }
     }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfAuthenticatedUserDoesNotExist
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testThrowsExceptionIfAuthenticatedUserDoesNotExist
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to a member function getUserName() on null" at
/app/api/src/user/domain/model/JwtAuthenticatedUser.php:54
/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.p

[Killed] Identical
user/domain/model/JwtAuthenticatedUser.php:107:9
 
     public function roleEquals(Role $role): bool
     {
-        return $this->getRole() === $role;
+        return $this->getRole() !== $role;
     }
 }
killedBy: norsk\api\user\domain\model\JwtAuthenticatedUserTest::testRoleEquals
statusReason: 1) norsk\api\user\domain\model\JwtAuthenticatedUserTest::testRoleEquals
Failed asserting that false is true.

/app/api/tests/unit/user/domain/model/JwtAuthenticatedUserTest.php:67

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.
