[Killed] PublicVisibility
user/domain/valueObjects/InputPassword.php:22:5
     }
 
 
-    public static function by(
+    protected static function by(
         #[SensitiveParameter]
         string $password
killedBy: norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithValidPassword
statusReason: 1) norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithValidPassword
Error: Call to protected method norsk\api\user\domain\valueObjects\InputPassword::by() from scope norsk\api\user\InputPasswordTest

/app/api/tests/unit/user/domain/valueObjects/InputPasswordTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] UnwrapTrim
user/domain/valueObjects/InputPassword.php:26:9
         #[SensitiveParameter]
         string $password
     ): self {
-        $trimmed = trim($password);
+        $trimmed = $password;
 
         self::ensureIsLongEnough($trimmed);
killedBy: norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithTrimmedWhitespace
statusReason: 1) norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithTrimmedWhitespace
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'validTrimmedPassword'
+'   validTrimmedPassword   '

[Killed] MethodCallRemoval
user/domain/valueObjects/InputPassword.php:28:9
     ): self {
         $trimmed = trim($password);
 
-        self::ensureIsLongEnough($trimmed);
+        
         $sanitized = self::ensureContainsNoInvalidChars($trimmed);
 
killedBy: norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithEmptyString
statusReason: 1) norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithEmptyString
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LessThanNegotiation
user/domain/valueObjects/InputPassword.php:37:9
 
     private static function ensureIsLongEnough(string $trimmed): void
     {
-        if ((strlen($trimmed) < self::MIN_LENGTH)) {
+        if (strlen($trimmed) >= self::MIN_LENGTH) {
             throw new InvalidArgumentException(
                 sprintf(
killedBy: norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithValidPassword
statusReason: 1) norsk\api\user\InputPasswordTest::testCanCreateInputPasswordWithValidPassword
InvalidArgumentException: The password must be at least 12 characters long.

/app/api/src/user/domain/valueObjects/InputPassword.php:29
/app/api/src/user/domain/valueObjects/InputPassword.php:22
/app/api/tests/unit/user/domain/valueObjects/InputPasswordTest.php:19

ERRORS!

[Survived] LessThan
user/domain/valueObjects/InputPassword.php:37:9
 
     private static function ensureIsLongEnough(string $trimmed): void
     {
-        if ((strlen($trimmed) < self::MIN_LENGTH)) {
+        if (strlen($trimmed) <= self::MIN_LENGTH) {
             throw new InvalidArgumentException(
                 sprintf(

[Killed] Throw_
user/domain/valueObjects/InputPassword.php:38:13
     private static function ensureIsLongEnough(string $trimmed): void
     {
         if ((strlen($trimmed) < self::MIN_LENGTH)) {
-            throw new InvalidArgumentException(
-                sprintf(
-                    'The password must be at least %d characters long.',
-                    self::MIN_LENGTH
-                ),
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException(sprintf('The password must be at least %d characters long.', self::MIN_LENGTH), ResponseCode::unprocessable->value);
         }
     }
killedBy: norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithEmptyString
statusReason: 1) norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithEmptyString
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Throw_
user/domain/valueObjects/InputPassword.php:53:13
     {
         $sanitized = SanitizedClientInput::of($trimmed)->asString();
         if ($sanitized !== $trimmed) {
-            throw new InvalidArgumentException(
-                'Password contains invalid characters: \' or &.',
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException('Password contains invalid characters: \' or &.', ResponseCode::unprocessable->value);
         }
 
killedBy: norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithInvalidChars
statusReason: 1) norsk\api\user\InputPasswordTest::testCannotCreateInputPasswordWithInvalidChars
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.
