[Killed] ConcatOperandRemoval
infrastructure/logging/Logger.php:20:9
     private function __construct(Path $logPath)
     {
         $logFormat = "[{date}]\t[{level}]\t{message}";
-        $logFileName = 'log_' . date('Y-m-d') . '.log';
+        $logFileName = date('Y-m-d') . '.log';
         $this->logger = new KLogger(
             logDirectory: $logPath->asString(),
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
Failed asserting that file "/app/api/tests/unit/infrastructure/logging/../../../logs/log_2025-07-16.log" exists.

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:36

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
infrastructure/logging/Logger.php:20:9
     private function __construct(Path $logPath)
     {
         $logFormat = "[{date}]\t[{level}]\t{message}";
-        $logFileName = 'log_' . date('Y-m-d') . '.log';
+        $logFileName = 'log_' . '.log' . date('Y-m-d');
         $this->logger = new KLogger(
             logDirectory: $logPath->asString(),
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
Failed asserting that file "/app/api/tests/unit/infrastructure/logging/../../../logs/log_2025-07-16.log" exists.

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:36

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
infrastructure/logging/Logger.php:33:5
     }
 
 
-    public static function create(Path $logPath): self
+    protected static function create(Path $logPath): self
     {
         return new self($logPath);
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
Error: Call to protected method norsk\api\infrastructure\logging\Logger::create() from scope norsk\api\infrastructure\logging\LoggerTest

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/logging/Logger.php:39:5
     }
 
 
-    public function error(Throwable $throwable): void
+    protected function error(Throwable $throwable): void
     {
         $logMessage = 'Error-Code: ' . $throwable->getCode() . PHP_EOL
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanLogError
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanLogError
Error: Call to protected method norsk\api\infrastructure\logging\Logger::error() from scope norsk\api\infrastructure\logging\LoggerTest

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:53

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/logging/Logger.php:47:9
                       . 'Message: ' . $throwable->getMessage() . PHP_EOL
                       . 'Stack: ' . $throwable->getTraceAsString() . PHP_EOL;
 
-        $this->logger->error($logMessage);
+        
     }
 
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanLogError
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanLogError
Failed asserting that '' matches PCRE pattern "#\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}.\d{6}]\t\[ERROR]\tError-Code: 0#".

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:55

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
infrastructure/logging/Logger.php:51:5
     }
 
 
-    public function info(LogMessage $logMessage): void
+    protected function info(LogMessage $logMessage): void
     {
         $this->logger->info($logMessage->asString());
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanCreateLogFile
Error: Call to protected method norsk\api\infrastructure\logging\Logger::info() from scope norsk\api\infrastructure\logging\LoggerTest

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:34

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/logging/Logger.php:53:9
 
     public function info(LogMessage $logMessage): void
     {
-        $this->logger->info($logMessage->asString());
+        
     }
 }
killedBy: norsk\api\infrastructure\logging\LoggerTest::testCanLogInfo
statusReason: 1) norsk\api\infrastructure\logging\LoggerTest::testCanLogInfo
Failed asserting that '' matches PCRE pattern "#\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}.\d{6}]\t\[INFO]\tsome info#".

/app/api/tests/unit/infrastructure/logging/LoggerTest.php:43

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
