[Killed] PublicVisibility
infrastructure/persistence/AffectedRows.php:16:5
     }
 
 
-    public static function fromInt(int $rows): self
+    protected static function fromInt(int $rows): self
     {
         return new self($rows);
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Error: Call to protected method norsk\api\infrastructure\persistence\AffectedRows::fromInt() from scope norsk\api\infrastructure\persistence\AffectedRowsTest

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/AffectedRows.php:22:5
     }
 
 
-    public function notAtLeastOne(): bool
+    protected function notAtLeastOne(): bool
     {
         if ($this->row < 0) {
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Error: Call to protected method norsk\api\infrastructure\persistence\AffectedRows::notAtLeastOne() from scope norsk\api\infrastructure\persistence\AffectedRowsTest

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LessThanNegotiation
infrastructure/persistence/AffectedRows.php:24:9
 
     public function notAtLeastOne(): bool
     {
-        if ($this->row < 0) {
+        if ($this->row >= 0) {
             throw new RuntimeException('An error has occurred during executing database query');
         }
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
RuntimeException: An error has occurred during executing database query

/app/api/src/infrastructure/persistence/AffectedRows.php:19
/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LessThan
infrastructure/persistence/AffectedRows.php:24:9
 
     public function notAtLeastOne(): bool
     {
-        if ($this->row < 0) {
+        if ($this->row <= 0) {
             throw new RuntimeException('An error has occurred during executing database query');
         }
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
RuntimeException: An error has occurred during executing database query

/app/api/src/infrastructure/persistence/AffectedRows.php:19
/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
infrastructure/persistence/AffectedRows.php:25:13
     public function notAtLeastOne(): bool
     {
         if ($this->row < 0) {
-            throw new RuntimeException('An error has occurred during executing database query');
+            new RuntimeException('An error has occurred during executing database query');
         }
         if ($this->row === 0) {
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testThrowsExceptionIfAffectedRowsIsNegative
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testThrowsExceptionIfAffectedRowsIsNegative
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] DecrementInteger
infrastructure/persistence/AffectedRows.php:27:9
         if ($this->row < 0) {
             throw new RuntimeException('An error has occurred during executing database query');
         }
-        if ($this->row === 0) {
+        if ($this->row === -1) {
             return true;
         }
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
infrastructure/persistence/AffectedRows.php:27:9
         if ($this->row < 0) {
             throw new RuntimeException('An error has occurred during executing database query');
         }
-        if ($this->row === 0) {
+        if ($this->row !== 0) {
             return true;
         }
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
infrastructure/persistence/AffectedRows.php:28:13
             throw new RuntimeException('An error has occurred during executing database query');
         }
         if ($this->row === 0) {
-            return true;
+            return false;
         }
 
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/AffectedRows.php:28:13
             throw new RuntimeException('An error has occurred during executing database query');
         }
         if ($this->row === 0) {
-            return true;
+            
         }
 
killedBy: norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
statusReason: 1) norsk\api\infrastructure\persistence\AffectedRowsTest::testReturnsTrueIfAffectedRowsAreNotAtLeastOne
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/AffectedRowsTest.php:17

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
