[Killed] PublicVisibility
user/domain/valueObjects/PasswordHash.php:27:5
     }
 
 
-    public static function hashBy(
+    protected static function hashBy(
         #[SensitiveParameter]
         InputPassword $inputPassword,
killedBy: norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
Failed asserting that exception of type "Error" matches expected exception "norsk\api\user\domain\exceptions\PasswordIsInvalidException". Message was: "Call to protected method norsk\api\user\domain\valueObjects\PasswordHash::hashBy() from scope norsk\api\user\PasswordHashTest" at
/app/api/tests/unit/user/domain/valueObjec

[Killed] MethodCallRemoval
user/domain/valueObjects/PasswordHash.php:34:9
         PasswordVector $passwordVector
     ): self {
         $passwordString = $inputPassword->asString();
-        self::ensureIsLongEnough($passwordString);
+        
         $hash = self::generateHash($passwordString, $passwordVector);
 
killedBy: norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Killed] LessThanNegotiation
user/domain/valueObjects/PasswordHash.php:43:9
 
     private static function ensureIsLongEnough(string $password): void
     {
-        if (strlen($password) < self::MIN_PASSWORD_LENGTH) {
+        if (strlen($password) >= self::MIN_PASSWORD_LENGTH) {
             throw new PasswordIsInvalidException(
                 'Password is too short',
killedBy: norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Survived] LessThan
user/domain/valueObjects/PasswordHash.php:43:9
 
     private static function ensureIsLongEnough(string $password): void
     {
-        if (strlen($password) < self::MIN_PASSWORD_LENGTH) {
+        if (strlen($password) <= self::MIN_PASSWORD_LENGTH) {
             throw new PasswordIsInvalidException(
                 'Password is too short',

[Killed] Throw_
user/domain/valueObjects/PasswordHash.php:44:13
     private static function ensureIsLongEnough(string $password): void
     {
         if (strlen($password) < self::MIN_PASSWORD_LENGTH) {
-            throw new PasswordIsInvalidException(
-                'Password is too short',
-                ResponseCode::unprocessable->value
-            );
+            new PasswordIsInvalidException('Password is too short', ResponseCode::unprocessable->value);
         }
     }
killedBy: norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPasswordIsTooShort
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Survived] MethodCallRemoval
user/domain/valueObjects/PasswordHash.php:55:9
     private static function generateHash(string $password, PasswordVector $passwordVector): string
     {
         $salt = $passwordVector->getSalt();
-        $salt->generate();
+        
         $pepper = $passwordVector->getPepper();
 

[Survived] ConcatOperandRemoval
user/domain/valueObjects/PasswordHash.php:58:9
         $salt->generate();
         $pepper = $passwordVector->getPepper();
 
-        $passwordWithSaltAndPepper = $password . $salt->asString() . $pepper->asString();
+        $passwordWithSaltAndPepper = $salt->asString() . $pepper->asString();
 
         $hashedPassword = password_hash($passwordWithSaltAndPepper, PASSWORD_BCRYPT);

[Survived] ConcatOperandRemoval
user/domain/valueObjects/PasswordHash.php:58:9
         $salt->generate();
         $pepper = $passwordVector->getPepper();
 
-        $passwordWithSaltAndPepper = $password . $salt->asString() . $pepper->asString();
+        $passwordWithSaltAndPepper = $password . $salt->asString();
 
         $hashedPassword = password_hash($passwordWithSaltAndPepper, PASSWORD_BCRYPT);

[Survived] MethodCallRemoval
user/domain/valueObjects/PasswordHash.php:61:9
         $passwordWithSaltAndPepper = $password . $salt->asString() . $pepper->asString();
 
         $hashedPassword = password_hash($passwordWithSaltAndPepper, PASSWORD_BCRYPT);
-        self::addRandomMillisecondsForAttacker();
+        
 
         return $hashedPassword;

[Survived] FunctionCallRemoval
user/domain/valueObjects/PasswordHash.php:69:9
 
     private static function addRandomMillisecondsForAttacker(): void
     {
-        usleep((random_int(self::SECONDS_0_1, self::SECONDS_0_5)));
+        
     }
 

[Killed] PublicVisibility
user/domain/valueObjects/PasswordHash.php:73:5
     }
 
 
-    public static function by(string $passwordHash): self
+    protected static function by(string $passwordHash): self
     {
         $trimmed = trim($passwordHash);
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPlainPasswordHashIsNotValid with data set #0 (' ', 'Password name cannot be empty')
Failed asserting that exception of type "Error" matches expected exception "norsk\api\user\domain\exceptions\PasswordIsInvalidException". Message was: "Call to protected method norsk\api\user\domain\valueObjects\PasswordHash::by() from scope norsk\api\user\Pa

[Killed] UnwrapTrim
user/domain/valueObjects/PasswordHash.php:75:9
 
     public static function by(string $passwordHash): self
     {
-        $trimmed = trim($passwordHash);
+        $trimmed = $passwordHash;
         self::ensureIsNotEmpty($trimmed);
 
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPlainPasswordHashIsNotValid with data set #0 (' ', 'Password name cannot be empty')
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/PasswordHash.php:76:9
     public static function by(string $passwordHash): self
     {
         $trimmed = trim($passwordHash);
-        self::ensureIsNotEmpty($trimmed);
+        
 
         return new self(SanitizedClientInput::of($trimmed)->asString());
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPlainPasswordHashIsNotValid with data set #0 (' ', 'Password name cannot be empty')
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
user/domain/valueObjects/PasswordHash.php:85:13
     private static function ensureIsNotEmpty(string $trimmed): void
     {
         if ($trimmed === '') {
-            throw new PasswordIsInvalidException(
-                'Password name cannot be empty',
-                ResponseCode::unprocessable->value
-            );
+            new PasswordIsInvalidException('Password name cannot be empty', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfPlainPasswordHashIsNotValid with data set #0 (' ', 'Password name cannot be empty')
Failed asserting that exception of type "norsk\api\user\domain\exceptions\PasswordIsInvalidException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
user/domain/valueObjects/PasswordHash.php:93:5
     }
 
 
-    public static function byValidatedInputPassword(
+    protected static function byValidatedInputPassword(InputPassword $inputPassword, PasswordVector $passwordVector, PasswordHash $storedHash): self
         InputPassword $inputPassword,
         PasswordVector $passwordVector,
killedBy: norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
statusReason: 1) norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
Error: Call to protected method norsk\api\user\domain\valueObjects\PasswordHash::byValidatedInputPassword() from scope norsk\api\user\PasswordHashTest

/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:92

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] ConcatOperandRemoval
user/domain/valueObjects/PasswordHash.php:100:9
     ): self {
         $storedSalt = $passwordVector->getSalt();
         $pepper = $passwordVector->getPepper();
-        $inputHash = $inputPassword->asString() . $storedSalt->asString() . $pepper->asString();
+        $inputHash = $inputPassword->asString() . $pepper->asString();
 
         if (self::inputPasswordDoesNotMatchSavedHash($inputHash, $storedHash)) {
killedBy: norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
statusReason: 1) norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
norsk\api\user\domain\exceptions\CredentialsAreInvalidException: Unauthorized: Cannot verify credentials

/app/api/src/user/domain/valueObjects/PasswordHash.php:72
/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:92

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] ConcatOperandRemoval
user/domain/valueObjects/PasswordHash.php:100:9
     ): self {
         $storedSalt = $passwordVector->getSalt();
         $pepper = $passwordVector->getPepper();
-        $inputHash = $inputPassword->asString() . $storedSalt->asString() . $pepper->asString();
+        $inputHash = $storedSalt->asString() . $pepper->asString();
 
         if (self::inputPasswordDoesNotMatchSavedHash($inputHash, $storedHash)) {
killedBy: norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
statusReason: 1) norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
norsk\api\user\domain\exceptions\CredentialsAreInvalidException: Unauthorized: Cannot verify credentials

/app/api/src/user/domain/valueObjects/PasswordHash.php:72
/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:92

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] IfNegation
user/domain/valueObjects/PasswordHash.php:102:9
         $pepper = $passwordVector->getPepper();
         $inputHash = $inputPassword->asString() . $storedSalt->asString() . $pepper->asString();
 
-        if (self::inputPasswordDoesNotMatchSavedHash($inputHash, $storedHash)) {
-            throw new CredentialsAreInvalidException();
-        }
+        if (!self::inputPasswordDoesNotMatchSavedHash($inputHash, $storedHash)) {
 
         return new self($storedHash->passwordHash);
killedBy: norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
statusReason: 1) norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
norsk\api\user\domain\exceptions\CredentialsAreInvalidException: Unauthorized: Cannot verify credentials

/app/api/src/user/domain/valueObjects/PasswordHash.php:72
/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:92

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] Throw_
user/domain/valueObjects/PasswordHash.php:103:13
         $inputHash = $inputPassword->asString() . $storedSalt->asString() . $pepper->asString();
 
         if (self::inputPasswordDoesNotMatchSavedHash($inputHash, $storedHash)) {
-            throw new CredentialsAreInvalidException();
+            new CredentialsAreInvalidException();
         }
 
killedBy: norsk\api\user\PasswordHashTest::testThrowsExceptionIfValidatedInputPasswordDoesNotMatchStoredPassword
statusReason: 1) norsk\api\user\PasswordHashTest::testThrowsExceptionIfValidatedInputPasswordDoesNotMatchStoredPassword
Failed asserting that exception of type "norsk\api\user\domain\exceptions\CredentialsAreInvalidException" is thrown.

FAILURES!
Tests: 7, Assertions: 17, Failures: 1.

[Killed] LogicalNot
user/domain/valueObjects/PasswordHash.php:112:9
 
     private static function inputPasswordDoesNotMatchSavedHash(string $inputHash, PasswordHash $storedHash): bool
     {
-        return !password_verify($inputHash, $storedHash->asHashString());
+        return password_verify($inputHash, $storedHash->asHashString());
     }
 
killedBy: norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
statusReason: 1) norsk\api\user\PasswordHashTest::testCanValidatedInputPasswordWithSaltAndPepper
norsk\api\user\domain\exceptions\CredentialsAreInvalidException: Unauthorized: Cannot verify credentials

/app/api/src/user/domain/valueObjects/PasswordHash.php:72
/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:92

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] PublicVisibility
user/domain/valueObjects/PasswordHash.php:116:5
     }
 
 
-    public function asHashString(): string
+    protected function asHashString(): string
     {
         return $this->passwordHash;
killedBy: norsk\api\user\PasswordHashTest::testCanBeUsedAsPlainString
statusReason: 1) norsk\api\user\PasswordHashTest::testCanBeUsedAsPlainString
Error: Call to protected method norsk\api\user\domain\valueObjects\PasswordHash::asHashString() from scope norsk\api\user\PasswordHashTest

/app/api/tests/unit/user/domain/valueObjects/PasswordHashTest.php:40

ERRORS!
Tests: 3, Assertions: 6, Errors: 1.
