[Killed] PublicVisibility
user/domain/valueObjects/PasswordVector.php:18:5
     }
 
 
-    public static function by(#[SensitiveParameter] Salt $salt, Pepper $pepper): self
+    protected static function by(
     {
         return new self($salt, $pepper);
killedBy: norsk\api\user\PasswordVectorTest::testCanGetSalt
statusReason: 1) norsk\api\user\PasswordVectorTest::testCanGetSalt
Error: Call to protected method norsk\api\user\domain\valueObjects\PasswordVector::by() from scope norsk\api\user\PasswordVectorTest

/app/api/tests/unit/user/domain/valueObjects/PasswordVectorTest.php:40

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
