[Killed] PublicVisibility
infrastructure/persistence/DatabaseName.php:17:5
     }
 
 
-    public static function fromString(string $name): self
+    protected static function fromString(string $name): self
     {
         self::ensureIsNotEmpty(trim($name));
statusReason: 1) norsk\api\infrastructure\persistence\DatabaseNameTest::testFailsIfDbNameIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to protected method norsk\api\infrastructure\persistence\DatabaseName::fromString() from scope norsk\api\infrastructure\persistence\DatabaseNameTest" at
/app/api/te

[Killed] UnwrapTrim
infrastructure/persistence/DatabaseName.php:19:9
 
     public static function fromString(string $name): self
     {
-        self::ensureIsNotEmpty(trim($name));
+        self::ensureIsNotEmpty($name);
 
         return new self($name);
statusReason: 1) norsk\api\infrastructure\persistence\DatabaseNameTest::testFailsIfDbNameIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/DatabaseName.php:19:9
 
     public static function fromString(string $name): self
     {
-        self::ensureIsNotEmpty(trim($name));
+        
 
         return new self($name);
statusReason: 1) norsk\api\infrastructure\persistence\DatabaseNameTest::testFailsIfDbNameIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
infrastructure/persistence/DatabaseName.php:27:9
 
     private static function ensureIsNotEmpty(string $name): void
     {
-        if ($name === '') {
+        if ($name !== '') {
             throw new InvalidArgumentException('Name is not set', ResponseCode::unprocessable->value);
         }
statusReason: 1) norsk\api\infrastructure\persistence\DatabaseNameTest::testFailsIfDbNameIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
infrastructure/persistence/DatabaseName.php:28:13
     private static function ensureIsNotEmpty(string $name): void
     {
         if ($name === '') {
-            throw new InvalidArgumentException('Name is not set', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('Name is not set', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\persistence\DatabaseNameTest::testFailsIfDbNameIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
