[Killed] PublicVisibility
infrastructure/persistence/DbConnection.php:28:5
     }
 
 
-    public function getResult(
+    protected function getResult(SqlStatement $sql, Parameters $params): SqlResult
         SqlStatement $sql,
         Parameters $params
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
Error: Call to protected method norsk\api\infrastructure\persistence\DbConnection::getResult() from scope norsk\api\infrastructure\persistence\DbConnectionTest

/app/api/tests/unit/infrastructure/persistence/DbConnectionTest.php:151

ERRORS!
Tests: 3, Assertions: 13, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:43:9
         Parameters $params
     ): array {
         $results = $this->executePreparedStatement($sql, $params);
-        $this->ensureGetResultsWasImplementedCorrectly($results);
+        
 
         return $results->fetch_all(MYSQLI_ASSOC);
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfGetResultsWasNotImplementedForTheRightQuery
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfGetResultsWasNotImplementedForTheRightQuery
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Call to a member function fetch_all() on true" at
/app/api/src/infrastructure/persistence/DbConnection.php:28
/app/api/src/infrastructure/persistence/DbConnection.php:21

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:53:9
         SqlStatement $sql,
         Parameters $params
     ): bool|mysqli_result {
-        $this->createConnection();
+        
         $success = $this->mysqli->execute_query($sql->asString(), $params->asArray());
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
Expectation failed for method name is "connect" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] LogicalNot
infrastructure/persistence/DbConnection.php:56:9
         $this->createConnection();
         $success = $this->mysqli->execute_query($sql->asString(), $params->asArray());
 
-        if (!$success) {
+        if ($success) {
             $this->throwExceptionCouldNotExecuteQuery($sql);
         }
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
norsk\api\infrastructure\persistence\GenericSqlStatement::asString(): string was not expected to be called more than once.

/app/api/src/infrastructure/persistence/DbConnection.php:57
/app/api/src/infrastructure/persistence/DbConnection.php:35
/app/api/src/infrastructure/persistence/DbConnection.php:26
/app/api/src/infrastr

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:57:13
         $success = $this->mysqli->execute_query($sql->asString(), $params->asArray());
 
         if (!$success) {
-            $this->throwExceptionCouldNotExecuteQuery($sql);
+            
         }
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to a member function fetch_all() on false" at
/app/api/src/infrastructure/persistence/DbConnection.php:28
/app/api/src/infrastructure/persistence/DbConnection.php:21
/app/api/tests/unit/infra

[Killed] PublicVisibility
infrastructure/persistence/DbConnection.php:64:5
     }
 
 
-    public function createConnection(): void
+    protected function createConnection(): void
     {
         $this->enableExceptionInsteadOfFalse();
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
Error: Call to protected method norsk\api\infrastructure\persistence\DbConnection::createConnection() from scope norsk\api\infrastructure\persistence\DbConnectionTest

/app/api/tests/unit/infrastructure/persistence/DbConnectionTest.php:78

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] MethodCallRemoval
infrastructure/persistence/DbConnection.php:66:9
 
     public function createConnection(): void
     {
-        $this->enableExceptionInsteadOfFalse();
+        
 
         try {

[Killed] LogicalNot
infrastructure/persistence/DbConnection.php:69:13
         $this->enableExceptionInsteadOfFalse();
 
         try {
-            if (!$this->isConnected) {
+            if ($this->isConnected) {
                 $this->isConnected = $this->mysqli->connect(
                     $this->dbConfig->host()->asString(),
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
Expectation failed for method name is "connect" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:79:13
                 );
             }
 
-            $this->setCharset();
+            
         } catch (Throwable $throwable) {
             throw new RuntimeException(
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
Expectation failed for method name is "set_charset" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] Throw_
infrastructure/persistence/DbConnection.php:81:13
 
             $this->setCharset();
         } catch (Throwable $throwable) {
-            throw new RuntimeException(
-                'Could not connect to server: ' . $this->dbConfig->host()->asString()
-                . '. Because: ' . $throwable->getMessage(),
-                ResponseCode::serverError->value,
-                $throwable
-            );
+            new RuntimeException('Could not connect to server: ' . $this->dbConfig->host()->asString() . '. Because: ' . $throwable->getMessage(), ResponseCode::serverError->value, $throwable);
         }
     }
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/persistence/DbConnection.php:82:17
             $this->setCharset();
         } catch (Throwable $throwable) {
             throw new RuntimeException(
-                'Could not connect to server: ' . $this->dbConfig->host()->asString()
+                throw new RuntimeException($this->dbConfig->host()->asString() . '. Because: ' . $throwable->getMessage(), ResponseCode::serverError->value, $throwable);
                 . '. Because: ' . $throwable->getMessage(),
                 ResponseCode::serverError->value,
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
Failed asserting that exception message 'host. Because: mööp' contains 'Could not connect to server: host. Because: mööp'.

FAILURES!
Tests: 2, Assertions: 10, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/persistence/DbConnection.php:82:17
             $this->setCharset();
         } catch (Throwable $throwable) {
             throw new RuntimeException(
-                'Could not connect to server: ' . $this->dbConfig->host()->asString()
-                . '. Because: ' . $throwable->getMessage(),
+                throw new RuntimeException('Could not connect to server: ' . $this->dbConfig->host()->asString() . $throwable->getMessage(), ResponseCode::serverError->value, $throwable);
                 ResponseCode::serverError->value,
                 $throwable
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfDatabaseRefusesToConnect
Failed asserting that exception message 'Could not connect to server: hostmööp' contains 'Could not connect to server: host. Because: mööp'.

FAILURES!
Tests: 2, Assertions: 10, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:93:9
 
     private function setCharset(): void
     {
-        $this->mysqli->set_charset(self::CHARSET);
+        
     }
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanConnectToDatabase
Expectation failed for method name is "set_charset" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/persistence/DbConnection.php:99:9
 
     private function throwExceptionCouldNotExecuteQuery(SqlStatement $sql): void
     {
-        throw new RuntimeException('Could not execute query: ' . $sql->asString());
+        throw new RuntimeException($sql->asString());
     }
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
Failed asserting that exception message 'SELECT * FROM test' contains 'Could not execute query: SELECT * FROM test'.

FAILURES!
Tests: 5, Assertions: 32, Failures: 1.

[Killed] Throw_
infrastructure/persistence/DbConnection.php:99:9
 
     private function throwExceptionCouldNotExecuteQuery(SqlStatement $sql): void
     {
-        throw new RuntimeException('Could not execute query: ' . $sql->asString());
+        new RuntimeException('Could not execute query: ' . $sql->asString());
     }
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfCannotGetResult
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to a member function fetch_all() on false" at
/app/api/src/infrastructure/persistence/DbConnection.php:28
/app/api/src/infrastructure/persistence/DbConnection.php:21
/app/api/tests/unit/infra

[Killed] Identical
infrastructure/persistence/DbConnection.php:105:9
 
     private function ensureGetResultsWasImplementedCorrectly(mysqli_result|bool $results): void
     {
-        if ($results === true) {
+        if ($results !== true) {
             throw new LogicException('getResults is supposed to be used for SELECT, SHOW, DESCRIBE or EXPLAIN');
         }
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanGetResult
LogicException: getResults is supposed to be used for SELECT, SHOW, DESCRIBE or EXPLAIN

/app/api/src/infrastructure/persistence/DbConnection.php:62
/app/api/src/infrastructure/persistence/DbConnection.php:27
/app/api/src/infrastructure/persistence/DbConnection.php:21
/app/api/tests/unit/infrastructure/persistence/DbConnect

[Killed] Throw_
infrastructure/persistence/DbConnection.php:106:13
     private function ensureGetResultsWasImplementedCorrectly(mysqli_result|bool $results): void
     {
         if ($results === true) {
-            throw new LogicException('getResults is supposed to be used for SELECT, SHOW, DESCRIBE or EXPLAIN');
+            new LogicException('getResults is supposed to be used for SELECT, SHOW, DESCRIBE or EXPLAIN');
         }
     }
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfGetResultsWasNotImplementedForTheRightQuery
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testThrowsExceptionIfGetResultsWasNotImplementedForTheRightQuery
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Call to a member function fetch_all() on true" at
/app/api/src/infrastructure/persistence/DbConnection.php:28
/app/api/src/infrastructure/persistence/DbConnection.php:21

[Killed] PublicVisibility
infrastructure/persistence/DbConnection.php:111:5
     }
 
 
-    public function execute(
+    protected function execute(SqlStatement $sql, Parameters $params): AffectedRows
         SqlStatement $sql,
         Parameters $params
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanExecute
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanExecute
Error: Call to protected method norsk\api\infrastructure\persistence\DbConnection::execute() from scope norsk\api\infrastructure\persistence\DbConnectionTest

/app/api/tests/unit/infrastructure/persistence/DbConnectionTest.php:232

ERRORS!
Tests: 6, Assertions: 34, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/DbConnection.php:115:9
         SqlStatement $sql,
         Parameters $params
     ): AffectedRows {
-        $this->executePreparedStatement($sql, $params);
+        
         $rows = $this->mysqli->affectedRows();
 
killedBy: norsk\api\infrastructure\persistence\DbConnectionTest::testCanExecute
statusReason: 1) norsk\api\infrastructure\persistence\DbConnectionTest::testCanExecute
Expectation failed for method name is "connect" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 36, Failures: 1.

[Survived] FunctionCallRemoval
infrastructure/persistence/DbConnection.php:124:9
 
     private function enableExceptionInsteadOfFalse(): void
     {
-        mysqli_report(MYSQLI_REPORT_ERROR | MYSQLI_REPORT_STRICT);
+        
     }
 }

[Survived] BitwiseOr
infrastructure/persistence/DbConnection.php:124:9
 
     private function enableExceptionInsteadOfFalse(): void
     {
-        mysqli_report(MYSQLI_REPORT_ERROR | MYSQLI_REPORT_STRICT);
+        mysqli_report(MYSQLI_REPORT_ERROR & MYSQLI_REPORT_STRICT);
     }
 }
