[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/IdentityAccessManagementFactory.php:28:5
     }
 
 
-    public function createTrainerAuthorization(): Authorization
+    protected function createTrainerAuthorization(): Authorization
     {
         return new Authorization(
killedBy: norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateTrainerAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateTrainerAuthorization
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactory::createTrainerAuthorization() from scope norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit

[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/IdentityAccessManagementFactory.php:38:5
     }
 
 
-    public function createManagerAuthorization(): Authorization
+    protected function createManagerAuthorization(): Authorization
     {
         return new Authorization(
killedBy: norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateManagerAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateManagerAuthorization
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactory::createManagerAuthorization() from scope norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit

[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/IdentityAccessManagementFactory.php:48:5
     }
 
 
-    public function createAuthentication(): Authentication
+    protected function createAuthentication(): Authentication
     {
         return new Authentication($this->createJwtManagement(), $this->url);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthentication
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateAuthentication
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactory::createAuthentication() from scope norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit/user/infras

[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/IdentityAccessManagementFactory.php:54:5
     }
 
 
-    public function createJwtManagement(): JwtManagement
+    protected function createJwtManagement(): JwtManagement
     {
         return new JwtManagement(
killedBy: norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateJwtManagement
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest::testCanCreateJwtManagement
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactory::createJwtManagement() from scope norsk\api\user\infrastructure\identityAccessManagement\IdentityAccessManagementFactoryTest

/app/api/tests/unit/user/infrastr
