[Killed] PublicVisibility
infrastructure/persistence/GenericSqlStatement.php:14:5
     }
 
 
-    public static function create(string $sqlStatement): self
+    protected static function create(string $sqlStatement): self
     {
         return new self($sqlStatement);
killedBy: norsk\api\infrastructure\persistence\GenericSqlStatementTest::testCanBeUsedAsString
statusReason: 1) norsk\api\infrastructure\persistence\GenericSqlStatementTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\infrastructure\persistence\GenericSqlStatement::create() from scope norsk\api\infrastructure\persistence\GenericSqlStatementTest

/app/api/tests/unit/infrastructure/persistence/GenericSqlStatementTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
