[Killed] IfNegation
infrastructure/identityAccessManagement/authentication/Authentication.php:34:13
     public function process(Request $request, RequestHandler $handler): ResponseInterface
     {
         try {
-            if ($this->AuthorizationHeaderDoesNotExist($request)) {
-                return UnauthorizedResponse::noHeader($this->url);
-            }
+            if (!$this->AuthorizationHeaderDoesNotExist($request)) {
 
             $decodedPayload = $this->jwtManagement->validate($request);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
Failed asserting that two variables reference the same object.

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authentication/AuthenticationTest.php:77

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authentication/Authentication.php:35:17
     {
         try {
             if ($this->AuthorizationHeaderDoesNotExist($request)) {
-                return UnauthorizedResponse::noHeader($this->url);
+                
             }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testReturnsUnauthorizedResponseIfAuthHeaderIsMissing
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testReturnsUnauthorizedResponseIfAuthHeaderIsMissing
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'{"message":"No Authorization header sent"}'
+'{"message":"norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagement::validate(MockObject_ServerRequestInterface_72

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authentication/Authentication.php:43:13
 
             $request = $request->withAttribute(self::AUTHENTICATED_USER, $authenticatedUser);
         } catch (Throwable $throwable) {
-            return ErrorResponse::unauthorized($this->url, $throwable);
+            
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testThrowsExceptionOnFailure
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testThrowsExceptionOnFailure
Error: Call to a member function getContents() on null

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authentication/AuthenticationTest.php:112

ERRORS!
Tests: 3, Assertions: 9, Errors: 1.

[Killed] LessThan
infrastructure/identityAccessManagement/authentication/Authentication.php:52:9
 
     private function AuthorizationHeaderDoesNotExist(Request $request): bool
     {
-        return count($request->getHeader(self::AUTHORIZATION)) < 1;
+        return count($request->getHeader(self::AUTHORIZATION)) <= 1;
     }
 }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
Failed asserting that two variables reference the same object.

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authentication/AuthenticationTest.php:77

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThanNegotiation
infrastructure/identityAccessManagement/authentication/Authentication.php:52:9
 
     private function AuthorizationHeaderDoesNotExist(Request $request): bool
     {
-        return count($request->getHeader(self::AUTHORIZATION)) < 1;
+        return count($request->getHeader(self::AUTHORIZATION)) >= 1;
     }
 }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationTest::testCanProcessAValidRequest
Failed asserting that two variables reference the same object.

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authentication/AuthenticationTest.php:77

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
