[Killed] PublicVisibility
infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:16:5
     }
 
 
-    public static function by(string $algorithm): self
+    protected static function by(string $algorithm): self
     {
         self::ensureAlgorithmIsJwtValid($algorithm);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithm::by() from scope norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest

/app/api/tests/unit/user/infrastru

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:18:9
 
     public static function by(string $algorithm): self
     {
-        self::ensureAlgorithmIsJwtValid($algorithm);
+        
 
         return new self($algorithm);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testThrowsExceptionIfAlgorithmIsUnknown
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testThrowsExceptionIfAlgorithmIsUnknown
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LogicalNot
infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:28:9
     {
         $algorithmList = self::getAlgorithmList();
 
-        if (!in_array($algorithm, $algorithmList)) {
+        if (in_array($algorithm, $algorithmList)) {
             throw new InvalidArgumentException('Algorithm has no valid format');
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testCanBeUsedAsString
InvalidArgumentException: Algorithm has no valid format

/app/api/src/user/infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:21
/app/api/src/user/infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:14
/app/api/te

[Killed] Throw_
infrastructure/identityAccessManagement/authentication/AuthenticationAlgorithm.php:29:13
         $algorithmList = self::getAlgorithmList();
 
         if (!in_array($algorithm, $algorithmList)) {
-            throw new InvalidArgumentException('Algorithm has no valid format');
+            new InvalidArgumentException('Algorithm has no valid format');
         }
     }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testThrowsExceptionIfAlgorithmIsUnknown
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationAlgorithmTest::testThrowsExceptionIfAlgorithmIsUnknown
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
