[Killed] PublicVisibility
infrastructure/persistence/Host.php:17:5
     }
 
 
-    public static function fromString(string $host): self
+    protected static function fromString(string $host): self
     {
         self::ensureIsNotEmpty(trim($host));
statusReason: 1) norsk\api\infrastructure\persistence\HostTest::testFailsIfHostIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to protected method norsk\api\infrastructure\persistence\Host::fromString() from scope norsk\api\infrastructure\persistence\HostTest" at
/app/api/tests/unit/infrastructure/pe

[Killed] MethodCallRemoval
infrastructure/persistence/Host.php:19:9
 
     public static function fromString(string $host): self
     {
-        self::ensureIsNotEmpty(trim($host));
+        
 
         return new self($host);
statusReason: 1) norsk\api\infrastructure\persistence\HostTest::testFailsIfHostIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] UnwrapTrim
infrastructure/persistence/Host.php:19:9
 
     public static function fromString(string $host): self
     {
-        self::ensureIsNotEmpty(trim($host));
+        self::ensureIsNotEmpty($host);
 
         return new self($host);
statusReason: 1) norsk\api\infrastructure\persistence\HostTest::testFailsIfHostIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
infrastructure/persistence/Host.php:27:9
 
     private static function ensureIsNotEmpty(string $host): void
     {
-        if ($host === '') {
+        if ($host !== '') {
             throw new InvalidArgumentException('Host is not set', ResponseCode::unprocessable->value);
         }
statusReason: 1) norsk\api\infrastructure\persistence\HostTest::testFailsIfHostIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
infrastructure/persistence/Host.php:28:13
     private static function ensureIsNotEmpty(string $host): void
     {
         if ($host === '') {
-            throw new InvalidArgumentException('Host is not set', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('Host is not set', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\persistence\HostTest::testFailsIfHostIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
