[Killed] PublicVisibility
infrastructure/identityAccessManagement/authentication/AuthenticationKey.php:14:5
     }
 
 
-    public static function by(string $key): self
+    protected static function by(string $key): self
     {
         return new self($key);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKey::by() from scope norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest

/app/api/tests/unit/user/infrastructure/identityAcce

[Killed] PublicVisibility
infrastructure/identityAccessManagement/authentication/AuthenticationKey.php:26:5
     }
 
 
-    public function asBase64String(): string
+    protected function asBase64String(): string
     {
         return base64_encode($this->key);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest::testCanBeUsedAsBase64String
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest::testCanBeUsedAsBase64String
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKey::asBase64String() from scope norsk\api\user\infrastructure\identityAccessManagement\authentication\AuthenticationKeyTest

/app/api/tests/unit/user/infrastru
