[Killed] PublicVisibility
infrastructure/persistence/Parameters.php:17:5
     }
 
 
-    public static function init(): self
+    protected static function init(): self
     {
         return new self([]);
killedBy: norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
statusReason: 1) norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
Error: Call to protected method norsk\api\infrastructure\persistence\Parameters::init() from scope norsk\api\infrastructure\persistence\ParametersTest

/app/api/tests/unit/infrastructure/persistence/ParametersTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/Parameters.php:23:5
     }
 
 
-    public function addString(string $value): void
+    protected function addString(string $value): void
     {
         $this->value[] = $value;
killedBy: norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
statusReason: 1) norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
Error: Call to protected method norsk\api\infrastructure\persistence\Parameters::addString() from scope norsk\api\infrastructure\persistence\ParametersTest

/app/api/tests/unit/infrastructure/persistence/ParametersTest.php:24

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/Parameters.php:29:5
     }
 
 
-    public function addInt(int $value): void
+    protected function addInt(int $value): void
     {
         $this->value[] = $value;
killedBy: norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
statusReason: 1) norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
Error: Call to protected method norsk\api\infrastructure\persistence\Parameters::addInt() from scope norsk\api\infrastructure\persistence\ParametersTest

/app/api/tests/unit/infrastructure/persistence/ParametersTest.php:26

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/Parameters.php:35:5
     }
 
 
-    public function addBool(bool $value): void
+    protected function addBool(bool $value): void
     {
         $this->value[] = $value;
killedBy: norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
statusReason: 1) norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
Error: Call to protected method norsk\api\infrastructure\persistence\Parameters::addBool() from scope norsk\api\infrastructure\persistence\ParametersTest

/app/api/tests/unit/infrastructure/persistence/ParametersTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/Parameters.php:44:5
     /**
      * @return string[]
      */
-    public function asArray(): array
+    protected function asArray(): array
     {
         return $this->value;
killedBy: norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
statusReason: 1) norsk\api\infrastructure\persistence\ParametersTest::testCanGetAddedValue
Error: Call to protected method norsk\api\infrastructure\persistence\Parameters::asArray() from scope norsk\api\infrastructure\persistence\ParametersTest

/app/api/tests/unit/infrastructure/persistence/ParametersTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
