[Killed] PublicVisibility
infrastructure/identityAccessManagement/authentication/RouteHandlerWithAuthenticatedUser.php:25:5
     }
 
 
-    public static function by(
+    protected static function by(ControllerResolver $controllerResolver, ControllerName $controllerName, Method $method): self
         ControllerResolver $controllerResolver,
         ControllerName $controllerName,
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authentication\RouteHandlerWithAuthenticatedUserTest::testCanGetResponse
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authentication\RouteHandlerWithAuthenticatedUserTest::testCanGetResponse
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authentication\RouteHandlerWithAuthenticatedUser::by() from scope norsk\api\user\infrastructure\identityAccessManagement\authentication\RouteHandlerWithAuthenticatedUserTest

/app/ap
