[Killed] PublicVisibility
infrastructure/persistence/Port.php:17:5
     }
 
 
-    public static function fromInt(int $port): self
+    protected static function fromInt(int $port): self
     {
         self::ensureIsNotZero($port);
killedBy: norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
Error: Call to protected method norsk\api\infrastructure\persistence\Port::fromInt() from scope norsk\api\infrastructure\persistence\PortTest

/app/api/tests/unit/infrastructure/persistence/PortTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/persistence/Port.php:19:9
 
     public static function fromInt(int $port): self
     {
-        self::ensureIsNotZero($port);
+        
 
         return new self($port);
killedBy: norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
infrastructure/persistence/Port.php:27:9
 
     private static function ensureIsNotZero(int $port): void
     {
-        if ($port === 0) {
+        if ($port === -1) {
             throw new InvalidArgumentException('Port is not set', ResponseCode::unprocessable->value);
         }
killedBy: norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Identical
infrastructure/persistence/Port.php:27:9
 
     private static function ensureIsNotZero(int $port): void
     {
-        if ($port === 0) {
+        if ($port !== 0) {
             throw new InvalidArgumentException('Port is not set', ResponseCode::unprocessable->value);
         }
killedBy: norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
InvalidArgumentException: Port is not set

/app/api/src/infrastructure/persistence/Port.php:21
/app/api/src/infrastructure/persistence/Port.php:15
/app/api/tests/unit/infrastructure/persistence/PortTest.php:18

ERRORS!

[Killed] Throw_
infrastructure/persistence/Port.php:28:13
     private static function ensureIsNotZero(int $port): void
     {
         if ($port === 0) {
-            throw new InvalidArgumentException('Port is not set', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('Port is not set', ResponseCode::unprocessable->value);
         }
     }
killedBy: norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testThrowsExceptionOnInvalidValue
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
infrastructure/persistence/Port.php:33:5
     }
 
 
-    public function asInt(): int
+    protected function asInt(): int
     {
         return $this->port;
killedBy: norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
statusReason: 1) norsk\api\infrastructure\persistence\PortTest::testCanBeUsedAsIntFromString
Error: Call to protected method norsk\api\infrastructure\persistence\Port::asInt() from scope norsk\api\infrastructure\persistence\PortTest

/app/api/tests/unit/infrastructure/persistence/PortTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
