[Killed] IfNegation
infrastructure/identityAccessManagement/authorization/Authorization.php:36:13
             $authenticatedUser = JwtAuthenticatedUser::byRequest($request);
             $authorizedDecision = $this->strategy->authorize($authenticatedUser);
 
-            if ($authorizedDecision->failed()) {
-                return $this->strategy->unauthorizedResponse();
-            }
+            if (!$authorizedDecision->failed()) {
 
             $this->strategy->checkActive($authenticatedUser);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:37:17
             $authorizedDecision = $this->strategy->authorize($authenticatedUser);
 
             if ($authorizedDecision->failed()) {
-                return $this->strategy->unauthorizedResponse();
+                
             }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnUnauthorizedResponseIfAuthorizationFails
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnUnauthorizedResponseIfAuthorizationFails
norsk\api\infrastructure\logging\Logger::info(TestStub_LogMessage_7155129f Object (...)): void was not expected to be called.

/app/api/src/user/infrastructure/identityAccessManagement/authorization/Authorization.php:35
/app/api/tests/unit/user/infrastruc

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:40:13
                 return $this->strategy->unauthorizedResponse();
             }
 
-            $this->strategy->checkActive($authenticatedUser);
+            
             $logMessage = $this->strategy->successLogging($authorizedDecision);
             $this->logger->info(
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "checkActive" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:42:13
 
             $this->strategy->checkActive($authenticatedUser);
             $logMessage = $this->strategy->successLogging($authorizedDecision);
-            $this->logger->info(
-                $logMessage
-            );
+            
 
             return $handler->handle($request);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:46:13
                 $logMessage
             );
 
-            return $handler->handle($request);
+            
         } catch (Throwable $throwable) {
             $this->logger->info(
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanReturnSuccessfulAuthorization
TypeError: norsk\api\user\infrastructure\identityAccessManagement\authorization\Authorization::process(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/user/infrastructure/identityAccessManagement/authorization/Authorization.

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:48:13
 
             return $handler->handle($request);
         } catch (Throwable $throwable) {
-            $this->logger->info(
-                $this->strategy->infoLogMessageForError($authorizedDecision->getUserName())
-            );
+            
             $this->logger->error($throwable);
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanHandleErrorWithEmptyUserName
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanHandleErrorWithEmptyUserName
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 22, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/Authorization.php:51:13
             $this->logger->info(
                 $this->strategy->infoLogMessageForError($authorizedDecision->getUserName())
             );
-            $this->logger->error($throwable);
+            
 
             return ErrorResponse::unauthorized($this->url, $throwable);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanHandleErrorWithEmptyUserName
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationTest::testCanHandleErrorWithEmptyUserName
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 23, Failures: 1.
