[Killed] PublicVisibility
infrastructure/persistence/SqlResult.php:25:5
      * @param array<array|string|int|bool|null> $result
      * @return self
      */
-    public static function resultFromArray(array $result): self
+    protected static function resultFromArray(array $result): self
     {
         return new self($result);
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testCountReturnsCorrectIntOfElements with data set #0 ([], 0)
Error: Call to protected method norsk\api\infrastructure\persistence\SqlResult::resultFromArray() from scope norsk\api\infrastructure\persistence\SqlResultTest

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:90

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/SqlResult.php:46:5
     }
 
 
-    public function count(): int
+    protected function count(): int
     {
         return count($this->result);
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testCountReturnsCorrectIntOfElements with data set #0 ([], 0)
Error: Call to protected method norsk\api\infrastructure\persistence\SqlResult::count() from scope norsk\api\infrastructure\persistence\SqlResultTest

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:90

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/persistence/SqlResult.php:52:5
     }
 
 
-    public function hasEntries(): bool
+    protected function hasEntries(): bool
     {
         if ($this->hasCountedResultsByQuery()) {
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Error: Call to protected method norsk\api\infrastructure\persistence\SqlResult::hasEntries() from scope norsk\api\infrastructure\persistence\SqlResultTest

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.

[Killed] IfNegation
infrastructure/persistence/SqlResult.php:54:9
 
     public function hasEntries(): bool
     {
-        if ($this->hasCountedResultsByQuery()) {
-            return true;
-        }
+        if (!$this->hasCountedResultsByQuery()) {
 
         return $this->hasAnyResults();
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:55:13
     public function hasEntries(): bool
     {
         if ($this->hasCountedResultsByQuery()) {
-            return true;
+            
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] TrueValue
infrastructure/persistence/SqlResult.php:55:13
     public function hasEntries(): bool
     {
         if ($this->hasCountedResultsByQuery()) {
-            return true;
+            return false;
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] Foreach_
infrastructure/persistence/SqlResult.php:66:9
     {
         $anyKeysParent = array_keys($this->result);
 
-        foreach ($anyKeysParent as $parentKey) {
-            if (is_array($this->result[$parentKey])) {
-                $anyKeysChild = array_filter($this->result[$parentKey], $this->hasChildValues());
-
-                return $this->childHasValues($anyKeysChild);
-            }
-        }
+        foreach ([] as $parentKey) {
 
         return false;
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] IfNegation
infrastructure/persistence/SqlResult.php:67:13
         $anyKeysParent = array_keys($this->result);
 
         foreach ($anyKeysParent as $parentKey) {
-            if (is_array($this->result[$parentKey])) {
-                $anyKeysChild = array_filter($this->result[$parentKey], $this->hasChildValues());
-
-                return $this->childHasValues($anyKeysChild);
-            }
+            if (!is_array($this->result[$parentKey])) {
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:70:17
             if (is_array($this->result[$parentKey])) {
                 $anyKeysChild = array_filter($this->result[$parentKey], $this->hasChildValues());
 
-                return $this->childHasValues($anyKeysChild);
+                
             }
         }
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] GreaterThanNegotiation
infrastructure/persistence/SqlResult.php:80:9
 
     private function hasChildValues(): Closure
     {
-        return static fn($value) => $value > 0;
+        return static fn($value) => $value <= 0;
     }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] GreaterThan
infrastructure/persistence/SqlResult.php:80:9
 
     private function hasChildValues(): Closure
     {
-        return static fn($value) => $value > 0;
+        return static fn($value) => $value >= 0;
     }
 
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.

[Killed] IfNegation
infrastructure/persistence/SqlResult.php:86:9
 
     private function childHasValues(array $anyKeysChild): bool
     {
-        if ($this->childIsNotEmpty($anyKeysChild)) {
-            return true;
-        }
+        if (!$this->childIsNotEmpty($anyKeysChild)) {
 
         return false;
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] TrueValue
infrastructure/persistence/SqlResult.php:87:13
     private function childHasValues(array $anyKeysChild): bool
     {
         if ($this->childIsNotEmpty($anyKeysChild)) {
-            return true;
+            return false;
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:87:13
     private function childHasValues(array $anyKeysChild): bool
     {
         if ($this->childIsNotEmpty($anyKeysChild)) {
-            return true;
+            
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] LogicalNot
infrastructure/persistence/SqlResult.php:96:9
 
     private function childIsNotEmpty(array $anyKeysChild): bool
     {
-        return !empty($anyKeysChild);
+        return empty($anyKeysChild);
     }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #0 ([['x']])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] IfNegation
infrastructure/persistence/SqlResult.php:102:9
 
     private function hasAnyResults(): bool
     {
-        if ($this->wasCountedByQuery()) {
-            return false;
-        }
+        if (!$this->wasCountedByQuery()) {
         if (count($this->result) > 0) {
             return true;
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:103:13
     private function hasAnyResults(): bool
     {
         if ($this->wasCountedByQuery()) {
-            return false;
+            
         }
         if (count($this->result) > 0) {
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.

[Killed] FalseValue
infrastructure/persistence/SqlResult.php:103:13
     private function hasAnyResults(): bool
     {
         if ($this->wasCountedByQuery()) {
-            return false;
+            return true;
         }
         if (count($this->result) > 0) {
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.

[Killed] GreaterThan
infrastructure/persistence/SqlResult.php:105:9
         if ($this->wasCountedByQuery()) {
             return false;
         }
-        if (count($this->result) > 0) {
+        if (count($this->result) >= 0) {
             return true;
         }
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultIsEmpty
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultIsEmpty
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:97

FAILURES!
Tests: 10, Assertions: 10, Failures: 1.

[Killed] GreaterThanNegotiation
infrastructure/persistence/SqlResult.php:105:9
         if ($this->wasCountedByQuery()) {
             return false;
         }
-        if (count($this->result) > 0) {
+        if (count($this->result) <= 0) {
             return true;
         }
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] TrueValue
infrastructure/persistence/SqlResult.php:106:13
             return false;
         }
         if (count($this->result) > 0) {
-            return true;
+            return false;
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:106:13
             return false;
         }
         if (count($this->result) > 0) {
-            return true;
+            
         }
 
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Survived] UnwrapArrayKeys
infrastructure/persistence/SqlResult.php:115:9
 
     private function wasCountedByQuery(): bool
     {
-        $anyKeysParent = array_keys($this->result);
+        $anyKeysParent = $this->result;
 
         foreach ($anyKeysParent as $parentKey) {

[Killed] Foreach_
infrastructure/persistence/SqlResult.php:117:9
     {
         $anyKeysParent = array_keys($this->result);
 
-        foreach ($anyKeysParent as $parentKey) {
-            if (is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0) {
-                return true;
-            }
-        }
+        foreach ([] as $parentKey) {
 
         return false;
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.

[Killed] LogicalAndNegation
infrastructure/persistence/SqlResult.php:118:13
         $anyKeysParent = array_keys($this->result);
 
         foreach ($anyKeysParent as $parentKey) {
-            if (is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0) {
+            if (!(is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0)) {
                 return true;
             }
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
Failed asserting that false is true.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:104

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
infrastructure/persistence/SqlResult.php:118:13
         $anyKeysParent = array_keys($this->result);
 
         foreach ($anyKeysParent as $parentKey) {
-            if (is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0) {
+            if (!is_array($this->result[$parentKey]) && !(count($this->result[$parentKey]) > 0)) {
                 return true;
             }
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsTrueIfResultHasAtLeastOneEntry with data set #2 (['else'])
TypeError: count(): Argument #1 ($value) must be of type Countable|array, string given

/app/api/src/infrastructure/persistence/SqlResult.php:87
/app/api/src/infrastructure/persistence/SqlResult.php:75
/app/api/src/infrastructure/persistence/SqlResult.php:45
/app/api/tests/u

[Killed] ReturnRemoval
infrastructure/persistence/SqlResult.php:119:17
 
         foreach ($anyKeysParent as $parentKey) {
             if (is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0) {
-                return true;
+                
             }
         }
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.

[Killed] TrueValue
infrastructure/persistence/SqlResult.php:119:17
 
         foreach ($anyKeysParent as $parentKey) {
             if (is_array($this->result[$parentKey]) && count($this->result[$parentKey]) > 0) {
-                return true;
+                return false;
             }
         }
killedBy: norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
statusReason: 1) norsk\api\infrastructure\persistence\SqlResultTest::testReturnsFalseIfResultHasNoAmountBySqlCountEntry
Failed asserting that true is false.

/app/api/tests/unit/infrastructure/persistence/SqlResultTest.php:120

FAILURES!
Tests: 12, Assertions: 12, Failures: 1.
