[Killed] PublicVisibility
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:21:5
     }
 
 
-    public static function by(
+    protected static function by(bool $isAuthorized = false, ?UserName $userName = null, ?Role $role = null): self
         bool $isAuthorized = false,
         ?UserName $userName = null,
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetUserName
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetUserName
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision::by() from scope norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest

/app/api/tests/unit/user/infrastructure/identi

[Killed] FalseValue
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:22:9
 
 
     public static function by(
-        bool $isAuthorized = false,
+        public static function by(bool $isAuthorized = true, ?UserName $userName = null, ?Role $role = null): self
         ?UserName $userName = null,
         ?Role $role = null
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
Failed asserting that false is true.

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authorization/AuthorizationDecisionTest.php:74

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:30:5
     }
 
 
-    public function isAuthorized(): bool
+    protected function isAuthorized(): bool
     {
         return $this->isAuthorized;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsAuthorized
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsAuthorized
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision::isAuthorized() from scope norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest

/app/api/tests/unit/user/infrastructur

[Killed] PublicVisibility
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:36:5
     }
 
 
-    public function getUserName(): ?UserName
+    protected function getUserName(): ?UserName
     {
         return $this->userName;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetUserName
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetUserName
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision::getUserName() from scope norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest

/app/api/tests/unit/user/infrastructu

[Killed] PublicVisibility
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:42:5
     }
 
 
-    public function getRole(): ?Role
+    protected function getRole(): ?Role
     {
         return $this->role;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetRole
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testCanGetRole
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision::getRole() from scope norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest

/app/api/tests/unit/user/infrastructure/ident

[Killed] PublicVisibility
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:48:5
     }
 
 
-    public function failed(): bool
+    protected function failed(): bool
     {
         return !$this->isAuthorized;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision::failed() from scope norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest

/app/api/tests/unit/user/infrastructure/identity

[Killed] LogicalNot
infrastructure/identityAccessManagement/authorization/AuthorizationDecision.php:50:9
 
     public function failed(): bool
     {
-        return !$this->isAuthorized;
+        return $this->isAuthorized;
     }
 }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecisionTest::testIsFailed
Failed asserting that false is true.

/app/api/tests/unit/user/infrastructure/identityAccessManagement/authorization/AuthorizationDecisionTest.php:74

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.
