[Killed] PublicVisibility
infrastructure/persistence/User.php:17:5
     }
 
 
-    public static function fromString(string $user): self
+    protected static function fromString(string $user): self
     {
         self::ensureIsNotEmpty(trim($user));
statusReason: 1) norsk\api\infrastructure\persistence\UserTest::testFailsIfUserIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to protected method norsk\api\infrastructure\persistence\User::fromString() from scope norsk\api\infrastructure\persistence\UserTest" at
/app/api/tests/unit/infrastructure/pe

[Killed] MethodCallRemoval
infrastructure/persistence/User.php:19:9
 
     public static function fromString(string $user): self
     {
-        self::ensureIsNotEmpty(trim($user));
+        
 
         return new self($user);
statusReason: 1) norsk\api\infrastructure\persistence\UserTest::testFailsIfUserIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] UnwrapTrim
infrastructure/persistence/User.php:19:9
 
     public static function fromString(string $user): self
     {
-        self::ensureIsNotEmpty(trim($user));
+        self::ensureIsNotEmpty($user);
 
         return new self($user);
statusReason: 1) norsk\api\infrastructure\persistence\UserTest::testFailsIfUserIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
infrastructure/persistence/User.php:27:9
 
     private static function ensureIsNotEmpty(string $user): void
     {
-        if ($user === '') {
+        if ($user !== '') {
             throw new InvalidArgumentException('User is not set', ResponseCode::unprocessable->value);
         }
statusReason: 1) norsk\api\infrastructure\persistence\UserTest::testFailsIfUserIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
infrastructure/persistence/User.php:28:13
     private static function ensureIsNotEmpty(string $user): void
     {
         if ($user === '') {
-            throw new InvalidArgumentException('User is not set', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('User is not set', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\infrastructure\persistence\UserTest::testFailsIfUserIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
