[Killed] IfNegation
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:31:9
     public function authorize(AuthenticatedUserInterface $authenticatedUser): AuthorizationDecision
     {
         $managerRole = $authenticatedUser->roleEquals(Role::MANAGER);
-        if ($managerRole) {
-            return AuthorizationDecision::by(
-                isAuthorized: true,
-                userName: $authenticatedUser->getUsername(),
-                role: $authenticatedUser->getRole()
-            );
-        }
+        if (!$managerRole) {
 
         return AuthorizationDecision::by();
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsEmptyDecisionIf
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsEmptyDecisionIf
PHPUnit\Framework\MockObject\RuntimeException: Return value for norsk\api\user\application\AuthenticatedUserInterface::getRole() cannot be generated: Class "norsk\api\user\domain\model\Role" is an enumeration and cannot be doubled

/app/api/src/user/infrastru

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:32:13
     {
         $managerRole = $authenticatedUser->roleEquals(Role::MANAGER);
         if ($managerRole) {
-            return AuthorizationDecision::by(
-                isAuthorized: true,
-                userName: $authenticatedUser->getUsername(),
-                role: $authenticatedUser->getRole()
-            );
+            
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsValidDecision
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsValidDecision
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision Object (
-    'isAuthorized' => true
-    'userName' => norsk\api\user\domain\valueObjects\Use

[Killed] TrueValue
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:33:17
         $managerRole = $authenticatedUser->roleEquals(Role::MANAGER);
         if ($managerRole) {
             return AuthorizationDecision::by(
-                isAuthorized: true,
+                return AuthorizationDecision::by(isAuthorized: false, userName: $authenticatedUser->getUsername(), role: $authenticatedUser->getRole());
                 userName: $authenticatedUser->getUsername(),
                 role: $authenticatedUser->getRole()
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsValidDecision
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testAutorizeReturnsValidDecision
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision Object (
-    'isAuthorized' => true
+    'isAuthorized' => false

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:45:9
 
     public function checkActive(AuthenticatedUserInterface $authenticatedUser): void
     {
-        $this->usersReader->isActiveManager($authenticatedUser->getUserName());
+        
     }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanCheckActive
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanCheckActive
Expectation failed for method name is "isActiveManager" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] Identical
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:71:9
 
     private function getUserName(AuthorizationDecision $authorizationDecision): UserName
     {
-        if ($authorizationDecision->getUserName() === null) {
+        if ($authorizationDecision->getUserName() !== null) {
             throw new InvalidArgumentException('UserName is not defined.');
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMessageForSuccess
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMessageForSuccess
InvalidArgumentException: UserName is not defined.

/app/api/src/user/infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:45
/app/api/src/user/infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.ph

[Killed] Throw_
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:72:13
     private function getUserName(AuthorizationDecision $authorizationDecision): UserName
     {
         if ($authorizationDecision->getUserName() === null) {
-            throw new InvalidArgumentException('UserName is not defined.');
+            new InvalidArgumentException('UserName is not defined.');
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testThrowsExceptionIfUserNameIsUnknownForSuccessLogging
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testThrowsExceptionIfUserNameIsUnknownForSuccessLogging
/app/api/src/user/infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:47
/app/api/src/user/infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:39
/app/api/tests/unit/us

[Killed] InstanceOf_
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:87:9
 
     private function createLogMessage(?UserName $userName): string
     {
-        if ($userName instanceof UserName) {
+        if (!$userName instanceof UserName) {
             return 'Could not authenticate manager: ' . $userName->asString();
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\logging\LogMessage Object (
-    'message' => 'Could not authenticate manager: someUserName'
+    'message' => 'Could not authenticate manager without user

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:88:13
     private function createLogMessage(?UserName $userName): string
     {
         if ($userName instanceof UserName) {
-            return 'Could not authenticate manager: ' . $userName->asString();
+            return $userName->asString();
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\logging\LogMessage Object (
-    'message' => 'Could not authenticate manager: someUserName'
+    'message' => 'someUserName'

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/ManagerAuthorizationStrategy.php:88:13
     private function createLogMessage(?UserName $userName): string
     {
         if ($userName instanceof UserName) {
-            return 'Could not authenticate manager: ' . $userName->asString();
+            
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\ManagerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\logging\LogMessage Object (
-    'message' => 'Could not authenticate manager: someUserName'
+    'message' => 'Could not authenticate manager without user
