[Killed] PublicVisibility
infrastructure/routing/Context.php:26:5
     }
 
 
-    public function manager(): ManagerFactory
+    protected function manager(): ManagerFactory
     {
         return new ManagerFactory($this->logger, $this->dbConnection, $this->appConfig);
killedBy: norsk\api\infrastructure\routing\ContextTest::testCanCreateManagerFactory
statusReason: 1) norsk\api\infrastructure\routing\ContextTest::testCanCreateManagerFactory
Error: Call to protected method norsk\api\infrastructure\routing\Context::manager() from scope norsk\api\infrastructure\routing\ContextTest

/app/api/tests/unit/infrastructure/routing/ContextTest.php:47

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
infrastructure/routing/Context.php:32:5
     }
 
 
-    public function trainer(): TrainerFactory
+    protected function trainer(): TrainerFactory
     {
         return new TrainerFactory($this->logger, $this->dbConnection, $this->appConfig);
killedBy: norsk\api\infrastructure\routing\ContextTest::testCanCreateTrainerFactory
statusReason: 1) norsk\api\infrastructure\routing\ContextTest::testCanCreateTrainerFactory
Error: Call to protected method norsk\api\infrastructure\routing\Context::trainer() from scope norsk\api\infrastructure\routing\ContextTest

/app/api/tests/unit/infrastructure/routing/ContextTest.php:41

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
infrastructure/routing/Context.php:38:5
     }
 
 
-    public function userManagement(): UserManagementFactory
+    protected function userManagement(): UserManagementFactory
     {
         return new UserManagementFactory(
killedBy: norsk\api\infrastructure\routing\ContextTest::testCanCreateUserManagementFactory
statusReason: 1) norsk\api\infrastructure\routing\ContextTest::testCanCreateUserManagementFactory
Error: Call to protected method norsk\api\infrastructure\routing\Context::userManagement() from scope norsk\api\infrastructure\routing\ContextTest

/app/api/tests/unit/infrastructure/routing/ContextTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
