[Killed] LogicalOr
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:32:9
         $roleEqualsManager = $authenticatedUser->roleEquals(Role::MANAGER);
         $roleEqualsUser = $authenticatedUser->roleEquals(Role::USER);
 
-        if ($roleEqualsManager || $roleEqualsUser) {
+        if ($roleEqualsManager && $roleEqualsUser) {
             return AuthorizationDecision::by(
                 isAuthorized: true,
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testAutorizeReturnsValidDecision with data set "manager" (norsk\api\user\domain\model\Role Enum (MANAGER, 'manager'))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision Object (

[Killed] LogicalOrNegation
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:32:9
         $roleEqualsManager = $authenticatedUser->roleEquals(Role::MANAGER);
         $roleEqualsUser = $authenticatedUser->roleEquals(Role::USER);
 
-        if ($roleEqualsManager || $roleEqualsUser) {
+        if (!($roleEqualsManager || $roleEqualsUser)) {
             return AuthorizationDecision::by(
                 isAuthorized: true,
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testAutorizeReturnsValidDecision with data set "manager" (norsk\api\user\domain\model\Role Enum (MANAGER, 'manager'))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision Object (

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:33:13
         $roleEqualsUser = $authenticatedUser->roleEquals(Role::USER);
 
         if ($roleEqualsManager || $roleEqualsUser) {
-            return AuthorizationDecision::by(
-                isAuthorized: true,
-                userName: $authenticatedUser->getUsername(),
-                role: $authenticatedUser->getRole()
-            );
+            
         }
 
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testAutorizeReturnsValidDecision with data set "manager" (norsk\api\user\domain\model\Role Enum (MANAGER, 'manager'))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\user\infrastructure\identityAccessManagement\authorization\AuthorizationDecision Object (

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:46:9
 
     public function checkActive(AuthenticatedUserInterface $authenticatedUser): void
     {
-        $this->usersReader->checkIfUserExists($authenticatedUser->getUserName());
+        
     }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanCheckActive
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanCheckActive
Expectation failed for method name is "checkIfUserExists" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:89:13
     private function createLogMessage(?UserName $userName): string
     {
         if ($userName instanceof UserName) {
-            return 'Could not authenticate user for training: ' . $userName->asString();
+            
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\logging\LogMessage Object (
-    'message' => 'Could not authenticate user for training: someUserName'
+    'message' => 'Could not authenticate user for tr

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/authorization/TrainerAuthorizationStrategy.php:89:13
     private function createLogMessage(?UserName $userName): string
     {
         if ($userName instanceof UserName) {
-            return 'Could not authenticate user for training: ' . $userName->asString();
+            return $userName->asString();
         }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\authorization\TrainerAuthorizationStrategyTest::testCanGetLogMassageIfUserNameExists
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\logging\LogMessage Object (
-    'message' => 'Could not authenticate user for training: someUserName'
+    'message' => 'someUserName'
