[Survived] MethodCallRemoval
infrastructure/routing/ControllerName.php:18:9
         ControllerInterface $controller
     ) {
         $this->class = get_class($controller);
-        $this->ensureClassExists();
+        
     }
 

[Killed] PublicVisibility
infrastructure/routing/ControllerName.php:22:5
     }
 
 
-    public static function of(ControllerInterface $controller): self
+    protected static function of(ControllerInterface $controller): self
     {
         return new self($controller);
killedBy: norsk\api\infrastructure\routing\ControllerNameTest::testCanUseNameAsString
statusReason: 1) norsk\api\infrastructure\routing\ControllerNameTest::testCanUseNameAsString
Error: Call to protected method norsk\api\infrastructure\routing\ControllerName::of() from scope norsk\api\infrastructure\routing\ControllerNameTest

/app/api/tests/unit/infrastructure/routing/ControllerNameTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
