[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:16:5
     }
 
 
-    public static function fromString(string $token): self
+    protected static function fromString(string $token): self
     {
         self::ensureTokenIsJwtValid($token);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromPlainTokenString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromPlainTokenString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebToken::fromString() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/Jso

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:18:9
 
     public static function fromString(string $token): self
     {
-        self::ensureTokenIsJwtValid($token);
+        
 
         return new self($token);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testThrowsExceptionIfTokenFormatIsNotJwt
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testThrowsExceptionIfTokenFormatIsNotJwt
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LogicalNot
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:26:9
 
     private static function ensureTokenIsJwtValid(string $token): void
     {
-        if (!preg_match("/^([a-zA-Z0-9_=]{4,36})\.([a-zA-Z0-9_=]{4,})\.([a-zA-Z0-9_\-+\/=]{4,86})$/", $token)) {
+        if (preg_match("/^([a-zA-Z0-9_=]{4,36})\\.([a-zA-Z0-9_=]{4,})\\.([a-zA-Z0-9_\\-+\\/=]{4,86})\$/", $token)) {
             throw new InvalidArgumentException('Token has no valid format');
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromPlainTokenString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromPlainTokenString
InvalidArgumentException: Token has no valid format

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JsonWebToken.php:20
/app/api/src/user/infrastructure/identityAccessManagement/jwt/JsonWebToken.php:14
/app/api/tests/unit/user/infrastructure/identityAccessManagem

[Survived] PregMatchRemoveDollar
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:26:9
 
     private static function ensureTokenIsJwtValid(string $token): void
     {
-        if (!preg_match("/^([a-zA-Z0-9_=]{4,36})\.([a-zA-Z0-9_=]{4,})\.([a-zA-Z0-9_\-+\/=]{4,86})$/", $token)) {
+        if (!preg_match("/^([a-zA-Z0-9_=]{4,36})\\.([a-zA-Z0-9_=]{4,})\\.([a-zA-Z0-9_\\-+\\/=]{4,86})/", $token)) {
             throw new InvalidArgumentException('Token has no valid format');
         }

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:27:13
     private static function ensureTokenIsJwtValid(string $token): void
     {
         if (!preg_match("/^([a-zA-Z0-9_=]{4,36})\.([a-zA-Z0-9_=]{4,})\.([a-zA-Z0-9_\-+\/=]{4,86})$/", $token)) {
-            throw new InvalidArgumentException('Token has no valid format');
+            new InvalidArgumentException('Token has no valid format');
         }
     }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testThrowsExceptionIfTokenFormatIsNotJwt
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testThrowsExceptionIfTokenFormatIsNotJwt
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:32:5
     }
 
 
-    public static function fromBearerString(string $bearerToken): self
+    protected static function fromBearerString(string $bearerToken): self
     {
         $jwtToken = str_replace('Bearer ', '', $bearerToken);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromBearerString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromBearerString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebToken::fromBearerString() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/J

[Killed] UnwrapStrReplace
infrastructure/identityAccessManagement/jwt/JsonWebToken.php:34:9
 
     public static function fromBearerString(string $bearerToken): self
     {
-        $jwtToken = str_replace('Bearer ', '', $bearerToken);
+        $jwtToken = $bearerToken;
 
         return new self($jwtToken);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromBearerString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JsonWebTokenTest::testCanBeUsedAsStringFromBearerString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'xzJhb.eyJzdWIicCI6MTY1NTIxODAwOX0.ceU31GO4x6QscCNHS4_6GDVq4A'
+'Bearer xzJhb.eyJzdWIicCI6MTY1NTIxODAwOX0.ceU31GO4x6QscCNHS4_6GDVq4A'
