[Killed] PublicVisibility
infrastructure/routing/ControllerResolver.php:24:5
     }
 
 
-    public function resolve(ControllerName $name): object
+    protected function resolve(ControllerName $name): object
     {
         return match ($name->asString()) {
statusReason: 1) norsk\api\infrastructure\routing\ControllerResolverTest::testCanResolveController with data set "wordManager" ('norsk\api\manager\infrastruct...anager', 'wordManager', 'manager')
Error: Call to protected method norsk\api\infrastructure\routing\ControllerResolver::resolve() from scope norsk\api\infrastructure\routing\ControllerResolverTest

/app/api/tests/unit/infrastructure/routing/ControllerRe

[Killed] MatchArmRemoval
infrastructure/routing/ControllerResolver.php:26:9
 
     public function resolve(ControllerName $name): object
     {
-        return match ($name->asString()) {
-            WordManager::class => $this->managerFactory->wordManager(),
-            VerbManager::class => $this->managerFactory->verbManager(),
-            WordTrainer::class => $this->trainerFactory->wordTrainer(),
-            VerbTrainer::class => $this->trainerFactory->verbTrainer(),
-            default => throw new RuntimeException('Unknown controller: ' . $name->asString()),
-        };
+        
     }
 }
statusReason: 1) norsk\api\infrastructure\routing\ControllerResolverTest::testCanResolveController with data set "wordManager" ('norsk\api\manager\infrastruct...anager', 'wordManager', 'manager')
norsk\api\infrastructure\routing\ControllerName::asString(): string was not expected to be called more than once.

/app/api/src/infrastructure/routing/ControllerResolver.php:24
/app/api/tests/unit/infrastructure/routin

[Killed] Concat
infrastructure/routing/ControllerResolver.php:31:13
             VerbManager::class => $this->managerFactory->verbManager(),
             WordTrainer::class => $this->trainerFactory->wordTrainer(),
             VerbTrainer::class => $this->trainerFactory->verbTrainer(),
-            default => throw new RuntimeException('Unknown controller: ' . $name->asString()),
+            default => throw new RuntimeException($name->asString() . 'Unknown controller: '),
         };
     }
killedBy: norsk\api\infrastructure\routing\ControllerResolverTest::testThrowsExceptionIfControllerIsUnknown
statusReason: 1) norsk\api\infrastructure\routing\ControllerResolverTest::testThrowsExceptionIfControllerIsUnknown
Failed asserting that exception message 'norsk\api\user\infrastructure\web\controller\LoginUnknown controller: ' contains 'Unknown controller: norsk\api\user\infrastructure\web\controller\Login'.

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/routing/ControllerResolver.php:31:13
             VerbManager::class => $this->managerFactory->verbManager(),
             WordTrainer::class => $this->trainerFactory->wordTrainer(),
             VerbTrainer::class => $this->trainerFactory->verbTrainer(),
-            default => throw new RuntimeException('Unknown controller: ' . $name->asString()),
+            default => throw new RuntimeException('Unknown controller: '),
         };
     }
killedBy: norsk\api\infrastructure\routing\ControllerResolverTest::testThrowsExceptionIfControllerIsUnknown
statusReason: 1) norsk\api\infrastructure\routing\ControllerResolverTest::testThrowsExceptionIfControllerIsUnknown
Failed asserting that exception message 'Unknown controller: ' contains 'Unknown controller: norsk\api\user\infrastructure\web\controller\Login'.

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.
