[Killed] Identical
infrastructure/routing/CorsMiddleware.php:29:9
 
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler): ResponseInterface
     {
-        if ($request->getMethod() === 'OPTIONS') {
+        if ($request->getMethod() !== 'OPTIONS') {
             return SuccessResponse::corsOptions($this->url);
         }
killedBy: norsk\api\infrastructure\routing\CorsMiddlewareTest::testReturnsCorsOptionsResponseForOptionsRequest
statusReason: 1) norsk\api\infrastructure\routing\CorsMiddlewareTest::testReturnsCorsOptionsResponseForOptionsRequest
Error: Call to a member function withHeader() on null

/app/api/src/shared/infrastructure/http/response/ResponseHeaderApplier.php:25
/app/api/src/infrastructure/routing/CorsMiddleware.php:32
/app/api/src/infrastructure/routing/CorsMiddleware.php:26
/app/api/tests/unit/infrastructure/routing/Cors

[Killed] ReturnRemoval
infrastructure/routing/CorsMiddleware.php:30:13
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler): ResponseInterface
     {
         if ($request->getMethod() === 'OPTIONS') {
-            return SuccessResponse::corsOptions($this->url);
+            
         }
 
killedBy: norsk\api\infrastructure\routing\CorsMiddlewareTest::testReturnsCorsOptionsResponseForOptionsRequest
statusReason: 1) norsk\api\infrastructure\routing\CorsMiddlewareTest::testReturnsCorsOptionsResponseForOptionsRequest
Error: Call to a member function withHeader() on null

/app/api/src/shared/infrastructure/http/response/ResponseHeaderApplier.php:25
/app/api/src/infrastructure/routing/CorsMiddleware.php:32
/app/api/src/infrastructure/routing/CorsMiddleware.php:26
/app/api/tests/unit/infrastructure/routing/Cors
