[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtAudience.php:17:5
     }
 
 
-    public static function by(string $jwtAudience): self
+    protected static function by(string $jwtAudience): self
     {
         $trimmed = trim($jwtAudience);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudience::by() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtAudienceTest.php:16

ERRORS!
Te

[Killed] UnwrapTrim
infrastructure/identityAccessManagement/jwt/JwtAudience.php:19:9
 
     public static function by(string $jwtAudience): self
     {
-        $trimmed = trim($jwtAudience);
+        $trimmed = $jwtAudience;
 
         self::ensureIsNotEmpty($trimmed);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Identical
infrastructure/identityAccessManagement/jwt/JwtAudience.php:29:9
 
     private static function ensureIsNotEmpty(string $jwtAudience): void
     {
-        if ($jwtAudience === '') {
+        if ($jwtAudience !== '') {
             throw new InvalidArgumentException('Audience in JWT cannot be empty.');
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testCanBeUsedAsString
InvalidArgumentException: Audience in JWT cannot be empty.

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtAudience.php:22
/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtAudience.php:16
/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtAudie

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtAudience.php:30:13
     private static function ensureIsNotEmpty(string $jwtAudience): void
     {
         if ($jwtAudience === '') {
-            throw new InvalidArgumentException('Audience in JWT cannot be empty.');
+            new InvalidArgumentException('Audience in JWT cannot be empty.');
         }
     }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtAudienceTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
