[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtConfig.php:21:5
     }
 
 
-    public static function fromCredentials(
+    protected static function fromCredentials(AuthenticationKey $authKey, AuthenticationAlgorithm $algorithm, JwtSubject $subject, JwtAudience $audience): self
         AuthenticationKey $authKey,
         AuthenticationAlgorithm $algorithm,
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAlgorithm
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAlgorithm
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfig::fromCredentials() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtConfigTest.php:69

ERRORS!

[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtConfig.php:31:5
     }
 
 
-    public function getAuthKey(): AuthenticationKey
+    protected function getAuthKey(): AuthenticationKey
     {
         return $this->authKey;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAuthKey
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAuthKey
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfig::getAuthKey() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtConfigTest.php:39

ERRORS!
Tests:

[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtConfig.php:37:5
     }
 
 
-    public function getAlgorithm(): AuthenticationAlgorithm
+    protected function getAlgorithm(): AuthenticationAlgorithm
     {
         return $this->algorithm;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAlgorithm
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAlgorithm
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfig::getAlgorithm() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtConfigTest.php:30

ERRORS!
Te

[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtConfig.php:43:5
     }
 
 
-    public function getSubject(): JwtSubject
+    protected function getSubject(): JwtSubject
     {
         return $this->subject;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetSubject
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetSubject
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfig::getSubject() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtConfigTest.php:48

ERRORS!
Tests:

[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtConfig.php:49:5
     }
 
 
-    public function getAudience(): JwtAudience
+    protected function getAudience(): JwtAudience
     {
         return $this->audience;
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAudience
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest::testCanGetAudience
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfig::getAudience() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtConfigTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtConfigTest.php:57

ERRORS!
Test
