[Killed] PublicVisibility
infrastructure/routing/Method.php:17:5
     }
 
 
-    public static function of(string $string): self
+    protected static function of(string $string): self
     {
         self::ensureIsNotEmpty($string);
killedBy: norsk\api\infrastructure\routing\MethodTest::testCanUseMethodAsString
statusReason: 1) norsk\api\infrastructure\routing\MethodTest::testCanUseMethodAsString
Error: Call to protected method norsk\api\infrastructure\routing\Method::of() from scope norsk\api\infrastructure\routing\MethodTest

/app/api/tests/unit/infrastructure/routing/MethodTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/routing/Method.php:19:9
 
     public static function of(string $string): self
     {
-        self::ensureIsNotEmpty($string);
+        
 
         return new self($string);
killedBy: norsk\api\infrastructure\routing\MethodTest::testThrowsExceptionIfStringIsEmpty
statusReason: 1) norsk\api\infrastructure\routing\MethodTest::testThrowsExceptionIfStringIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Throw_
infrastructure/routing/Method.php:28:13
     private static function ensureIsNotEmpty(string $string): void
     {
         if (empty($string)) {
-            throw new InvalidArgumentException(message: 'Method cannot be empty.');
+            new InvalidArgumentException(message: 'Method cannot be empty.');
         }
     }
killedBy: norsk\api\infrastructure\routing\MethodTest::testThrowsExceptionIfStringIsEmpty
statusReason: 1) norsk\api\infrastructure\routing\MethodTest::testThrowsExceptionIfStringIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
