[Killed] IncrementInteger
infrastructure/identityAccessManagement/jwt/JwtManagement.php:68:9
 
     public function validate(ServerRequestInterface $request): Payload
     {
-        $tokenString = $request->getHeader('Authorization')[0];
+        $tokenString = $request->getHeader('Authorization')[1];
         $token = JsonWebToken::fromBearerString(SanitizedClientInput::of($tokenString)->asString());
 
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
TypeError: norsk\api\shared\application\SanitizedClientInput::of(): Argument #1 ($string) must be of type string, null given, called in /app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagement.php on line 44

/app/

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:72:9
         $token = JsonWebToken::fromBearerString(SanitizedClientInput::of($tokenString)->asString());
 
         $decodedPayload = $this->validateJwtToken($token);
-        $this->validateJwtContent($decodedPayload);
+        
 
         $this->logger->info(LogMessage::fromString('Jwt is valid'));
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "notFromApp" ('invalidTokenNotFromApp.jwt', 'Token was not generated by Api')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastructure/identityAcc

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:74:9
         $decodedPayload = $this->validateJwtToken($token);
         $this->validateJwtContent($decodedPayload);
 
-        $this->logger->info(LogMessage::fromString('Jwt is valid'));
+        
 
         return Payload::by($decodedPayload);
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:87:13
             $secretKey64 = $jwtConfig->getAuthKey()->asBase64String();
             $headersCodec = $jwtConfig->getAlgorithm()->asString();
 
-            return JWT::decode($token->asString(), new Key($secretKey64, $headersCodec));
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
TypeError: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagement::validateJwtToken(): Return value must be of type stdClass, none returned

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagemen

[Killed] MatchArmRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:91:13
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
 
-            return match (true) {
-                $throwable instanceof ExpiredException => throw new RuntimeException(
-                    'Token expired: ' . $throwable->getMessage()
-                ),
-                $throwable instanceof SignatureInvalidException => throw new RuntimeException(
-                    'Invalid token signature: ' . $throwable->getMessage()
-                ),
-                $throwable instanceof BeforeValidException => throw new RuntimeException(
-                    'Token not valid yet: ' . $throwable->getMessage()
-                ),
-
-                default => throw new RuntimeException('Invalid token: ' . $throwable->getMessage()),
-            };
+            
         }
     }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "TokenExpired" ('invalidExpired.jwt', 'Token expired')
Failed asserting that exception message 'Invalid token: Expired token' contains 'Token expired'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] InstanceOf_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:92:17
             $this->logger->error($throwable);
 
             return match (true) {
-                $throwable instanceof ExpiredException => throw new RuntimeException(
+                !$throwable instanceof ExpiredException => throw new RuntimeException('Token expired: ' . $throwable->getMessage()),
                     'Token expired: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "TokenExpired" ('invalidExpired.jwt', 'Token expired')
Failed asserting that exception message 'Invalid token: Expired token' contains 'Token expired'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:92:17
             $this->logger->error($throwable);
 
             return match (true) {
-                $throwable instanceof ExpiredException => throw new RuntimeException(
-                    'Token expired: ' . $throwable->getMessage()
-                ),
+                $throwable instanceof ExpiredException => new RuntimeException('Token expired: ' . $throwable->getMessage()),
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
                     'Invalid token signature: ' . $throwable->getMessage()
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "TokenExpired" ('invalidExpired.jwt', 'Token expired')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagement::validateJwtToken(): Return

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:93:21
 
             return match (true) {
                 $throwable instanceof ExpiredException => throw new RuntimeException(
-                    'Token expired: ' . $throwable->getMessage()
+                    $throwable instanceof ExpiredException => throw new RuntimeException($throwable->getMessage()),
                 ),
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "TokenExpired" ('invalidExpired.jwt', 'Token expired')
Failed asserting that exception message 'Expired token' contains 'Token expired'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Survived] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:93:21
 
             return match (true) {
                 $throwable instanceof ExpiredException => throw new RuntimeException(
-                    'Token expired: ' . $throwable->getMessage()
+                    $throwable instanceof ExpiredException => throw new RuntimeException('Token expired: '),
                 ),
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(

[Killed] InstanceOf_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:95:17
                 $throwable instanceof ExpiredException => throw new RuntimeException(
                     'Token expired: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof SignatureInvalidException => throw new RuntimeException(
+                !$throwable instanceof SignatureInvalidException => throw new RuntimeException('Invalid token signature: ' . $throwable->getMessage()),
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "SignatureInvalid" ('invalidSignature.jwt', 'Invalid token signature')
Failed asserting that exception message 'Invalid token: Signature verification failed' contains 'Invalid token signature'.

FAILURES!
Tests: 6, Assertions: 26, Failures: 1.

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:95:17
                 $throwable instanceof ExpiredException => throw new RuntimeException(
                     'Token expired: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof SignatureInvalidException => throw new RuntimeException(
-                    'Invalid token signature: ' . $throwable->getMessage()
-                ),
+                $throwable instanceof SignatureInvalidException => new RuntimeException('Invalid token signature: ' . $throwable->getMessage()),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(
                     'Token not valid yet: ' . $throwable->getMessage()
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "SignatureInvalid" ('invalidSignature.jwt', 'Invalid token signature')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagement::validateJwt

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:96:21
                     'Token expired: ' . $throwable->getMessage()
                 ),
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
-                    'Invalid token signature: ' . $throwable->getMessage()
+                    $throwable instanceof SignatureInvalidException => throw new RuntimeException($throwable->getMessage()),
                 ),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "SignatureInvalid" ('invalidSignature.jwt', 'Invalid token signature')
Failed asserting that exception message 'Signature verification failed' contains 'Invalid token signature'.

FAILURES!
Tests: 6, Assertions: 26, Failures: 1.

[Survived] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:96:21
                     'Token expired: ' . $throwable->getMessage()
                 ),
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
-                    'Invalid token signature: ' . $throwable->getMessage()
+                    $throwable instanceof SignatureInvalidException => throw new RuntimeException('Invalid token signature: '),
                 ),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:98:17
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof BeforeValidException => throw new RuntimeException(
-                    'Token not valid yet: ' . $throwable->getMessage()
-                ),
+                $throwable instanceof BeforeValidException => new RuntimeException('Token not valid yet: ' . $throwable->getMessage()),
 
                 default => throw new RuntimeException('Invalid token: ' . $throwable->getMessage()),
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "BeforeValid" ('invalidNotValidYet.jwt', 'Token not valid yet')
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagement::validateJwtToken()

[Killed] InstanceOf_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:98:17
                 $throwable instanceof SignatureInvalidException => throw new RuntimeException(
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
-                $throwable instanceof BeforeValidException => throw new RuntimeException(
+                !$throwable instanceof BeforeValidException => throw new RuntimeException('Token not valid yet: ' . $throwable->getMessage()),
                     'Token not valid yet: ' . $throwable->getMessage()
                 ),
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "BeforeValid" ('invalidNotValidYet.jwt', 'Token not valid yet')
Failed asserting that exception message 'Invalid token: Cannot handle token with iat prior to 2200-09-28T13:37:27+0200' contains 'Token not valid yet'.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:99:21
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(
-                    'Token not valid yet: ' . $throwable->getMessage()
+                    $throwable instanceof BeforeValidException => throw new RuntimeException($throwable->getMessage()),
                 ),
 
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "BeforeValid" ('invalidNotValidYet.jwt', 'Token not valid yet')
Failed asserting that exception message 'Cannot handle token with iat prior to 2200-09-28T13:37:27+0200' contains 'Token not valid yet'.

FAILURES!
Tests: 7, Assertions: 32, Failures: 1.

[Survived] Concat
infrastructure/identityAccessManagement/jwt/JwtManagement.php:99:21
                     'Invalid token signature: ' . $throwable->getMessage()
                 ),
                 $throwable instanceof BeforeValidException => throw new RuntimeException(
-                    'Token not valid yet: ' . $throwable->getMessage()
+                    $throwable instanceof BeforeValidException => throw new RuntimeException($throwable->getMessage() . 'Token not valid yet: '),
                 ),
 

[Killed] ConcatOperandRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:102:17
                     'Token not valid yet: ' . $throwable->getMessage()
                 ),
 
-                default => throw new RuntimeException('Invalid token: ' . $throwable->getMessage()),
+                default => throw new RuntimeException($throwable->getMessage()),
             };
         }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenIsInvalid with data set "GeneralInvalidToken" ('invalid.jwt', 'Invalid token')
Failed asserting that exception message 'Incorrect key for this algorithm' contains 'Invalid token'.

FAILURES!
Tests: 8, Assertions: 38, Failures: 1.

[Survived] Concat
infrastructure/identityAccessManagement/jwt/JwtManagement.php:102:17
                     'Token not valid yet: ' . $throwable->getMessage()
                 ),
 
-                default => throw new RuntimeException('Invalid token: ' . $throwable->getMessage()),
+                default => throw new RuntimeException($throwable->getMessage() . 'Invalid token: '),
             };
         }

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:110:9
 
     private function validateJwtContent(stdClass $decodedPayload): void
     {
-        $this->ensureSubjectIsValid($decodedPayload);
+        
         $this->ensureAudienceIsValid($decodedPayload);
     }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "notFromApp" ('invalidTokenNotFromApp.jwt', 'Token was not generated by Api')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastructure/identityAcc

[Killed] MethodCallRemoval
infrastructure/identityAccessManagement/jwt/JwtManagement.php:111:9
     private function validateJwtContent(stdClass $decodedPayload): void
     {
         $this->ensureSubjectIsValid($decodedPayload);
-        $this->ensureAudienceIsValid($decodedPayload);
+        
     }
 
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "manipulatedClient" ('invalidTokenWithManipulatedClient.jwt', 'Token was not sent from Client')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastr

[Killed] LogicalOrNegation
infrastructure/identityAccessManagement/jwt/JwtManagement.php:117:9
 
     private function ensureSubjectIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'sub') || $decodedPayload->sub !== self::NORSK_APP_SUB) {
+        if (!(!property_exists($decodedPayload, 'sub') || $decodedPayload->sub !== self::NORSK_APP_SUB)) {
             throw new InvalidArgumentException('Token was not generated by Api');
         }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
InvalidArgumentException: Token was not generated by Api

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagement.php:75
/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagement.php:69
/app/api/

[Killed] LogicalOr
infrastructure/identityAccessManagement/jwt/JwtManagement.php:117:9
 
     private function ensureSubjectIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'sub') || $decodedPayload->sub !== self::NORSK_APP_SUB) {
+        if (!property_exists($decodedPayload, 'sub') && $decodedPayload->sub !== self::NORSK_APP_SUB) {
             throw new InvalidArgumentException('Token was not generated by Api');
         }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "notFromApp" ('invalidTokenNotFromApp.jwt', 'Token was not generated by Api')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastructure/identityAcc

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:118:13
     private function ensureSubjectIsValid(stdClass $decodedPayload): void
     {
         if (!property_exists($decodedPayload, 'sub') || $decodedPayload->sub !== self::NORSK_APP_SUB) {
-            throw new InvalidArgumentException('Token was not generated by Api');
+            new InvalidArgumentException('Token was not generated by Api');
         }
     }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "notFromApp" ('invalidTokenNotFromApp.jwt', 'Token was not generated by Api')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastructure/identityAcc

[Killed] LogicalOr
infrastructure/identityAccessManagement/jwt/JwtManagement.php:125:9
 
     private function ensureAudienceIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
+        if (!property_exists($decodedPayload, 'aud') && $decodedPayload->aud !== self::NORSK_CLIENT) {
             throw new InvalidArgumentException('Token was not sent from Client');
         }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "manipulatedClient" ('invalidTokenWithManipulatedClient.jwt', 'Token was not sent from Client')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastr

[Killed] NotIdentical
infrastructure/identityAccessManagement/jwt/JwtManagement.php:125:9
 
     private function ensureAudienceIsValid(stdClass $decodedPayload): void
     {
-        if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
+        if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud === self::NORSK_CLIENT) {
             throw new InvalidArgumentException('Token was not sent from Client');
         }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testCanValidateGivenTokenForScope with data set "user" ('validUserTokenWithTime.jwt')
InvalidArgumentException: Token was not sent from Client

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagement.php:81
/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtManagement.php:70
/app/api/

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtManagement.php:126:13
     private function ensureAudienceIsValid(stdClass $decodedPayload): void
     {
         if (!property_exists($decodedPayload, 'aud') || $decodedPayload->aud !== self::NORSK_CLIENT) {
-            throw new InvalidArgumentException('Token was not sent from Client');
+            new InvalidArgumentException('Token was not sent from Client');
         }
     }
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtManagementTest::testThrowsExceptionIfTokenWasManipulated with data set "manipulatedClient" ('invalidTokenWithManipulatedClient.jwt', 'Token was not sent from Client')
norsk\api\infrastructure\logging\Logger::info(norsk\api\infrastructure\logging\LogMessage Object (...)): void was not expected to be called.

/app/api/src/user/infrastr
