[Killed] PublicVisibility
manager/application/verbManaging/VerbCreator.php:21:5
     }
 
 
-    public function handle(CreateVerb $command): void
+    protected function handle(CreateVerb $command): void
     {
         $german = $command->getGerman();
killedBy: norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
Error: Call to protected method norsk\api\manager\application\verbManaging\VerbCreator::handle() from scope norsk\api\manager\application\verbManaging\VerbCreatorTest

/app/api/tests/unit/manager/application/verbManaging/VerbCreatorTest.php:57

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/verbManaging/VerbCreator.php:25:9
     {
         $german = $command->getGerman();
         $norsk = $command->getNorsk();
-        $this->uniquenessPolicy->ensureVocabularyIsNotAlreadyPersisted(id: null, german: $german, norsk: $norsk);
+        
 
         $managedVerb = ManagedVerb::createNew(
killedBy: norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
Expectation failed for method name is "ensureVocabularyIsNotAlreadyPersisted" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
manager/application/verbManaging/VerbCreator.php:35:9
             $command->getNorskPastPerfect()
         );
 
-        $this->writer->add($managedVerb);
+        
     }
 }
killedBy: norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbCreatorTest::testCanHandleCreateVerb
Expectation failed for method name is "add" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
