[Killed] PublicVisibility
infrastructure/identityAccessManagement/jwt/JwtSubject.php:17:5
     }
 
 
-    public static function by(string $jwtSubject): self
+    protected static function by(string $jwtSubject): self
     {
         $trimmed = trim($jwtSubject);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubject::by() from scope norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtSubjectTest.php:16

ERRORS!
Tests:

[Killed] UnwrapTrim
infrastructure/identityAccessManagement/jwt/JwtSubject.php:19:9
 
     public static function by(string $jwtSubject): self
     {
-        $trimmed = trim($jwtSubject);
+        $trimmed = $jwtSubject;
 
         self::ensureIsNotEmpty($trimmed);
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Identical
infrastructure/identityAccessManagement/jwt/JwtSubject.php:29:9
 
     private static function ensureIsNotEmpty(string $jwtSubject): void
     {
-        if ($jwtSubject === '') {
+        if ($jwtSubject !== '') {
             throw new InvalidArgumentException('Subject in JWT cannot be empty.');
         }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testCanBeUsedAsString
InvalidArgumentException: Subject in JWT cannot be empty.

/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtSubject.php:22
/app/api/src/user/infrastructure/identityAccessManagement/jwt/JwtSubject.php:16
/app/api/tests/unit/user/infrastructure/identityAccessManagement/jwt/JwtSubjectTe

[Killed] Throw_
infrastructure/identityAccessManagement/jwt/JwtSubject.php:30:13
     private static function ensureIsNotEmpty(string $jwtSubject): void
     {
         if ($jwtSubject === '') {
-            throw new InvalidArgumentException('Subject in JWT cannot be empty.');
+            new InvalidArgumentException('Subject in JWT cannot be empty.');
         }
     }
killedBy: norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\jwt\JwtSubjectTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
