[Killed] PublicVisibility
manager/application/verbManaging/VerbRemover.php:19:5
     }
 
 
-    public function handle(DeleteVerb $command): void
+    protected function handle(DeleteVerb $command): void
     {
         $this->writer->remove($command->getId(), vocabularyType: VocabularyType::verb);
killedBy: norsk\api\manager\application\verbManaging\VerbRemoverTest::testCanHandleDeleteVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbRemoverTest::testCanHandleDeleteVerb
Error: Call to protected method norsk\api\manager\application\verbManaging\VerbRemover::handle() from scope norsk\api\manager\application\verbManaging\VerbRemoverTest

/app/api/tests/unit/manager/application/verbManaging/VerbRemoverTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/verbManaging/VerbRemover.php:21:9
 
     public function handle(DeleteVerb $command): void
     {
-        $this->writer->remove($command->getId(), vocabularyType: VocabularyType::verb);
+        
     }
 }
killedBy: norsk\api\manager\application\verbManaging\VerbRemoverTest::testCanHandleDeleteVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbRemoverTest::testCanHandleDeleteVerb
Expectation failed for method name is "getId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
