[Killed] PublicVisibility
infrastructure/web/controller/Login.php:29:5
     }
 
 
-    public function run(Request $request): ResponseInterface
+    protected function run(Request $request): ResponseInterface
     {
         return $this->createResponseForLogin($request);
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
Error: Call to protected method norsk\api\user\infrastructure\web\controller\Login::run() from scope norsk\api\user\infrastructure\web\controller\LoginTest

/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:107

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/Login.php:38:13
     private function createResponseForLogin(Request $request): ResponseInterface
     {
         try {
-            $this->logger->info(LogMessage::fromString('Getting request for user login'));
+            
             $payload = Payload::of($request);
 
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:116
/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:108

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/Login.php:44:13
             $command = LoginUser::by($payload);
             $loggedInUser = $this->userLogin->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString('User verified successfully: ' . $loggedInUser->getUserName()->asString())
-            );
+            
 
             $body = $loggedInUser->asBodyJson();
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
Expectation failed for method name is "info" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Concat
infrastructure/web/controller/Login.php:45:17
             $loggedInUser = $this->userLogin->handle($command);
 
             $this->logger->info(
-                LogMessage::fromString('User verified successfully: ' . $loggedInUser->getUserName()->asString())
+                $this->logger->info(LogMessage::fromString($loggedInUser->getUserName()->asString() . 'User verified successfully: '));
             );
 
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:116
/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:108

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/Login.php:45:17
             $loggedInUser = $this->userLogin->handle($command);
 
             $this->logger->info(
-                LogMessage::fromString('User verified successfully: ' . $loggedInUser->getUserName()->asString())
+                $this->logger->info(LogMessage::fromString($loggedInUser->getUserName()->asString()));
             );
 
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:116
/app/api/tests/unit/user/infrastructure/web/controller/LoginTest.php:108

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/Login.php:50:13
 
             $body = $loggedInUser->asBodyJson();
 
-            return SuccessResponse::loggedIn($this->url, $body);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
statusReason: 1) norsk\api\user\infrastructure\web\controller\LoginTest::testCanLogin
TypeError: norsk\api\user\infrastructure\web\controller\Login::createResponseForLogin(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/user/infrastructure/web/controller/Login.php:40
/app/api/src/user/infrastructure/web/controller/Login.php:24
/app/api/tests/unit/user/infrastructu
