[Killed] PublicVisibility
manager/application/verbManaging/VerbUpdater.php:21:5
     }
 
 
-    public function handle(UpdateVerb $command): void
+    protected function handle(UpdateVerb $command): void
     {
         $id = $command->getId();
killedBy: norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
Error: Call to protected method norsk\api\manager\application\verbManaging\VerbUpdater::handle() from scope norsk\api\manager\application\verbManaging\VerbUpdaterTest

/app/api/tests/unit/manager/application/verbManaging/VerbUpdaterTest.php:70

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/verbManaging/VerbUpdater.php:27:9
         $german = $command->getGerman();
         $norsk = $command->getNorsk();
 
-        $this->policy->ensureVocabularyIsNotAlreadyPersisted($id, $german, $norsk);
+        
 
         $managedVerb = ManagedVerb::fromPersistence(
killedBy: norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
Expectation failed for method name is "ensureVocabularyIsNotAlreadyPersisted" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
manager/application/verbManaging/VerbUpdater.php:38:9
             $command->getNorskPastPerfect()
         );
 
-        $this->writer->update($managedVerb);
+        
     }
 }
killedBy: norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
statusReason: 1) norsk\api\manager\application\verbManaging\VerbUpdaterTest::testCanHandleCreateVerb
Expectation failed for method name is "update" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
