[Killed] PublicVisibility
manager/application/verbManaging/VerbsProvider.php:19:5
     }
 
 
-    public function handle(GetAllVerbs $command): Vocabularies
+    protected function handle(GetAllVerbs $command): Vocabularies
     {
         return $this->verbReader->getAllVerbs();
killedBy: norsk\api\manager\application\verbManaging\VerbsProviderTest::testCanHandleGetAllVerbs
statusReason: 1) norsk\api\manager\application\verbManaging\VerbsProviderTest::testCanHandleGetAllVerbs
Error: Call to protected method norsk\api\manager\application\verbManaging\VerbsProvider::handle() from scope norsk\api\manager\application\verbManaging\VerbsProviderTest

/app/api/tests/unit/manager/application/verbManaging/VerbsProviderTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
