[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:24:5
     }
 
 
-    public static function createBy(Payload $payload): self
+    protected static function createBy(Payload $payload): self
     {
         $payloadArray = $payload->asArray();
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetGerman
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetGerman
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::createBy() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:30

ERRORS!
Tests: 1, Assertions: 0, Errors:

[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:38:5
     }
 
 
-    public function getGerman(): German
+    protected function getGerman(): German
     {
         return $this->german;
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetGerman
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetGerman
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::getGerman() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:36

ERRORS!
Tests: 1, Assertions: 0, Errors:

[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:44:5
     }
 
 
-    public function getNorsk(): Norsk
+    protected function getNorsk(): Norsk
     {
         return $this->norsk;
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorsk
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorsk
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::getNorsk() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:42

ERRORS!
Tests: 2, Assertions: 1, Errors: 1

[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:50:5
     }
 
 
-    public function getNorskPresent(): Norsk
+    protected function getNorskPresent(): Norsk
     {
         return $this->norskPresent;
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPresent
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPresent
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::getNorskPresent() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:48

ERRORS!
Tests: 3, Assertions

[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:56:5
     }
 
 
-    public function getNorskPast(): Norsk
+    protected function getNorskPast(): Norsk
     {
         return $this->norskPast;
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPast
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPast
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::getNorskPast() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:54

ERRORS!
Tests: 4, Assertions: 3, E

[Killed] PublicVisibility
application/verbManaging/useCases/CreateVerb.php:62:5
     }
 
 
-    public function getNorskPastPerfect(): Norsk
+    protected function getNorskPastPerfect(): Norsk
     {
         return $this->norskPastPerfect;
killedBy: norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPastPerfect
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\CreateVerbTest::testCanGetNorskPastPerfect
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\CreateVerb::getNorskPastPerfect() from scope norsk\api\manager\application\verbManaging\useCases\CreateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/CreateVerbTest.php:60

ERRORS!
Tests: 5, As
