[Killed] PublicVisibility
application/verbManaging/useCases/DeleteVerb.php:16:5
     }
 
 
-    public static function createBy(Id $id): self
+    protected static function createBy(Id $id): self
     {
         return new self($id);
killedBy: norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest::testCanGetId
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest::testCanGetId
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\DeleteVerb::createBy() from scope norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/DeleteVerbTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
application/verbManaging/useCases/DeleteVerb.php:22:5
     }
 
 
-    public function getId(): Id
+    protected function getId(): Id
     {
         return $this->id;
killedBy: norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest::testCanGetId
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest::testCanGetId
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\DeleteVerb::getId() from scope norsk\api\manager\application\verbManaging\useCases\DeleteVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/DeleteVerbTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
