[Killed] PublicVisibility
application/verbManaging/useCases/GetAllVerbs.php:14:5
     }
 
 
-    public static function create(): self
+    protected static function create(): self
     {
         return new self();
killedBy: norsk\api\manager\application\verbManaging\useCases\GetAllVerbsTest::testGetAllVerbsCommandIsSingleton
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\GetAllVerbsTest::testGetAllVerbsCommandIsSingleton
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\GetAllVerbs::create() from scope norsk\api\manager\application\verbManaging\useCases\GetAllVerbsTest

/app/api/tests/unit/manager/application/verbManaging/useCases/GetAllVerbsTest.php:15

ERRORS!
Tests: 1, Asse
