[Killed] PublicVisibility
application/verbManaging/useCases/UpdateVerb.php:26:5
     }
 
 
-    public static function createBy(Id $id, Payload $payload): self
+    protected static function createBy(Id $id, Payload $payload): self
     {
         $payloadArray = $payload->asArray();
killedBy: norsk\api\manager\application\verbManaging\useCases\UpdateVerbTest::testCanGetId
statusReason: 1) norsk\api\manager\application\verbManaging\useCases\UpdateVerbTest::testCanGetId
Error: Call to protected method norsk\api\manager\application\verbManaging\useCases\UpdateVerb::createBy() from scope norsk\api\manager\application\verbManaging\useCases\UpdateVerbTest

/app/api/tests/unit/manager/application/verbManaging/useCases/UpdateVerbTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
