[Killed] PublicVisibility
manager/application/wordManaging/WordCreator.php:21:5
     }
 
 
-    public function handle(CreateWord $command): void
+    protected function handle(CreateWord $command): void
     {
         $german = $command->getGerman();
killedBy: norsk\api\manager\application\wordManaging\WordCreatorTest::testCanHandleCreateWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordCreatorTest::testCanHandleCreateWord
Error: Call to protected method norsk\api\manager\application\wordManaging\WordCreator::handle() from scope norsk\api\manager\application\wordManaging\WordCreatorTest

/app/api/tests/unit/manager/application/wordManaging/WordCreatorTest.php:42

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/wordManaging/WordCreator.php:29:9
 
         $managedWord = ManagedWord::createNew($german, $norsk);
 
-        $this->writer->add($managedWord);
+        
     }
 }
killedBy: norsk\api\manager\application\wordManaging\WordCreatorTest::testCanHandleCreateWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordCreatorTest::testCanHandleCreateWord
Expectation failed for method name is "add" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
