[Killed] PublicVisibility
manager/application/wordManaging/WordRemover.php:19:5
     }
 
 
-    public function handle(DeleteWord $command): void
+    protected function handle(DeleteWord $command): void
     {
         $this->writer->remove($command->getId(), vocabularyType: VocabularyType::word);
killedBy: norsk\api\manager\application\wordManaging\WordRemoverTest::testCanHandleDeleteWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordRemoverTest::testCanHandleDeleteWord
Error: Call to protected method norsk\api\manager\application\wordManaging\WordRemover::handle() from scope norsk\api\manager\application\wordManaging\WordRemoverTest

/app/api/tests/unit/manager/application/wordManaging/WordRemoverTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/wordManaging/WordRemover.php:21:9
 
     public function handle(DeleteWord $command): void
     {
-        $this->writer->remove($command->getId(), vocabularyType: VocabularyType::word);
+        
     }
 }
killedBy: norsk\api\manager\application\wordManaging\WordRemoverTest::testCanHandleDeleteWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordRemoverTest::testCanHandleDeleteWord
Expectation failed for method name is "getId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
