[Killed] PublicVisibility
manager/application/wordManaging/WordUpdater.php:21:5
     }
 
 
-    public function handle(UpdateWord $command): void
+    protected function handle(UpdateWord $command): void
     {
         $id = $command->getId();
killedBy: norsk\api\manager\application\wordManaging\WordUpdaterTest::testCanHandleCreateWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordUpdaterTest::testCanHandleCreateWord
Error: Call to protected method norsk\api\manager\application\wordManaging\WordUpdater::handle() from scope norsk\api\manager\application\wordManaging\WordUpdaterTest

/app/api/tests/unit/manager/application/wordManaging/WordUpdaterTest.php:50

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
manager/application/wordManaging/WordUpdater.php:35:9
             $norsk
         );
 
-        $this->writer->update($managedWord);
+        
     }
 }
killedBy: norsk\api\manager\application\wordManaging\WordUpdaterTest::testCanHandleCreateWord
statusReason: 1) norsk\api\manager\application\wordManaging\WordUpdaterTest::testCanHandleCreateWord
Expectation failed for method name is "update" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
