[Killed] PublicVisibility
manager/application/wordManaging/WordsProvider.php:19:5
     }
 
 
-    public function handle(GetAllWords $command): Vocabularies
+    protected function handle(GetAllWords $command): Vocabularies
     {
         return $this->wordReader->getAllWords();
killedBy: norsk\api\manager\application\wordManaging\WordsProviderTest::testCanHandleGetAllWords
statusReason: 1) norsk\api\manager\application\wordManaging\WordsProviderTest::testCanHandleGetAllWords
Error: Call to protected method norsk\api\manager\application\wordManaging\WordsProvider::handle() from scope norsk\api\manager\application\wordManaging\WordsProviderTest

/app/api/tests/unit/manager/application/wordManaging/WordsProviderTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
