[Killed] PublicVisibility
manager/domain/Identifier.php:18:5
     }
 
 
-    public static function fromId(Id $id): self
+    protected static function fromId(Id $id): self
     {
         return new self($id->asString());
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Error: Call to protected method norsk\api\manager\domain\Identifier::fromId() from scope norsk\api\manager\domain\IdentifierTest

/app/api/tests/unit/manager/domain/IdentifierTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
manager/domain/Identifier.php:24:5
     }
 
 
-    public static function fromVocabulary(German $german, Norsk $norsk): self
+    protected static function fromVocabulary(German $german, Norsk $norsk): self
     {
         return new self($german->asString() . ' | ' . $norsk->asString());
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
Error: Call to protected method norsk\api\manager\domain\Identifier::fromVocabulary() from scope norsk\api\manager\domain\IdentifierTest

/app/api/tests/unit/manager/domain/IdentifierTest.php:32

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] ConcatOperandRemoval
manager/domain/Identifier.php:26:9
 
     public static function fromVocabulary(German $german, Norsk $norsk): self
     {
-        return new self($german->asString() . ' | ' . $norsk->asString());
+        return new self($german->asString() . $norsk->asString());
     }
 
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'identifier | identifikator'
+'identifieridentifikator'

[Killed] Concat
manager/domain/Identifier.php:26:9
 
     public static function fromVocabulary(German $german, Norsk $norsk): self
     {
-        return new self($german->asString() . ' | ' . $norsk->asString());
+        return new self($german->asString() . $norsk->asString() . ' | ');
     }
 
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromVocabulary
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'identifier | identifikator'
+'identifieridentifikator | '

[Killed] PublicVisibility
manager/domain/Identifier.php:30:5
     }
 
 
-    public function asMessageString(): string
+    protected function asMessageString(): string
     {
         return $this->addPrefixToId() . $this->asString();
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Error: Call to protected method norsk\api\manager\domain\Identifier::asMessageString() from scope norsk\api\manager\domain\IdentifierTest

/app/api/tests/unit/manager/domain/IdentifierTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
manager/domain/Identifier.php:32:9
 
     public function asMessageString(): string
     {
-        return $this->addPrefixToId() . $this->asString();
+        return $this->addPrefixToId();
     }
 
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'id: 3'
+'id: '

[Killed] ConcatOperandRemoval
manager/domain/Identifier.php:32:9
 
     public function asMessageString(): string
     {
-        return $this->addPrefixToId() . $this->asString();
+        return $this->asString();
     }
 
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'id: 3'
+'3'

[Killed] IfNegation
manager/domain/Identifier.php:38:9
 
     private function addPrefixToId(): string
     {
-        if (is_numeric($this->identifier)) {
-            return 'id: ';
-        }
+        if (!is_numeric($this->identifier)) {
 
         return '';
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'id: 3'
+'3'

[Killed] ReturnRemoval
manager/domain/Identifier.php:39:13
     private function addPrefixToId(): string
     {
         if (is_numeric($this->identifier)) {
-            return 'id: ';
+            
         }
 
killedBy: norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
statusReason: 1) norsk\api\manager\domain\IdentifierTest::testCanBeUsedAsStringFromId
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'id: 3'
+'3'
