[Killed] MethodCallRemoval
manager/domain/exceptions/GermanRecordAlreadyInDatabaseException.php:16:9
 {
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
-        parent::__construct(
-            'German ' . $vocabularyType->value . ' already exists for ' . $identifier->asMessageString(),
-            ResponseCode::conflict->value
-        );
+        
     }
 }
statusReason: 1) norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'German word already exists for testIdentifier'
+''

[Killed] ConcatOperandRemoval
manager/domain/exceptions/GermanRecordAlreadyInDatabaseException.php:17:13
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
         parent::__construct(
-            'German ' . $vocabularyType->value . ' already exists for ' . $identifier->asMessageString(),
+            parent::__construct('German ' . $vocabularyType->value . $identifier->asMessageString(), ResponseCode::conflict->value);
             ResponseCode::conflict->value
         );
statusReason: 1) norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'German word already exists for testIdentifier'
+'German wordtestIdentifier'

[Killed] ConcatOperandRemoval
manager/domain/exceptions/GermanRecordAlreadyInDatabaseException.php:17:13
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
         parent::__construct(
-            'German ' . $vocabularyType->value . ' already exists for ' . $identifier->asMessageString(),
+            parent::__construct('German ' . ' already exists for ' . $identifier->asMessageString(), ResponseCode::conflict->value);
             ResponseCode::conflict->value
         );
statusReason: 1) norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'German word already exists for testIdentifier'
+'German  already exists for testIdentifier'
