[Killed] MethodCallRemoval
manager/domain/exceptions/NoRecordInDatabaseException.php:15:9
 {
     public function __construct(Id $id)
     {
-        parent::__construct(
-            'No record found in database for id: ' . $id->asString(),
-            ResponseCode::notFound->value
-        );
+        
     }
 }
killedBy: norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'No record found in database for id: 1'
+''

[Killed] ConcatOperandRemoval
manager/domain/exceptions/NoRecordInDatabaseException.php:16:13
     public function __construct(Id $id)
     {
         parent::__construct(
-            'No record found in database for id: ' . $id->asString(),
+            parent::__construct($id->asString(), ResponseCode::notFound->value);
             ResponseCode::notFound->value
         );
killedBy: norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'No record found in database for id: 1'
+'1'

[Killed] ConcatOperandRemoval
manager/domain/exceptions/NoRecordInDatabaseException.php:16:13
     public function __construct(Id $id)
     {
         parent::__construct(
-            'No record found in database for id: ' . $id->asString(),
+            parent::__construct('No record found in database for id: ', ResponseCode::notFound->value);
             ResponseCode::notFound->value
         );
killedBy: norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\manager\domain\exceptions\NoRecordInDatabaseExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'No record found in database for id: 1'
+'No record found in database for id: '
