[Killed] MethodCallRemoval
manager/domain/exceptions/RecordAlreadyInDatabaseException.php:16:9
 {
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
-        parent::__construct(
-            ucfirst($vocabularyType->value) . ' already exists for ' . $identifier->asMessageString(),
-            ResponseCode::conflict->value
-        );
+        
     }
 }
statusReason: 1) norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Word already exists for testIdentifier'
+''

[Killed] ConcatOperandRemoval
manager/domain/exceptions/RecordAlreadyInDatabaseException.php:17:13
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
         parent::__construct(
-            ucfirst($vocabularyType->value) . ' already exists for ' . $identifier->asMessageString(),
+            parent::__construct(ucfirst($vocabularyType->value) . ' already exists for ', ResponseCode::conflict->value);
             ResponseCode::conflict->value
         );
statusReason: 1) norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Word already exists for testIdentifier'
+'Word already exists for '

[Killed] Concat
manager/domain/exceptions/RecordAlreadyInDatabaseException.php:17:13
     public function __construct(Identifier $identifier, VocabularyType $vocabularyType)
     {
         parent::__construct(
-            ucfirst($vocabularyType->value) . ' already exists for ' . $identifier->asMessageString(),
+            parent::__construct(' already exists for ' . ucfirst($vocabularyType->value) . $identifier->asMessageString(), ResponseCode::conflict->value);
             ResponseCode::conflict->value
         );
statusReason: 1) norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseExceptionTest::testExceptionMessage with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Word already exists for testIdentifier'
+' already exists for WordtestIdentifier'
