[Killed] PublicVisibility
manager/domain/verbs/ManagedVerb.php:29:5
     }
 
 
-    public static function createNew(
+    protected static function createNew(German $german, Norsk $norsk, Norsk $norskPresent, Norsk $norskPast, Norsk $norskPastPerfect): self
         German $german,
         Norsk $norsk,
killedBy: norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
statusReason: 1) norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
Error: Call to protected method norsk\api\manager\domain\verbs\ManagedVerb::createNew() from scope norsk\api\manager\domain\verbs\ManagedVerbTest

/app/api/tests/unit/manager/domain/verbs/ManagedVerbTest.php:43

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
manager/domain/verbs/ManagedVerb.php:47:5
     }
 
 
-    public static function fromPersistence(
+    protected static function fromPersistence(Id $id, German $german, Norsk $norsk, Norsk $norskPresent, Norsk $norskPast, Norsk $norskPastPerfect): self
         Id $id,
         German $german,
killedBy: norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
statusReason: 1) norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
Error: Call to protected method norsk\api\manager\domain\verbs\ManagedVerb::fromPersistence() from scope norsk\api\tests\provider\VerbProvider

/app/api/tests/provider/VerbProvider.php:52
/app/api/tests/provider/VerbProvider.php:46
/app/api/tests/unit/manager/domain/verbs/ManagedVerbTest.php:32

ERRORS!

[Killed] Identical
manager/domain/verbs/ManagedVerb.php:68:9
 
     public function getId(): Id
     {
-        if ($this->id === null) {
+        if ($this->id !== null) {
             throw new LogicException('Cannot access Id of a non-persisted ManagedVerb.');
         }
killedBy: norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
statusReason: 1) norsk\api\manager\domain\verbs\ManagedVerbTest::testCanCreateFromPersisted
LogicException: Cannot access Id of a non-persisted ManagedVerb.

/app/api/src/manager/domain/verbs/ManagedVerb.php:30
/app/api/tests/unit/manager/domain/verbs/ManagedVerbTest.php:58

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
manager/domain/verbs/ManagedVerb.php:69:13
     public function getId(): Id
     {
         if ($this->id === null) {
-            throw new LogicException('Cannot access Id of a non-persisted ManagedVerb.');
+            new LogicException('Cannot access Id of a non-persisted ManagedVerb.');
         }
 
killedBy: norsk\api\manager\domain\verbs\ManagedVerbTest::testThrowsExceptionIfGetIdWouldNotBeDefined
statusReason: 1) norsk\api\manager\domain\verbs\ManagedVerbTest::testThrowsExceptionIfGetIdWouldNotBeDefined
Failed asserting that exception of type "TypeError" matches expected exception "LogicException". Message was: "norsk\api\manager\domain\verbs\ManagedVerb::getId(): Return value must be of type norsk\api\shared\domain\Id, null returned" at
/app/api/src/manager/domain/verbs/ManagedVerb.php:32
/app/api/test

[Killed] MethodCallRemoval
manager/domain/verbs/ManagedVerb.php:93:9
 
     public function persistWith(VocabularyPersistencePort $writer): void
     {
-        $writer->saveNewVerb($this);
+        
     }
 
killedBy: norsk\api\manager\domain\verbs\ManagedVerbTest::testPersistWithVocabPersistencePort
statusReason: 1) norsk\api\manager\domain\verbs\ManagedVerbTest::testPersistWithVocabPersistencePort
Expectation failed for method name is "saveNewVerb" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 8, Assertions: 8, Failures: 1.
