[Killed] PublicVisibility
manager/domain/words/ManagedWord.php:26:5
     }
 
 
-    public static function createNew(German $german, Norsk $norsk): self
+    protected static function createNew(German $german, Norsk $norsk): self
     {
         return new self(
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testCanCreateFromPersisted
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testCanCreateFromPersisted
Error: Call to protected method norsk\api\manager\domain\words\ManagedWord::createNew() from scope norsk\api\manager\domain\words\ManagedWordTest

/app/api/tests/unit/manager/domain/words/ManagedWordTest.php:41

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
manager/domain/words/ManagedWord.php:36:5
     }
 
 
-    public static function fromPersistence(Id $id, German $german, Norsk $norsk): self
+    protected static function fromPersistence(Id $id, German $german, Norsk $norsk): self
     {
         return new self($id, $german, $norsk);
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testCanCreateFromPersisted
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testCanCreateFromPersisted
Error: Call to protected method norsk\api\manager\domain\words\ManagedWord::fromPersistence() from scope norsk\api\tests\provider\WordProvider

/app/api/tests/provider/WordProvider.php:43
/app/api/tests/provider/WordProvider.php:37
/app/api/tests/unit/manager/domain/words/ManagedWordTest.php:33

ERRORS!

[Killed] Throw_
manager/domain/words/ManagedWord.php:45:13
     public function getId(): Id
     {
         if ($this->id === null) {
-            throw new LogicException('Cannot access Id of a non-persisted ManagedWord.');
+            new LogicException('Cannot access Id of a non-persisted ManagedWord.');
         }
 
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testThrowsExceptionIfGetIdWouldNotBeDefined
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testThrowsExceptionIfGetIdWouldNotBeDefined
Failed asserting that exception of type "TypeError" matches expected exception "LogicException". Message was: "norsk\api\manager\domain\words\ManagedWord::getId(): Return value must be of type norsk\api\shared\domain\Id, null returned" at
/app/api/src/manager/domain/words/ManagedWord.php:32
/app/api/test

[Killed] ArrayItemRemoval
manager/domain/words/ManagedWord.php:54:9
 
     public function asJson(): Json
     {
-        $jsonArray = [
-            'id' => $this->id->asInt(),
-            'german' => $this->german->asString(),
-            'norsk' => $this->norsk->asString(),
-        ];
+        $jsonArray = ['german' => $this->german->asString(), 'norsk' => $this->norsk->asString()];
 
         return Json::encodeFromArray($jsonArray);
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\application\Json Object (
-    'content' => '{"id":1,"german":"Sch\u00e4renk\u...'
+    'content' => '{"german":"Sch\u00e4renk\u...'

[Killed] ArrayItem
manager/domain/words/ManagedWord.php:55:13
     public function asJson(): Json
     {
         $jsonArray = [
-            'id' => $this->id->asInt(),
+            $jsonArray = ['id' > $this->id->asInt(), 'german' => $this->german->asString(), 'norsk' => $this->norsk->asString()];
             'german' => $this->german->asString(),
             'norsk' => $this->norsk->asString(),
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\application\Json Object (
-    'content' => '{"id":1,"german":"Sch\u00e4renk\...'
+    'content' => '{"0":true,"german":"Sch\u00e4renk\...'

[Killed] ArrayItem
manager/domain/words/ManagedWord.php:56:13
     {
         $jsonArray = [
             'id' => $this->id->asInt(),
-            'german' => $this->german->asString(),
+            $jsonArray = ['id' => $this->id->asInt(), 'german' > $this->german->asString(), 'norsk' => $this->norsk->asString()];
             'norsk' => $this->norsk->asString(),
         ];
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testCanGetAsJson
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\application\Json Object (
-    'content' => '{"id":1,"german":"Sch\u00e4renk\u00fcste","norsk":"skj\u00e6rg\u00e5rd"}'
+    'content' => '{"id":1,"0":true,"norsk":"skj\u00e6rg\u00e5rd"}'

[Killed] MethodCallRemoval
manager/domain/words/ManagedWord.php:66:9
 
     public function persistWith(VocabularyPersistencePort $writer): void
     {
-        $writer->saveNewWord($this);
+        
     }
 
killedBy: norsk\api\manager\domain\words\ManagedWordTest::testPersistWithVocabPersistencePort
statusReason: 1) norsk\api\manager\domain\words\ManagedWordTest::testPersistWithVocabPersistencePort
Expectation failed for method name is "saveNewWord" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.
