[Killed] PublicVisibility
manager/infrastructure/ManagerFactory.php:36:5
     }
 
 
-    public function wordManager(): WordManager
+    protected function wordManager(): WordManager
     {
         $reader = new WordReader($this->dbConnection);
killedBy: norsk\api\manager\infrastructure\ManagerFactoryTest::testCreatesWordManager
statusReason: 1) norsk\api\manager\infrastructure\ManagerFactoryTest::testCreatesWordManager
Error: Call to protected method norsk\api\manager\infrastructure\ManagerFactory::wordManager() from scope norsk\api\manager\infrastructure\ManagerFactoryTest

/app/api/tests/unit/manager/infrastructure/ManagerFactoryTest.php:34

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
manager/infrastructure/ManagerFactory.php:53:5
     }
 
 
-    public function verbManager(): VerbManager
+    protected function verbManager(): VerbManager
     {
         $reader = new VerbReader($this->dbConnection);
killedBy: norsk\api\manager\infrastructure\ManagerFactoryTest::testCreatesVerbManager
statusReason: 1) norsk\api\manager\infrastructure\ManagerFactoryTest::testCreatesVerbManager
Error: Call to protected method norsk\api\manager\infrastructure\ManagerFactory::verbManager() from scope norsk\api\manager\infrastructure\ManagerFactoryTest

/app/api/tests/unit/manager/infrastructure/ManagerFactoryTest.php:42

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
