[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:48:9
 
     public function add(ManagingVocabulary $vocabulary): void
     {
-        $vocabulary->persistWith($this);
+        
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:56:9
     {
         $params = $this->addGermanAndNorskInfinitive($word->getGerman(), $word->getNorsk());
 
-        $this->dbConnector->execute(
-            $this->addingWordsSql,
-            $params
-        );
+        
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:66:9
     private function addGermanAndNorskInfinitive(German $german, Norsk $norsk): Parameters
     {
         $params = Parameters::init();
-        $params->addString($german->asString());
+        
         $params->addString($norsk->asString());
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\persistence\Parameters Object (

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:67:9
     {
         $params = Parameters::init();
         $params->addString($german->asString());
-        $params->addString($norsk->asString());
+        
 
         return $params;
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddWord
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\persistence\Parameters Object (

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:77:9
     {
         $params = $this->addVerbToParams($verb);
 
-        $this->dbConnector->execute(
-            $this->addingVerbsSql,
-            $params
-        );
+        
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:87:9
     private function addVerbToParams(ManagedVerb $vocabulary): Parameters
     {
         $params = $this->addGermanAndNorskInfinitive($vocabulary->getGerman(), $vocabulary->getNorsk());
-        $params->addString($vocabulary->getNorskPresent()->asString());
+        
         $params->addString($vocabulary->getNorskPast()->asString());
         $params->addString($vocabulary->getNorskPastPerfect()->asString());
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
     'value' => Array (

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:88:9
     {
         $params = $this->addGermanAndNorskInfinitive($vocabulary->getGerman(), $vocabulary->getNorsk());
         $params->addString($vocabulary->getNorskPresent()->asString());
-        $params->addString($vocabulary->getNorskPast()->asString());
+        
         $params->addString($vocabulary->getNorskPastPerfect()->asString());
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
         0 => 'gehen'

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:89:9
         $params = $this->addGermanAndNorskInfinitive($vocabulary->getGerman(), $vocabulary->getNorsk());
         $params->addString($vocabulary->getNorskPresent()->asString());
         $params->addString($vocabulary->getNorskPast()->asString());
-        $params->addString($vocabulary->getNorskPastPerfect()->asString());
+        
 
         return $params;
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanAddVerb
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
         1 => 'gå'

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:99:9
     {
         $changedRows = $vocabulary->updateWith($this);
 
-        $this->ensureIdToChangeWasInDatabase($changedRows, $vocabulary->getId());
+        
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToUpdateWasFound
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToUpdateWasFound
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 5, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:106:9
     public function saveEditedWord(ManagedWord $word): AffectedRows
     {
         $params = $this->addGermanAndNorskInfinitive($word->getGerman(), $word->getNorsk());
-        $params->addInt($word->getId()->asInt());
+        
 
         return $this->dbConnector->execute(
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateWord
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
     'value' => Array (

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:118:9
     public function saveEditedVerb(ManagedVerb $verb): AffectedRows
     {
         $params = $this->addVerbToParams($verb);
-        $params->addInt($verb->getId()->asInt());
+        
 
         return $this->dbConnector->execute(
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateVerb
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateVerb
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
         2 => 'går'

[Killed] IfNegation
manager/infrastructure/persistence/ManagerWriter.php:129:9
 
     private function ensureIdToChangeWasInDatabase(AffectedRows $changedRows, Id $id): void
     {
-        if ($changedRows->notAtLeastOne()) {
-            throw new NoRecordInDatabaseException($id);
-        }
+        if (!$changedRows->notAtLeastOne()) {
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanUpdateWord
norsk\api\manager\domain\exceptions\NoRecordInDatabaseException: No record found in database for id: 3

/app/api/src/manager/infrastructure/persistence/ManagerWriter.php:86
/app/api/src/manager/infrastructure/persistence/ManagerWriter.php:69
/app/api/tests/unit/manager/infrastructure/persistence/ManagerWriterTest.

[Killed] Throw_
manager/infrastructure/persistence/ManagerWriter.php:130:13
     private function ensureIdToChangeWasInDatabase(AffectedRows $changedRows, Id $id): void
     {
         if ($changedRows->notAtLeastOne()) {
-            throw new NoRecordInDatabaseException($id);
+            new NoRecordInDatabaseException($id);
         }
     }
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToUpdateWasFound
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToUpdateWasFound
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 5, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:138:9
     public function remove(Id $id, VocabularyType $vocabularyType): void
     {
         $params = Parameters::init();
-        $params->addInt($id->asInt());
+        
 
         $changedRows = $this->dbConnector->execute(
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanRemoveWord
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testCanRemoveWord
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\persistence\Parameters Object (

[Killed] MethodCallRemoval
manager/infrastructure/persistence/ManagerWriter.php:145:9
             $params
         );
 
-        $this->ensureIdToChangeWasInDatabase($changedRows, $id);
+        
     }
 }
killedBy: norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToDeleteWasFound
statusReason: 1) norsk\api\manager\infrastructure\persistence\ManagerWriterTest::testThrowsExceptionIfNoWordToDeleteWasFound
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 8, Assertions: 27, Failures: 1.
