[Survived] MethodCallRemoval
manager/infrastructure/persistence/SqlUniquenessPolicy.php:35:9
         $alreadyExistingGermanSql = LookForExistingGermanVocabularySql::create($this->vocabularyType, $id);
         $germanResult = $this->dbConnector->getResult($alreadyExistingGermanSql, $params);
 
-        $params->addString($norsk->asString());
+        
         $alreadyExistingTupleSql = LookForExistingGermanAndNorskVocabularyTupleSql::create($this->vocabularyType, $id);
         $tupleResult = $this->dbConnector->getResult(

[Killed] MethodCallRemoval
manager/infrastructure/persistence/SqlUniquenessPolicy.php:43:9
         );
 
         $identifier = $this->getIdentifier($id, $german, $norsk);
-        $this->ensureVocabularyTupleIsUnique($tupleResult, $identifier);
+        
         $this->ensureGermanIsUnique($germanResult, $identifier);
     }
killedBy: norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfWordTupleIsNotUnique
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfWordTupleIsNotUnique
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseException" matches expected exception "norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseException". Message was: "German word already exists for id: 1" at
/app/api/src/m

[Killed] MethodCallRemoval
manager/infrastructure/persistence/SqlUniquenessPolicy.php:44:9
 
         $identifier = $this->getIdentifier($id, $german, $norsk);
         $this->ensureVocabularyTupleIsUnique($tupleResult, $identifier);
-        $this->ensureGermanIsUnique($germanResult, $identifier);
+        
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] InstanceOf_
manager/infrastructure/persistence/SqlUniquenessPolicy.php:50:9
 
     private function getIdentifier(?Id $id, German $german, Norsk $norsk): Identifier
     {
-        if ($id instanceof Id) {
+        if (!$id instanceof Id) {
             return Identifier::fromId($id);
         }
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testCanEnsureVocabsAreNotAlreadyPersisted with data set "verb without id" (norsk\api\shared\domain\VocabularyType Enum (verb, 'verb'), null)
TypeError: norsk\api\manager\domain\Identifier::fromId(): Argument #1 ($id) must be of type norsk\api\shared\domain\Id, null given, called in /app/api/src/manager/infrastructure/persiste

[Killed] ReturnRemoval
manager/infrastructure/persistence/SqlUniquenessPolicy.php:51:13
     private function getIdentifier(?Id $id, German $german, Norsk $norsk): Identifier
     {
         if ($id instanceof Id) {
-            return Identifier::fromId($id);
+            
         }
 
killedBy: norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
Failed asserting that exception message 'German word already exists for Wort | ord' contains 'German word already exists for id: 1'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] IfNegation
manager/infrastructure/persistence/SqlUniquenessPolicy.php:60:9
 
     private function ensureVocabularyTupleIsUnique(SqlResult $tupleResult, Identifier $identifier): void
     {
-        if ($tupleResult->hasEntries()) {
-            throw new RecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
-        }
+        if (!$tupleResult->hasEntries()) {
     }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testCanEnsureVocabsAreNotAlreadyPersisted with data set "word with id" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'), norsk\api\shared\domain\Id Object (...))
norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseException: Word already exists for id: 1

/app/api/src/manager/infrastructure/persistence/SqlUn

[Killed] Throw_
manager/infrastructure/persistence/SqlUniquenessPolicy.php:61:13
     private function ensureVocabularyTupleIsUnique(SqlResult $tupleResult, Identifier $identifier): void
     {
         if ($tupleResult->hasEntries()) {
-            throw new RecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
+            new RecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
         }
     }
killedBy: norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfWordTupleIsNotUnique
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfWordTupleIsNotUnique
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseException" matches expected exception "norsk\api\manager\domain\exceptions\RecordAlreadyInDatabaseException". Message was: "German word already exists for id: 1" at
/app/api/src/m

[Killed] IfNegation
manager/infrastructure/persistence/SqlUniquenessPolicy.php:68:9
 
     private function ensureGermanIsUnique(SqlResult $germanResult, Identifier $identifier): void
     {
-        if ($germanResult->hasEntries()) {
-            throw new GermanRecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
-        }
+        if (!$germanResult->hasEntries()) {
     }
 }
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testCanEnsureVocabsAreNotAlreadyPersisted with data set "word with id" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'), norsk\api\shared\domain\Id Object (...))
norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseException: German word already exists for id: 1

/app/api/src/manager/infrastructure/pers

[Killed] Throw_
manager/infrastructure/persistence/SqlUniquenessPolicy.php:69:13
     private function ensureGermanIsUnique(SqlResult $germanResult, Identifier $identifier): void
     {
         if ($germanResult->hasEntries()) {
-            throw new GermanRecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
+            new GermanRecordAlreadyInDatabaseException($identifier, $this->vocabularyType);
         }
     }
killedBy: norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
statusReason: 1) norsk\api\manager\infrastructure\persistence\SqlUniquenessPolicyTest::testThrowsExceptionIfGermanIsUnique
Failed asserting that exception of type "norsk\api\manager\domain\exceptions\GermanRecordAlreadyInDatabaseException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.
