[Killed] MethodCallRemoval
manager/infrastructure/persistence/VerbReader.php:40:9
             $params
         );
 
-        $this->ensureDatabaseHasAnyVerbs($result);
+        
 
         $verbs = Vocabularies::create();
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllVerbs
Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.

[Killed] Foreach_
manager/infrastructure/persistence/VerbReader.php:43:9
         $this->ensureDatabaseHasAnyVerbs($result);
 
         $verbs = Vocabularies::create();
-        foreach ($result as $verbRecord) {
-            $word = ManagedVerb::fromPersistence(
-                Id::by($verbRecord['id']),
-                German::of($verbRecord['german']),
-                Norsk::of($verbRecord['norsk']),
-                Norsk::of($verbRecord['norsk_present']),
-                Norsk::of($verbRecord['norsk_past']),
-                Norsk::of($verbRecord['norsk_past_perfekt'])
-            );
-            $verbs->add($word);
-        }
+        foreach ([] as $verbRecord) {
 
         return $verbs;
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\domain\Vocabularies Object (
     'vocabularies' => Array (
-        0 => norsk\api\manager\domain\verbs\ManagedVerb Object (...)

[Killed] MethodCallRemoval
manager/infrastructure/persistence/VerbReader.php:52:13
                 Norsk::of($verbRecord['norsk_past']),
                 Norsk::of($verbRecord['norsk_past_perfekt'])
             );
-            $verbs->add($word);
+            
         }
 
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\domain\Vocabularies Object (
     'vocabularies' => Array (
-        0 => norsk\api\manager\domain\verbs\ManagedVerb Object (...)

[Killed] LessThanNegotiation
manager/infrastructure/persistence/VerbReader.php:61:9
 
     private function ensureDatabaseHasAnyVerbs(SqlResult $result): void
     {
-        if ($result->count() < 1) {
+        if ($result->count() >= 1) {
             throw new NoRecordInDatabaseException(
                 'No records found in database for: verbs',
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException: No records found in database for: verbs

/app/api/src/manager/infrastructure/persistence/VerbReader.php:40
/app/api/src/manager/infrastructure/persistence/VerbReader.php:29
/app/api/tests/unit/manager/infrastructure/persistence/VerbReaderTest.php:49

E

[Killed] LessThan
manager/infrastructure/persistence/VerbReader.php:61:9
 
     private function ensureDatabaseHasAnyVerbs(SqlResult $result): void
     {
-        if ($result->count() < 1) {
+        if ($result->count() <= 1) {
             throw new NoRecordInDatabaseException(
                 'No records found in database for: verbs',
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testCanGetAllVerbs
norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException: No records found in database for: verbs

/app/api/src/manager/infrastructure/persistence/VerbReader.php:40
/app/api/src/manager/infrastructure/persistence/VerbReader.php:29
/app/api/tests/unit/manager/infrastructure/persistence/VerbReaderTest.php:49

E

[Killed] Throw_
manager/infrastructure/persistence/VerbReader.php:62:13
     private function ensureDatabaseHasAnyVerbs(SqlResult $result): void
     {
         if ($result->count() < 1) {
-            throw new NoRecordInDatabaseException(
-                'No records found in database for: verbs',
-                ResponseCode::serverError->value
-            );
+            new NoRecordInDatabaseException('No records found in database for: verbs', ResponseCode::serverError->value);
         }
     }
killedBy: norsk\api\manager\infrastructure\persistence\VerbReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\persistence\VerbReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllVerbs
Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.
