[Killed] MethodCallRemoval
manager/infrastructure/persistence/WordReader.php:40:9
             $params
         );
 
-        $this->ensureDatabaseHasAnyWords($result);
+        
 
         $words = Vocabularies::create();
killedBy: norsk\api\manager\infrastructure\persistence\WordReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\persistence\WordReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllWords
Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.

[Killed] Foreach_
manager/infrastructure/persistence/WordReader.php:43:9
         $this->ensureDatabaseHasAnyWords($result);
 
         $words = Vocabularies::create();
-        foreach ($result as $wordRecord) {
-            $word = ManagedWord::fromPersistence(
-                Id::by($wordRecord['id']),
-                German::of($wordRecord['german']),
-                Norsk::of($wordRecord['norsk'])
-            );
-            $words->add($word);
-        }
+        foreach ([] as $wordRecord) {
 
         return $words;
killedBy: norsk\api\manager\infrastructure\persistence\WordReaderTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\persistence\WordReaderTest::testCanGetAllWords
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\domain\Vocabularies Object (
     'vocabularies' => Array (
-        0 => norsk\api\manager\domain\words\ManagedWord Object (...)

[Killed] MethodCallRemoval
manager/infrastructure/persistence/WordReader.php:49:13
                 German::of($wordRecord['german']),
                 Norsk::of($wordRecord['norsk'])
             );
-            $words->add($word);
+            
         }
 
killedBy: norsk\api\manager\infrastructure\persistence\WordReaderTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\persistence\WordReaderTest::testCanGetAllWords
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\shared\domain\Vocabularies Object (
     'vocabularies' => Array (
-        0 => norsk\api\manager\domain\words\ManagedWord Object (...)

[Killed] Throw_
manager/infrastructure/persistence/WordReader.php:59:13
     private function ensureDatabaseHasAnyWords(SqlResult $result): void
     {
         if ($result->count() < 1) {
-            throw new NoRecordInDatabaseException(
-                'No records found in database for: words',
-                ResponseCode::serverError->value
-            );
+            new NoRecordInDatabaseException('No records found in database for: words', ResponseCode::serverError->value);
         }
     }
killedBy: norsk\api\manager\infrastructure\persistence\WordReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\persistence\WordReaderTest::testThrowsExceptionIfNoRecordsAreFoundWhileTryingToGetAllWords
Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.
