[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:18:9
 
     private function __construct(VocabularyType $vocabularyType, ?Id $optionalId)
     {
-        $table = $vocabularyType->value . 's';
+        $table = 's';
         $addIdMatch = $this->addId($optionalId);
         $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ?;'
+'SELECT COU

[Killed] Concat
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:18:9
 
     private function __construct(VocabularyType $vocabularyType, ?Id $optionalId)
     {
-        $table = $vocabularyType->value . 's';
+        $table = 's' . $vocabularyType->value;
         $addIdMatch = $this->addId($optionalId);
         $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ?;'
+'SELECT COU

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:20:9
     {
         $table = $vocabularyType->value . 's';
         $addIdMatch = $this->addId($optionalId);
-        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
-                     . ' WHERE BINARY german = ? AND norsk = ?'
-                     . $addIdMatch . ';';
+        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table . ' WHERE BINARY german = ? AND norsk = ?' . ';';
     }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ? AND id != 3;'
+'S

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:20:9
     {
         $table = $vocabularyType->value . 's';
         $addIdMatch = $this->addId($optionalId);
-        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
+        $this->sql = $table . ' WHERE BINARY german = ? AND norsk = ?' . $addIdMatch . ';';
                      . ' WHERE BINARY german = ? AND norsk = ?'
                      . $addIdMatch . ';';
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ?;'
+'words WHER

[Killed] InstanceOf_
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:29:9
     private function addId(?Id $optionalId): string
     {
         $addIdMatch = '';
-        if ($optionalId instanceof Id) {
+        if (!$optionalId instanceof Id) {
             $addIdMatch = ' AND id != ' . $optionalId->asInt();
         }
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Error: Call to a member function asInt() on null

/app/api/src/manager/infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:22
/app/api/src/mana

[Killed] Concat
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:30:13
     {
         $addIdMatch = '';
         if ($optionalId instanceof Id) {
-            $addIdMatch = ' AND id != ' . $optionalId->asInt();
+            $addIdMatch = $optionalId->asInt() . ' AND id != ';
         }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ? AND id != 3;'
+'S

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:30:13
     {
         $addIdMatch = '';
         if ($optionalId instanceof Id) {
-            $addIdMatch = ' AND id != ' . $optionalId->asInt();
+            $addIdMatch = ' AND id != ';
         }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND norsk = ? AND id != 3;'
+'S

[Killed] PublicVisibility
infrastructure/persistence/queries/LookForExistingGermanAndNorskVocabularyTupleSql.php:37:5
     }
 
 
-    public static function create(VocabularyType $vocabularyType, ?Id $optionalId): self
+    protected static function create(VocabularyType $vocabularyType, ?Id $optionalId): self
     {
         return new self($vocabularyType, $optionalId);
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Error: Call to protected method norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanAndNorskVocabularyTupleSql::create() from scope norsk\api\manager\infras
