[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanVocabularySql.php:18:9
 
     private function __construct(VocabularyType $vocabularyType, ?Id $optionalId)
     {
-        $table = $vocabularyType->value . 's';
+        $table = $vocabularyType->value;
         $addIdMatch = $this->addId($optionalId);
         $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanVocabularySqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ?;'
+'SELECT COUNT("german") AS "match" FRO

[Killed] Concat
infrastructure/persistence/queries/LookForExistingGermanVocabularySql.php:20:9
     {
         $table = $vocabularyType->value . 's';
         $addIdMatch = $this->addId($optionalId);
-        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
-                     . ' WHERE BINARY german = ?'
+        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . ' WHERE BINARY german = ?' . $table . $addIdMatch . ';';
                      . $addIdMatch . ';';
     }
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanVocabularySqlTest::testCanBeUsedAsStringWithoutId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ?;'
+'SELECT COUNT("german") AS "match" FRO

[Killed] Concat
infrastructure/persistence/queries/LookForExistingGermanVocabularySql.php:20:9
     {
         $table = $vocabularyType->value . 's';
         $addIdMatch = $this->addId($optionalId);
-        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table
-                     . ' WHERE BINARY german = ?'
-                     . $addIdMatch . ';';
+        $this->sql = 'SELECT COUNT("german") AS "match" FROM ' . $table . ' WHERE BINARY german = ?' . ';' . $addIdMatch;
     }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanVocabularySqlTest::testCanBeUsedAsStringWithId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT COUNT("german") AS "match" FROM words WHERE BINARY german = ? AND id != 3;'
+'SELECT COUNT("german") AS "m

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/LookForExistingGermanVocabularySql.php:30:13
     {
         $addIdMatch = '';
         if ($optionalId instanceof Id) {
-            $addIdMatch = ' AND id != ' . $optionalId->asInt();
+            $addIdMatch = $optionalId->asInt();
         }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanVocabularySqlTest::testCanBeUsedAsStringWithId with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
TypeError: norsk\api\manager\infrastructure\persistence\queries\LookForExistingGermanVocabularySql::addId(): Return value must be of type string, int returned

/app/api/src/manager/infrastructur
