[Killed] Concat
infrastructure/persistence/queries/RemoveVocabularySql.php:18:9
     private function __construct(VocabularyType $vocabularyType)
     {
         $table = $vocabularyType->value . 's';
-        $this->sql = 'UPDATE `' . $table . '` SET `active`=0 WHERE `id`=?;';
+        $this->sql = 'UPDATE `' . '` SET `active`=0 WHERE `id`=?;' . $table;
     }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\RemoveVocabularySqlTest::testCanBeUsedAsString with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `words` SET `active`=0 WHERE `id`=?;'
+'UPDATE `` SET `active`=0 WHERE `id`=?;words'

[Killed] Concat
infrastructure/persistence/queries/RemoveVocabularySql.php:18:9
     private function __construct(VocabularyType $vocabularyType)
     {
         $table = $vocabularyType->value . 's';
-        $this->sql = 'UPDATE `' . $table . '` SET `active`=0 WHERE `id`=?;';
+        $this->sql = $table . 'UPDATE `' . '` SET `active`=0 WHERE `id`=?;';
     }
 
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\RemoveVocabularySqlTest::testCanBeUsedAsString with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `words` SET `active`=0 WHERE `id`=?;'
+'wordsUPDATE `` SET `active`=0 WHERE `id`=?;'

[Killed] PublicVisibility
infrastructure/persistence/queries/RemoveVocabularySql.php:22:5
     }
 
 
-    public static function create(VocabularyType $vocabularyType): self
+    protected static function create(VocabularyType $vocabularyType): self
     {
         return new self($vocabularyType);
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\RemoveVocabularySqlTest::testCanBeUsedAsString with data set "word" (norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Error: Call to protected method norsk\api\manager\infrastructure\persistence\queries\RemoveVocabularySql::create() from scope norsk\api\manager\infrastructure\persistence\queries\RemoveVocabularySqlTest

/app/api/te
