[Killed] ConcatOperandRemoval
persistence/queries/verbs/AddingVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) '
-                     . 'VALUES (?, ?, ?, ?, ?);';
+        $this->sql = 'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) ';
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\AddingVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\AddingVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) VALUES (?, ?, ?, ?, ?);'
+'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) '

[Killed] Concat
persistence/queries/verbs/AddingVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) '
-                     . 'VALUES (?, ?, ?, ?, ?);';
+        $this->sql = 'VALUES (?, ?, ?, ?, ?);' . 'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) ';
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\AddingVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\AddingVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt`) VALUES (?, ?, ?, ?, ?);'
+'VALUES (?, ?, ?, ?, ?);INSERT INTO `verbs` (`german`, `norsk`, `norsk_present`, `norsk_past`, `
