[Killed] ConcatOperandRemoval
persistence/queries/verbs/EditVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'UPDATE `verbs` SET `german`=?, `norsk`=? , '
-                     . '`norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? '
+        $this->sql = '`norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? ' . 'WHERE `id`=? AND `active`=1;';past_perfekt`=? '
                      . 'WHERE `id`=? AND `active`=1;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\EditVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\EditVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `verbs` SET `german`=?, `norsk`=? , `norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? WHERE `id`=? AND `active`=1;'
+'`norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? WHERE `id`=? AND `active`=

[Killed] ConcatOperandRemoval
persistence/queries/verbs/EditVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'UPDATE `verbs` SET `german`=?, `norsk`=? , '
-                     . '`norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? '
+        $this->sql = 'UPDATE `verbs` SET `german`=?, `norsk`=? , ' . 'WHERE `id`=? AND `active`=1;';past_perfekt`=? '
                      . 'WHERE `id`=? AND `active`=1;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\EditVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\EditVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `verbs` SET `german`=?, `norsk`=? , `norsk_present`=?, `norsk_past`=?, `norsk_past_perfekt`=? WHERE `id`=? AND `active`=1;'
+'UPDATE `verbs` SET `german`=?, `norsk`=? , WHERE `id`=? AND `active`=1;'
