[Killed] ConcatOperandRemoval
persistence/queries/verbs/GetAllVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt` FROM `verbs` '
-                     . 'WHERE `active`=1 '
+        $this->sql = 'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt` FROM `verbs` ' . 'ORDER BY `id` ASC;';
                      . 'ORDER BY `id` ASC;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\GetAlVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\GetAlVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt` FROM `verbs` WHERE `active`=1 ORDER BY `id` ASC;'
+'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfe

[Killed] ConcatOperandRemoval
persistence/queries/verbs/GetAllVerbsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt` FROM `verbs` '
-                     . 'WHERE `active`=1 '
+        $this->sql = 'WHERE `active`=1 ' . 'ORDER BY `id` ASC;';
                      . 'ORDER BY `id` ASC;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\GetAlVerbsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\GetAlVerbsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `id`, `german`, `norsk`, `norsk_present`, `norsk_past`, `norsk_past_perfekt` FROM `verbs` WHERE `active`=1 ORDER BY `id` ASC;'
+'WHERE `active`=1 ORDER BY `id` ASC;'
