[Killed] ConcatOperandRemoval
persistence/queries/words/EditWordsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'UPDATE `words` SET `german`=?, `norsk`=? '
-                     . 'WHERE `id`=? AND `active`=1;';
+        $this->sql = 'WHERE `id`=? AND `active`=1;';
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\EditWordsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\EditWordsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `words` SET `german`=?, `norsk`=? WHERE `id`=? AND `active`=1;'
+'WHERE `id`=? AND `active`=1;'

[Killed] Concat
persistence/queries/words/EditWordsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'UPDATE `words` SET `german`=?, `norsk`=? '
-                     . 'WHERE `id`=? AND `active`=1;';
+        $this->sql = 'WHERE `id`=? AND `active`=1;' . 'UPDATE `words` SET `german`=?, `norsk`=? ';
     }
 
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\EditWordsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\EditWordsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'UPDATE `words` SET `german`=?, `norsk`=? WHERE `id`=? AND `active`=1;'
+'WHERE `id`=? AND `active`=1;UPDATE `words` SET `german`=?, `norsk`=? '
