[Killed] ConcatOperandRemoval
persistence/queries/words/GetAllWordsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `id`, `german`, `norsk` FROM `words` '
-                     . 'WHERE `active`=1 '
+        $this->sql = 'WHERE `active`=1 ' . 'ORDER BY `id` ASC;';
                      . 'ORDER BY `id` ASC;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\GetAllWordsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\GetAllWordsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `id`, `german`, `norsk` FROM `words` WHERE `active`=1 ORDER BY `id` ASC;'
+'WHERE `active`=1 ORDER BY `id` ASC;'

[Killed] Concat
persistence/queries/words/GetAllWordsSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `id`, `german`, `norsk` FROM `words` '
-                     . 'WHERE `active`=1 '
+        $this->sql = 'WHERE `active`=1 ' . 'SELECT `id`, `german`, `norsk` FROM `words` ' . 'ORDER BY `id` ASC;';
                      . 'ORDER BY `id` ASC;';
     }
killedBy: norsk\api\manager\infrastructure\persistence\queries\words\GetAllWordsSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\manager\infrastructure\persistence\queries\words\GetAllWordsSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `id`, `german`, `norsk` FROM `words` WHERE `active`=1 ORDER BY `id` ASC;'
+'WHERE `active`=1 SELECT `id`, `german`, `norsk` FROM `words` ORDER BY `id` ASC;'
