[Killed] PublicVisibility
infrastructure/web/controller/VerbManager.php:47:5
     }
 
 
-    public function getAllVerbs(AuthenticatedUserInterface $user): ResponseInterface
+    protected function getAllVerbs(AuthenticatedUserInterface $user): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\VerbManager::getAllVerbs() from scope norsk\api\manager\infrastructure\web\controller\VerbManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:113

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:55:13
             $allVerbs = $this->verbsProvider->handle($command);
             $json = $allVerbs->asJson();
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Generated list of Verbs: ' . $json->asString()
-                    . ' by manager: ' . $userName->asString()
-                )
-            );
+            
 
             return VocabularyListResponse::create($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:57:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Generated list of Verbs: ' . $json->asString()
+                    $this->logger->info(LogMessage::fromString('Generated list of Verbs: ' . ' by manager: ' . $userName->asString()));
                     . ' by manager: ' . $userName->asString()
                 )
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:114

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:57:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Generated list of Verbs: ' . $json->asString()
-                    . ' by manager: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Generated list of Verbs: ' . $json->asString() . ' by manager: '));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:114

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbManager.php:62:13
                 )
             );
 
-            return VocabularyListResponse::create($this->url, $json);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanGetAllVerbs
TypeError: norsk\api\manager\infrastructure\web\controller\VerbManager::getAllVerbs(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/manager/infrastructure/web/controller/VerbManager.php:50
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.ph

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:64:13
 
             return VocabularyListResponse::create($this->url, $json);
         } catch (Throwable $throwable) {
-            $this->logger->error($throwable);
+            
 
             return ErrorResponse::serverError($this->url, $throwable);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testReturnsErrorResponseOnThrownExceptionIfCannotGetAllVerbs
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testReturnsErrorResponseOnThrownExceptionIfCannotGetAllVerbs
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 10, Failures: 1.

[Killed] PublicVisibility
infrastructure/web/controller/VerbManager.php:71:5
     }
 
 
-    public function createVerb(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
+    protected function createVerb(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\VerbManager::createVerb() from scope norsk\api\manager\infrastructure\web\controller\VerbManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:200

ERRORS!
Tests: 3, Assertions: 12, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:76:13
         try {
             $payload = Payload::of($request);
             $command = CreateVerb::createBy($payload);
-            $this->verbCreator->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:78:13
             $command = CreateVerb::createBy($payload);
             $this->verbCreator->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Created Verb: ' . $payload->asJson()->asString()
-                )
-            );
+            
 
             return CreatedResponse::savedVocabulary($this->url);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 16, Failures: 1.

[Killed] Concat
infrastructure/web/controller/VerbManager.php:80:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Created Verb: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($payload->asJson()->asString() . 'Created Verb: '));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
Failed asserting that 500 matches expected 201.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:202

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:80:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Created Verb: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($payload->asJson()->asString()));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
Failed asserting that 500 matches expected 201.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:202

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbManager.php:84:13
                 )
             );
 
-            return CreatedResponse::savedVocabulary($this->url);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanCreateVerb
TypeError: norsk\api\manager\infrastructure\web\controller\VerbManager::createVerb(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/manager/infrastructure/web/controller/VerbManager.php:63
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:

[Killed] PublicVisibility
infrastructure/web/controller/VerbManager.php:93:5
     }
 
 
-    public function update(AuthenticatedUserInterface $user, ServerRequestInterface $request): ResponseInterface
+    protected function update(AuthenticatedUserInterface $user, ServerRequestInterface $request): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\VerbManager::update() from scope norsk\api\manager\infrastructure\web\controller\VerbManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:307

ERRORS!
Tests: 6, Assertions: 28, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:100:13
             $payload = Payload::of($request);
 
             $command = UpdateVerb::createBy($id, $payload);
-            $this->verbUpdater->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 33, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:102:13
             $command = UpdateVerb::createBy($id, $payload);
             $this->verbUpdater->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Updated Id: ' . $id->asString()
-                    . ' to: ' . $payload->asJson()->asString()
-                )
-            );
+            
 
             return NoContentResponse::updatedVocabularySuccessfully($this->url);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 32, Failures: 1.

[Killed] Concat
infrastructure/web/controller/VerbManager.php:104:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Updated Id: ' . $id->asString()
-                    . ' to: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString('Updated Id: ' . ' to: ' . $id->asString() . $payload->asJson()->asString()));asString()
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
Failed asserting that 500 matches expected 204.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:309

FAILURES!
Tests: 6, Assertions: 31, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:104:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Updated Id: ' . $id->asString()
+                    $this->logger->info(LogMessage::fromString('Updated Id: ' . ' to: ' . $payload->asJson()->asString()));
                     . ' to: ' . $payload->asJson()->asString()
                 )
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
Failed asserting that 500 matches expected 204.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:309

FAILURES!
Tests: 6, Assertions: 31, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbManager.php:109:13
                 )
             );
 
-            return NoContentResponse::updatedVocabularySuccessfully($this->url);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanUpdate
TypeError: norsk\api\manager\infrastructure\web\controller\VerbManager::update(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/manager/infrastructure/web/controller/VerbManager.php:77
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:307

ERR

[Killed] PublicVisibility
infrastructure/web/controller/VerbManager.php:118:5
     }
 
 
-    public function delete(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
+    protected function delete(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\VerbManager::delete() from scope norsk\api\manager\infrastructure\web\controller\VerbManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:461

ERRORS!
Tests: 10, Assertions: 52, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbManager.php:124:13
             $id = Id::fromString($request->getAttribute('id'));
 
             $command = DeleteVerb::createBy($id);
-            $this->verbRemover->handle($command);
+            
 
             $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 10, Assertions: 57, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:126:13
             $command = DeleteVerb::createBy($id);
             $this->verbRemover->handle($command);
 
-            $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
+            $json = Json::fromString('{"message":"Removed verb with id: ' . '"}');
             $this->logger->info(LogMessage::fromString('Removed Id: ' . $id->asString()));
 
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'{"message":"Removed verb with id: 1"}'
+'{"message":"Removed verb with id: "}'

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:126:13
             $command = DeleteVerb::createBy($id);
             $this->verbRemover->handle($command);
 
-            $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
+            $json = Json::fromString($id->asString() . '"}');
             $this->logger->info(LogMessage::fromString('Removed Id: ' . $id->asString()));
 
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 54, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbManager.php:127:13
             $this->verbRemover->handle($command);
 
             $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
-            $this->logger->info(LogMessage::fromString('Removed Id: ' . $id->asString()));
+            $this->logger->info(LogMessage::fromString('Removed Id: '));
 
             return SuccessResponse::deletedRecord($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 55, Failures: 1.

[Killed] Concat
infrastructure/web/controller/VerbManager.php:127:13
             $this->verbRemover->handle($command);
 
             $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
-            $this->logger->info(LogMessage::fromString('Removed Id: ' . $id->asString()));
+            $this->logger->info(LogMessage::fromString($id->asString() . 'Removed Id: '));
 
             return SuccessResponse::deletedRecord($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:132
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 55, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbManager.php:129:13
             $json = Json::fromString('{"message":"Removed verb with id: ' . $id->asString() . '"}');
             $this->logger->info(LogMessage::fromString('Removed Id: ' . $id->asString()));
 
-            return SuccessResponse::deletedRecord($this->url, $json);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\VerbManagerTest::testCanDelete
TypeError: norsk\api\manager\infrastructure\web\controller\VerbManager::delete(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/manager/infrastructure/web/controller/VerbManager.php:91
/app/api/tests/unit/manager/infrastructure/web/controller/VerbManagerTest.php:461

ERR
