[Killed] PublicVisibility
infrastructure/web/controller/WordManager.php:47:5
     }
 
 
-    public function getAllWords(AuthenticatedUserInterface $user): ResponseInterface
+    protected function getAllWords(AuthenticatedUserInterface $user): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\WordManager::getAllWords() from scope norsk\api\manager\infrastructure\web\controller\WordManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:111

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordManager.php:55:13
             $allWords = $this->wordsProvider->handle($command);
             $json = $allWords->asJson();
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Generated list of Words: ' . $json->asString()
-                    . ' by manager: ' . $userName->asString()
-                )
-            );
+            
 
             return VocabularyListResponse::create($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordManager.php:57:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Generated list of Words: ' . $json->asString()
-                    . ' by manager: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Generated list of Words: ' . ' by manager: ' . $json->asString() . $userName->asString()));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:112

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordManager.php:57:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Generated list of Words: ' . $json->asString()
+                    $this->logger->info(LogMessage::fromString($json->asString() . 'Generated list of Words: ' . ' by manager: ' . $userName->asString()));
                     . ' by manager: ' . $userName->asString()
                 )
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanGetAllWords
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:112

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
infrastructure/web/controller/WordManager.php:71:5
     }
 
 
-    public function createWord(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
+    protected function createWord(AuthenticatedUserInterface $user, ServerRequest $request): ResponseInterface
     {
         try {
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
Error: Call to protected method norsk\api\manager\infrastructure\web\controller\WordManager::createWord() from scope norsk\api\manager\infrastructure\web\controller\WordManagerTest

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:198

ERRORS!
Tests: 3, Assertions: 12, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordManager.php:76:13
         try {
             $payload = Payload::of($request);
             $command = CreateWord::createBy($payload);
-            $this->wordCreator->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordManager.php:78:13
             $command = CreateWord::createBy($payload);
             $this->wordCreator->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Created Word: ' . $payload->asJson()->asString()
-                )
-            );
+            
 
             return CreatedResponse::savedVocabulary($this->url);
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 16, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordManager.php:80:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Created Word: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($payload->asJson()->asString() . 'Created Word: '));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
Failed asserting that 500 matches expected 201.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:200

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordManager.php:80:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Created Word: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($payload->asJson()->asString()));
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanCreateWord
Failed asserting that 500 matches expected 201.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:200

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordManager.php:100:13
             $payload = Payload::of($request);
 
             $command = UpdateWord::createBy($id, $payload);
-            $this->wordUpdater->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 33, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordManager.php:104:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Updated Id: ' . $id->asString()
-                    . ' to: ' . $payload->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString('Updated Id: ' . $id->asString() . $payload->asJson()->asString() . ' to: '));asString()
                 )
             );
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
Failed asserting that 500 matches expected 204.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:309

FAILURES!
Tests: 6, Assertions: 31, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordManager.php:104:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Updated Id: ' . $id->asString()
+                    $this->logger->info(LogMessage::fromString($id->asString() . ' to: ' . $payload->asJson()->asString()));
                     . ' to: ' . $payload->asJson()->asString()
                 )
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanUpdate
Failed asserting that 500 matches expected 204.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:309

FAILURES!
Tests: 6, Assertions: 31, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordManager.php:124:13
             $id = Id::fromString($request->getAttribute('id'));
 
             $command = DeleteWord::createBy($id);
-            $this->wordRemover->handle($command);
+            
 
             $idString = $command->getId()->asString();
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 10, Assertions: 57, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordManager.php:127:13
             $this->wordRemover->handle($command);
 
             $idString = $command->getId()->asString();
-            $json = Json::fromString('{"message":"Removed word with id: ' . $idString . '"}');
+            $json = Json::fromString($idString . '{"message":"Removed word with id: ' . '"}');
             $this->logger->info(LogMessage::fromString('Removed Id: ' . $idString));
 
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 54, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordManager.php:127:13
             $this->wordRemover->handle($command);
 
             $idString = $command->getId()->asString();
-            $json = Json::fromString('{"message":"Removed word with id: ' . $idString . '"}');
+            $json = Json::fromString('{"message":"Removed word with id: ' . $idString);
             $this->logger->info(LogMessage::fromString('Removed Id: ' . $idString));
 
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 54, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordManager.php:128:13
 
             $idString = $command->getId()->asString();
             $json = Json::fromString('{"message":"Removed word with id: ' . $idString . '"}');
-            $this->logger->info(LogMessage::fromString('Removed Id: ' . $idString));
+            $this->logger->info(LogMessage::fromString('Removed Id: '));
 
             return SuccessResponse::deletedRecord($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 55, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordManager.php:128:13
 
             $idString = $command->getId()->asString();
             $json = Json::fromString('{"message":"Removed word with id: ' . $idString . '"}');
-            $this->logger->info(LogMessage::fromString('Removed Id: ' . $idString));
+            $this->logger->info(LogMessage::fromString($idString));
 
             return SuccessResponse::deletedRecord($this->url, $json);
killedBy: norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
statusReason: 1) norsk\api\manager\infrastructure\web\controller\WordManagerTest::testCanDelete
Failed asserting that 500 matches expected 200.

/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:130
/app/api/tests/unit/manager/infrastructure/web/controller/WordManagerTest.php:463

FAILURES!
Tests: 10, Assertions: 55, Failures: 1.
