[Killed] PublicVisibility
infrastructure/web/responses/VocabularyListResponse.php:15:5
 
 class VocabularyListResponse
 {
-    public static function create(Url $url, Json $body): Response
+    protected static function create(Url $url, Json $body): Response
     {
         return new Response(
killedBy: norsk\api\manager\infrastructure\web\responses\VocabularyListResponseTest::testCanCreateVocabularyListResponse
statusReason: 1) norsk\api\manager\infrastructure\web\responses\VocabularyListResponseTest::testCanCreateVocabularyListResponse
Error: Call to protected method norsk\api\manager\infrastructure\web\responses\VocabularyListResponse::create() from scope norsk\api\manager\infrastructure\web\responses\VocabularyListResponseTest

/app/api/tests/unit/manager/infrastructure/web/responses/VocabularyListResponseTest.php:
