[Killed] PublicVisibility
shared/application/Json.php:23:5
     }
 
 
-    public static function fromString(string $content): self
+    protected static function fromString(string $content): self
     {
         if (!json_validate($content)) {
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromStringAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromStringAsString
Error: Call to protected method norsk\api\shared\application\Json::fromString() from scope norsk\api\shared\application\JsonTest

/app/api/tests/unit/shared/application/JsonTest.php:24

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] LogicalNot
shared/application/Json.php:25:9
 
     public static function fromString(string $content): self
     {
-        if (!json_validate($content)) {
+        if (json_validate($content)) {
             throw new InvalidJsonArgumentException('Cannot create json from: ' . $content);
         }
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromStringAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromStringAsString
norsk\api\shared\domain\exceptions\InvalidJsonArgumentException: Cannot create json from: {"key":"value"}

/app/api/src/shared/application/Json.php:20
/app/api/tests/unit/shared/application/JsonTest.php:24

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Concat
shared/application/Json.php:26:13
     public static function fromString(string $content): self
     {
         if (!json_validate($content)) {
-            throw new InvalidJsonArgumentException('Cannot create json from: ' . $content);
+            throw new InvalidJsonArgumentException($content . 'Cannot create json from: ');
         }
 
killedBy: norsk\api\shared\application\JsonTest::testThrowsExceptionIfInvalidStringIsGivenToEncode
statusReason: 1) norsk\api\shared\application\JsonTest::testThrowsExceptionIfInvalidStringIsGivenToEncode
Failed asserting that exception message 'nixCannot create json from: ' contains 'Cannot create json from: nix'.

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] ConcatOperandRemoval
shared/application/Json.php:26:13
     public static function fromString(string $content): self
     {
         if (!json_validate($content)) {
-            throw new InvalidJsonArgumentException('Cannot create json from: ' . $content);
+            throw new InvalidJsonArgumentException('Cannot create json from: ');
         }
 
killedBy: norsk\api\shared\application\JsonTest::testThrowsExceptionIfInvalidStringIsGivenToEncode
statusReason: 1) norsk\api\shared\application\JsonTest::testThrowsExceptionIfInvalidStringIsGivenToEncode
Failed asserting that exception message 'Cannot create json from: ' contains 'Cannot create json from: nix'.

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] PublicVisibility
shared/application/Json.php:33:5
     }
 
 
-    public static function encodeFromArray(array $array): self
+    protected static function encodeFromArray(array $array): self
     {
         try {
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromArrayAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromArrayAsString
Error: Call to protected method norsk\api\shared\application\Json::encodeFromArray() from scope norsk\api\shared\application\JsonTest

/app/api/tests/unit/shared/application/JsonTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ReturnRemoval
shared/application/Json.php:36:13
     public static function encodeFromArray(array $array): self
     {
         try {
-            return new self(json_encode($array, JSON_THROW_ON_ERROR));
+            
         } catch (JsonException) {
             throw new InvalidJsonArgumentException('Could not encode to json from array');
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromArrayAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromArrayAsString
TypeError: norsk\api\shared\application\Json::encodeFromArray(): Return value must be of type norsk\api\shared\application\Json, none returned

/app/api/src/shared/application/Json.php:31
/app/api/tests/unit/shared/application/JsonTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
shared/application/Json.php:38:13
         try {
             return new self(json_encode($array, JSON_THROW_ON_ERROR));
         } catch (JsonException) {
-            throw new InvalidJsonArgumentException('Could not encode to json from array');
+            new InvalidJsonArgumentException('Could not encode to json from array');
         }
     }
killedBy: norsk\api\shared\application\JsonTest::testThrowsExceptionIfArrayIsInvalidForEncoding
statusReason: 1) norsk\api\shared\application\JsonTest::testThrowsExceptionIfArrayIsInvalidForEncoding
Failed asserting that exception of type "TypeError" matches expected exception "norsk\api\shared\domain\exceptions\InvalidJsonArgumentException". Message was: "norsk\api\shared\application\Json::encodeFromArray(): Return value must be of type norsk\api\shared\application\Json, none returned" at
/app/api/src/sh

[Killed] PublicVisibility
shared/application/Json.php:43:5
     }
 
 
-    public static function encodeFromStdClass(stdClass $class): self
+    protected static function encodeFromStdClass(stdClass $class): self
     {
         try {
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromStdClassAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromStdClassAsString
Error: Call to protected method norsk\api\shared\application\Json::encodeFromStdClass() from scope norsk\api\shared\application\JsonTest

/app/api/tests/unit/shared/application/JsonTest.php:33

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] ReturnRemoval
shared/application/Json.php:46:13
     public static function encodeFromStdClass(stdClass $class): self
     {
         try {
-            return new self((string)json_encode($class, JSON_THROW_ON_ERROR));
+            
             // @codeCoverageIgnoreStart
         } catch (JsonException) {
killedBy: norsk\api\shared\application\JsonTest::testCanBeUsedFromStdClassAsString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanBeUsedFromStdClassAsString
TypeError: norsk\api\shared\application\Json::encodeFromStdClass(): Return value must be of type norsk\api\shared\application\Json, none returned

/app/api/src/shared/application/Json.php:41
/app/api/tests/unit/shared/application/JsonTest.php:33

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
shared/application/Json.php:55:5
     }
 
 
-    public static function asEscaped(Payload $payload): self
+    protected static function asEscaped(Payload $payload): self
     {
         try {
killedBy: norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
Error: Call to protected method norsk\api\shared\application\Json::asEscaped() from scope norsk\api\shared\application\JsonTest

/app/api/tests/unit/shared/application/JsonTest.php:71

ERRORS!
Tests: 6, Assertions: 9, Errors: 1.

[Killed] ReturnRemoval
shared/application/Json.php:61:13
             $innerJson = $payload->asJson()->asString();
             $outerJson = json_encode($innerJson, JSON_THROW_ON_ERROR);
 
-            return new self($outerJson);
+            
             // @codeCoverageIgnoreStart
         } catch (JsonException) {
killedBy: norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
TypeError: norsk\api\shared\application\Json::asEscaped(): Return value must be of type norsk\api\shared\application\Json, none returned

/app/api/src/shared/application/Json.php:53
/app/api/tests/unit/shared/application/JsonTest.php:71

ERRORS!
Tests: 6, Assertions: 9, Errors: 1.

[Killed] PublicVisibility
shared/application/Json.php:76:5
     }
 
 
-    public function asDecodedJson(): array
+    protected function asDecodedJson(): array
     {
         try {
killedBy: norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
Error: Call to protected method norsk\api\shared\application\Json::asDecodedJson() from scope norsk\api\shared\infrastructure\http\request\Payload

/app/api/src/shared/infrastructure/http/request/Payload.php:39
/app/api/tests/unit/shared/application/JsonTest.php:71

ERRORS!
Tests: 6, Assertions: 9, Errors: 1.

[Killed] ReturnRemoval
shared/application/Json.php:79:13
     public function asDecodedJson(): array
     {
         try {
-            return json_decode($this->content, true, self::DEPTH, JSON_THROW_ON_ERROR);
+            
             // @codeCoverageIgnoreStart
         } catch (JsonException) {
killedBy: norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
statusReason: 1) norsk\api\shared\application\JsonTest::testCanGetEscapedJsonInJsonString
TypeError: norsk\api\shared\application\Json::asDecodedJson(): Return value must be of type array, none returned

/app/api/src/shared/application/Json.php:67
/app/api/src/shared/infrastructure/http/request/Payload.php:39
/app/api/tests/unit/shared/application/JsonTest.php:71

ERRORS!
