[Killed] UnwrapTrim
shared/domain/German.php:23:9
 
     public static function of(string $string): self
     {
-        $trimmed = trim($string);
+        $trimmed = $string;
         self::ensureIsNotEmpty($trimmed);
 
statusReason: 1) norsk\api\shared\domain\GermanTest::testCanBeUsedAsString with data set "Äpfel" ('  Äpfel    ')
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Äpfel'
+'  Äpfel    '

[Killed] MethodCallRemoval
shared/domain/German.php:24:9
     public static function of(string $string): self
     {
         $trimmed = trim($string);
-        self::ensureIsNotEmpty($trimmed);
+        
 
         return new self(SanitizedClientInput::of($trimmed)->asString());
statusReason: 1) norsk\api\shared\domain\GermanTest::testThrowsExceptionIfGermanIsEmpty with data set "space" ('  a   ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 22, Assertions: 22, Failures: 1.

[Killed] LessThanNegotiation
shared/domain/German.php:33:9
     private static function ensureIsNotEmpty(string $string): void
     {
         $strlen = strlen($string);
-        if ($strlen < self::SHORTEST_WORD) {
+        if ($strlen >= self::SHORTEST_WORD) {
             throw new InvalidArgumentException(
                 'German has at least two chars.',
statusReason: 1) norsk\api\shared\domain\GermanTest::testCanBeUsedAsString with data set "Äpfel" ('  Äpfel    ')
InvalidArgumentException: German has at least two chars.

/app/api/src/shared/domain/German.php:25
/app/api/src/shared/domain/German.php:18
/app/api/tests/unit/shared/domain/GermanTest.php:59

ERRORS!

[Survived] LessThan
shared/domain/German.php:33:9
     private static function ensureIsNotEmpty(string $string): void
     {
         $strlen = strlen($string);
-        if ($strlen < self::SHORTEST_WORD) {
+        if ($strlen <= self::SHORTEST_WORD) {
             throw new InvalidArgumentException(
                 'German has at least two chars.',

[Killed] Throw_
shared/domain/German.php:34:13
     {
         $strlen = strlen($string);
         if ($strlen < self::SHORTEST_WORD) {
-            throw new InvalidArgumentException(
-                'German has at least two chars.',
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException('German has at least two chars.', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\shared\domain\GermanTest::testThrowsExceptionIfGermanIsEmpty with data set "space" ('  a   ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 22, Assertions: 22, Failures: 1.
