[Killed] PublicVisibility
shared/domain/Id.php:17:5
     }
 
 
-    public static function by(int $id): self
+    protected static function by(int $id): self
     {
         return new self($id);
killedBy: norsk\api\shared\domain\IdTest::testCanBeUsedAsInt
statusReason: 1) norsk\api\shared\domain\IdTest::testCanBeUsedAsInt
Error: Call to protected method norsk\api\shared\domain\Id::by() from scope norsk\api\shared\domain\IdTest

/app/api/tests/unit/shared/domain/IdTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
shared/domain/Id.php:23:5
     }
 
 
-    public static function fromString(string $id): self
+    protected static function fromString(string $id): self
     {
         if (!is_numeric($id)) {
killedBy: norsk\api\shared\domain\IdTest::testCanBeUsedAsString
statusReason: 1) norsk\api\shared\domain\IdTest::testCanBeUsedAsString
Error: Call to protected method norsk\api\shared\domain\Id::fromString() from scope norsk\api\shared\domain\IdTest

/app/api/tests/unit/shared/domain/IdTest.php:23

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] LogicalNot
shared/domain/Id.php:25:9
 
     public static function fromString(string $id): self
     {
-        if (!is_numeric($id)) {
+        if (is_numeric($id)) {
             throw new InvalidArgumentException(
                 'Id has to be numeric: ' . $id,
killedBy: norsk\api\shared\domain\IdTest::testCanBeUsedAsString
statusReason: 1) norsk\api\shared\domain\IdTest::testCanBeUsedAsString
InvalidArgumentException: Id has to be numeric: 98

/app/api/src/shared/domain/Id.php:20
/app/api/tests/unit/shared/domain/IdTest.php:23

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Throw_
shared/domain/Id.php:26:13
     public static function fromString(string $id): self
     {
         if (!is_numeric($id)) {
-            throw new InvalidArgumentException(
-                'Id has to be numeric: ' . $id,
-                ResponseCode::badRequest->value
-            );
+            new InvalidArgumentException('Id has to be numeric: ' . $id, ResponseCode::badRequest->value);
         }
 
killedBy: norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
statusReason: 1) norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
shared/domain/Id.php:27:17
     {
         if (!is_numeric($id)) {
             throw new InvalidArgumentException(
-                'Id has to be numeric: ' . $id,
+                throw new InvalidArgumentException('Id has to be numeric: ', ResponseCode::badRequest->value);
                 ResponseCode::badRequest->value
             );
killedBy: norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
statusReason: 1) norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
Failed asserting that exception message 'Id has to be numeric: ' contains 'Id has to be numeric: abc'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] Concat
shared/domain/Id.php:27:17
     {
         if (!is_numeric($id)) {
             throw new InvalidArgumentException(
-                'Id has to be numeric: ' . $id,
+                throw new InvalidArgumentException($id . 'Id has to be numeric: ', ResponseCode::badRequest->value);
                 ResponseCode::badRequest->value
             );
killedBy: norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
statusReason: 1) norsk\api\shared\domain\IdTest::testThrowsAnExceptionIfIdIsNotNumeric
Failed asserting that exception message 'abcId has to be numeric: ' contains 'Id has to be numeric: abc'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
