[Killed] Identical
shared/domain/Norsk.php:29:9
 
     private static function ensureIsNotEmpty(string $string): void
     {
-        if ($string === '') {
+        if ($string !== '') {
             throw new InvalidArgumentException('Norsk cannot be empty.', ResponseCode::unprocessable->value);
         }
statusReason: 1) norsk\api\shared\domain\NorskTest::testCanBeUsedAsString with data set "Norsk" ('   Norsk   ')
InvalidArgumentException: Norsk cannot be empty.

/app/api/src/shared/domain/Norsk.php:23
/app/api/src/shared/domain/Norsk.php:17
/app/api/tests/unit/shared/domain/NorskTest.php:44

ERRORS!

[Killed] Throw_
shared/domain/Norsk.php:30:13
     private static function ensureIsNotEmpty(string $string): void
     {
         if ($string === '') {
-            throw new InvalidArgumentException('Norsk cannot be empty.', ResponseCode::unprocessable->value);
+            new InvalidArgumentException('Norsk cannot be empty.', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\shared\domain\NorskTest::testThrowsExceptionIfNorskIsEmpty with data set "space" ('     ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.
