[Killed] PublicVisibility
shared/domain/Vocabularies.php:34:5
     }
 
 
-    public function add(Vocabulary $vocabulary): void
+    protected function add(Vocabulary $vocabulary): void
     {
         $this->vocabularies[] = $vocabulary;
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanIterate
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanIterate
Error: Call to protected method norsk\api\shared\domain\Vocabularies::add() from scope norsk\api\shared\domain\VocabulariesTest

/app/api/tests/unit/shared/domain/VocabulariesTest.php:124

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
shared/domain/Vocabularies.php:46:5
     }
 
 
-    public function pick(Id $pickedVocabularyId): TrainingWord|TrainingVerb
+    protected function pick(Id $pickedVocabularyId): TrainingWord|TrainingVerb
     {
         $type = null;
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
Error: Call to protected method norsk\api\shared\domain\Vocabularies::pick() from scope norsk\api\shared\domain\VocabulariesTest

/app/api/tests/unit/shared/domain/VocabulariesTest.php:48

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Foreach_
shared/domain/Vocabularies.php:49:9
     public function pick(Id $pickedVocabularyId): TrainingWord|TrainingVerb
     {
         $type = null;
-        foreach ($this->vocabularies as $vocabulary) {
-            $type = $this->getType($vocabulary);
-            if ($vocabulary->getId()->asInt() === $pickedVocabularyId->asInt()) {
-                return $vocabulary;
-            }
-        }
+        foreach ([] as $vocabulary) {
 
         throw new OutOfBoundsException(
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
OutOfBoundsException: No  can be mapped with chosen id: 3

/app/api/src/shared/domain/Vocabularies.php:43
/app/api/tests/unit/shared/domain/VocabulariesTest.php:48

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Identical
shared/domain/Vocabularies.php:51:13
         $type = null;
         foreach ($this->vocabularies as $vocabulary) {
             $type = $this->getType($vocabulary);
-            if ($vocabulary->getId()->asInt() === $pickedVocabularyId->asInt()) {
+            if ($vocabulary->getId()->asInt() !== $pickedVocabularyId->asInt()) {
                 return $vocabulary;
             }
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\trainer\domain\words\TrainingWord Object (
     'id' => norsk\api\shared\domain\Id Object (
-        'id' => 3

[Killed] ReturnRemoval
shared/domain/Vocabularies.php:52:17
         foreach ($this->vocabularies as $vocabulary) {
             $type = $this->getType($vocabulary);
             if ($vocabulary->getId()->asInt() === $pickedVocabularyId->asInt()) {
-                return $vocabulary;
+                
             }
         }
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
OutOfBoundsException: No Word can be mapped with chosen id: 3

/app/api/src/shared/domain/Vocabularies.php:43
/app/api/tests/unit/shared/domain/VocabulariesTest.php:48

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Throw_
shared/domain/Vocabularies.php:56:9
             }
         }
 
-        throw new OutOfBoundsException(
-            'No ' . $type . ' can be mapped with chosen id: ' . $pickedVocabularyId->asInt()
-        );
+        new OutOfBoundsException('No ' . $type . ' can be mapped with chosen id: ' . $pickedVocabularyId->asInt());
     }
 
killedBy: norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
Failed asserting that exception of type "TypeError" matches expected exception "OutOfBoundsException". Message was: "norsk\api\shared\domain\Vocabularies::pick(): Return value must be of type norsk\api\trainer\domain\words\TrainingWord|norsk\api\trainer\domain\verbs\TrainingVerb, none returned" at
/app/api/src/shared

[Killed] ConcatOperandRemoval
shared/domain/Vocabularies.php:57:13
         }
 
         throw new OutOfBoundsException(
-            'No ' . $type . ' can be mapped with chosen id: ' . $pickedVocabularyId->asInt()
+            throw new OutOfBoundsException('No ' . $type . $pickedVocabularyId->asInt());
         );
     }
killedBy: norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
Failed asserting that exception message 'No Word321' contains 'No Word can be mapped with chosen id: 321'.

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] ConcatOperandRemoval
shared/domain/Vocabularies.php:57:13
         }
 
         throw new OutOfBoundsException(
-            'No ' . $type . ' can be mapped with chosen id: ' . $pickedVocabularyId->asInt()
+            throw new OutOfBoundsException('No ' . ' can be mapped with chosen id: ' . $pickedVocabularyId->asInt());
         );
     }
killedBy: norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
Failed asserting that exception message 'No  can be mapped with chosen id: 321' contains 'No Word can be mapped with chosen id: 321'.

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] InstanceOf_
shared/domain/Vocabularies.php:64:9
 
     private function getType(TrainingVocabulary $vocabulary): string
     {
-        if ($vocabulary instanceof TrainingWord) {
+        if (!$vocabulary instanceof TrainingWord) {
             return ucfirst(VocabularyType::word->value);
         }
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
LogicException: Vocabulary type has to be TrainingWord or TrainingVerb

/app/api/src/shared/domain/Vocabularies.php:53
/app/api/src/shared/domain/Vocabularies.php:38
/app/api/tests/unit/shared/domain/VocabulariesTest.php:48

ERRORS!

[Killed] ReturnRemoval
shared/domain/Vocabularies.php:65:13
     private function getType(TrainingVocabulary $vocabulary): string
     {
         if ($vocabulary instanceof TrainingWord) {
-            return ucfirst(VocabularyType::word->value);
+            
         }
 
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickWordById
LogicException: Vocabulary type has to be TrainingWord or TrainingVerb

/app/api/src/shared/domain/Vocabularies.php:53
/app/api/src/shared/domain/Vocabularies.php:38
/app/api/tests/unit/shared/domain/VocabulariesTest.php:48

ERRORS!

[Killed] UnwrapUcFirst
shared/domain/Vocabularies.php:65:13
     private function getType(TrainingVocabulary $vocabulary): string
     {
         if ($vocabulary instanceof TrainingWord) {
-            return ucfirst(VocabularyType::word->value);
+            return VocabularyType::word->value;
         }
 
killedBy: norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfNoIdCanBeMapped
Failed asserting that exception message 'No word can be mapped with chosen id: 321' contains 'No Word can be mapped with chosen id: 321'.

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] InstanceOf_
shared/domain/Vocabularies.php:68:9
             return ucfirst(VocabularyType::word->value);
         }
 
-        if ($vocabulary instanceof TrainingVerb) {
+        if (!$vocabulary instanceof TrainingVerb) {
             return ucfirst(VocabularyType::verb->value);
         }
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickVerbById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickVerbById
LogicException: Vocabulary type has to be TrainingWord or TrainingVerb

/app/api/src/shared/domain/Vocabularies.php:53
/app/api/src/shared/domain/Vocabularies.php:38
/app/api/tests/unit/shared/domain/VocabulariesTest.php:72

ERRORS!

[Killed] ReturnRemoval
shared/domain/Vocabularies.php:69:13
         }
 
         if ($vocabulary instanceof TrainingVerb) {
-            return ucfirst(VocabularyType::verb->value);
+            
         }
 
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanPickVerbById
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanPickVerbById
LogicException: Vocabulary type has to be TrainingWord or TrainingVerb

/app/api/src/shared/domain/Vocabularies.php:53
/app/api/src/shared/domain/Vocabularies.php:38
/app/api/tests/unit/shared/domain/VocabulariesTest.php:72

ERRORS!

[Survived] UnwrapUcFirst
shared/domain/Vocabularies.php:69:13
         }
 
         if ($vocabulary instanceof TrainingVerb) {
-            return ucfirst(VocabularyType::verb->value);
+            return VocabularyType::verb->value;
         }
 

[Killed] Throw_
shared/domain/Vocabularies.php:72:9
             return ucfirst(VocabularyType::verb->value);
         }
 
-        throw new LogicException('Vocabulary type has to be TrainingWord or TrainingVerb');
+        new LogicException('Vocabulary type has to be TrainingWord or TrainingVerb');
     }
 
killedBy: norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfPickIsUsedOnManagedWords
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testThrowsExceptionIfPickIsUsedOnManagedWords
Failed asserting that exception of type "TypeError" matches expected exception "LogicException". Message was: "norsk\api\shared\domain\Vocabularies::getType(): Return value must be of type string, none returned" at
/app/api/src/shared/domain/Vocabularies.php:54
/app/api/src/shared/domain/Vocabularies.php:38

[Killed] PublicVisibility
shared/domain/Vocabularies.php:76:5
     }
 
 
-    public function asJson(): Json
+    protected function asJson(): Json
     {
         $array = [];
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanGetManagedWordAsJson
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanGetManagedWordAsJson
Error: Call to protected method norsk\api\shared\domain\Vocabularies::asJson() from scope norsk\api\shared\domain\VocabulariesTest

/app/api/tests/unit/shared/domain/VocabulariesTest.php:110

ERRORS!
Tests: 6, Assertions: 9, Errors: 1.

[Killed] Foreach_
shared/domain/Vocabularies.php:80:9
     {
         $array = [];
 
-        foreach ($this->vocabularies as $vocabulary) {
-            $array[] = $vocabulary->asJson()->asDecodedJson();
-        }
+        foreach ([] as $vocabulary) {
 
         return Json::encodeFromArray($array);
killedBy: norsk\api\shared\domain\VocabulariesTest::testCanGetManagedWordAsJson
statusReason: 1) norsk\api\shared\domain\VocabulariesTest::testCanGetManagedWordAsJson
Failed asserting that '[]' matches JSON string "[{"german":"Schärenküste","id":3,"norsk":"skjærgård"},{"german":"Schärenküste","id":666,"norsk":"skjærgård"}]".
--- Expected
+++ Actual
@@ @@
-[
-    {
-        "german": "Schärenküste",
