[Killed] PublicVisibility
shared/domain/VocabularyType.php:13:5
     case verb = 'verb';
 
 
-    public function isWord(VocabularyType $vocabularyType): bool
+    protected function isWord(VocabularyType $vocabularyType): bool
     {
         return self::word->value === $vocabularyType->value;
killedBy: norsk\api\shared\domain\VocabularyTypeTest::testReturnsTrueIfTypeIsWord
statusReason: 1) norsk\api\shared\domain\VocabularyTypeTest::testReturnsTrueIfTypeIsWord
Error: Call to protected method norsk\api\shared\domain\VocabularyType::isWord() from scope norsk\api\shared\domain\VocabularyTypeTest

/app/api/tests/unit/shared/domain/VocabularyTypeTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
shared/domain/VocabularyType.php:15:9
 
     public function isWord(VocabularyType $vocabularyType): bool
     {
-        return self::word->value === $vocabularyType->value;
+        return self::word->value !== $vocabularyType->value;
     }
 }
killedBy: norsk\api\shared\domain\VocabularyTypeTest::testReturnsTrueIfTypeIsWord
statusReason: 1) norsk\api\shared\domain\VocabularyTypeTest::testReturnsTrueIfTypeIsWord
Failed asserting that false is true.

/app/api/tests/unit/shared/domain/VocabularyTypeTest.php:15

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
