[Killed] PublicVisibility
infrastructure/http/request/Parameter.php:17:5
     }
 
 
-    public static function by(string $parameter): self
+    protected static function by(string $parameter): self
     {
         $trimmed = trim($parameter);
statusReason: 1) norsk\api\shared\infrastructure\http\request\ParameterTest::testFailsIfParameterIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "Error" matches expected exception "InvalidArgumentException". Message was: "Call to protected method norsk\api\shared\infrastructure\http\request\Parameter::by() from scope norsk\api\shared\infrastructure\http\request\ParameterTest" at
/

[Killed] UnwrapTrim
infrastructure/http/request/Parameter.php:19:9
 
     public static function by(string $parameter): self
     {
-        $trimmed = trim($parameter);
+        $trimmed = $parameter;
         self::ensureIsNotEmpty($trimmed);
 
statusReason: 1) norsk\api\shared\infrastructure\http\request\ParameterTest::testFailsIfParameterIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/http/request/Parameter.php:20:9
     public static function by(string $parameter): self
     {
         $trimmed = trim($parameter);
-        self::ensureIsNotEmpty($trimmed);
+        
 
         return new self($trimmed);
statusReason: 1) norsk\api\shared\infrastructure\http\request\ParameterTest::testFailsIfParameterIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
infrastructure/http/request/Parameter.php:28:9
 
     private static function ensureIsNotEmpty(string $trimmed): void
     {
-        if ($trimmed === '') {
+        if ($trimmed !== '') {
             throw new InvalidArgumentException(
                 'Parameter cannot be empty.',
statusReason: 1) norsk\api\shared\infrastructure\http\request\ParameterTest::testFailsIfParameterIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
infrastructure/http/request/Parameter.php:29:13
     private static function ensureIsNotEmpty(string $trimmed): void
     {
         if ($trimmed === '') {
-            throw new InvalidArgumentException(
-                'Parameter cannot be empty.',
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException('Parameter cannot be empty.', ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\shared\infrastructure\http\request\ParameterTest::testFailsIfParameterIsNoValidString with data set #0 (' ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
