[Killed] PublicVisibility
infrastructure/http/request/Payload.php:20:5
     }
 
 
-    public static function of(ServerRequestInterface $request): self
+    protected static function of(ServerRequestInterface $request): self
     {
         $asArray = $request->getParsedBody();
killedBy: norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedOfRequestAsArray
statusReason: 1) norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedOfRequestAsArray
Error: Call to protected method norsk\api\shared\infrastructure\http\request\Payload::of() from scope norsk\api\shared\infrastructure\http\request\PayloadTest

/app/api/tests/unit/shared/infrastructure/http/request/PayloadTest.php:39

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/http/request/Payload.php:23:9
     public static function of(ServerRequestInterface $request): self
     {
         $asArray = $request->getParsedBody();
-        self::ensureRequestIsNotNull($asArray);
+        
 
         return new self($asArray);
killedBy: norsk\api\shared\infrastructure\http\request\PayloadTest::testThrowsExceptionIfResponseIsNull
statusReason: 1) norsk\api\shared\infrastructure\http\request\PayloadTest::testThrowsExceptionIfResponseIsNull
/app/api/src/shared/infrastructure/http/request/Payload.php:13
/app/api/src/shared/infrastructure/http/request/Payload.php:20
/app/api/tests/unit/shared/infrastructure/http/request/PayloadTest.php:73
.

FAILURES!

[Killed] Identical
infrastructure/http/request/Payload.php:31:9
 
     private static function ensureRequestIsNotNull(object|array|null $asArray): void
     {
-        if ($asArray === null) {
+        if ($asArray !== null) {
             throw new InvalidArgumentException('No request body', ResponseCode::badRequest->value);
         }
killedBy: norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedOfRequestAsArray
statusReason: 1) norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedOfRequestAsArray
InvalidArgumentException: No request body

/app/api/src/shared/infrastructure/http/request/Payload.php:25
/app/api/src/shared/infrastructure/http/request/Payload.php:19
/app/api/tests/unit/shared/infrastructure/http/request/PayloadTest.php:39

ERRORS!

[Killed] Throw_
infrastructure/http/request/Payload.php:32:13
     private static function ensureRequestIsNotNull(object|array|null $asArray): void
     {
         if ($asArray === null) {
-            throw new InvalidArgumentException('No request body', ResponseCode::badRequest->value);
+            new InvalidArgumentException('No request body', ResponseCode::badRequest->value);
         }
     }
killedBy: norsk\api\shared\infrastructure\http\request\PayloadTest::testThrowsExceptionIfResponseIsNull
statusReason: 1) norsk\api\shared\infrastructure\http\request\PayloadTest::testThrowsExceptionIfResponseIsNull
/app/api/src/shared/infrastructure/http/request/Payload.php:13
/app/api/src/shared/infrastructure/http/request/Payload.php:20
/app/api/tests/unit/shared/infrastructure/http/request/PayloadTest.php:73
.

FAILURES!

[Killed] PublicVisibility
infrastructure/http/request/Payload.php:37:5
     }
 
 
-    public static function by(stdClass $class): self
+    protected static function by(stdClass $class): self
     {
         $asArray = Json::encodeFromStdClass($class)->asDecodedJson();
killedBy: norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedByStdClassAsArray
statusReason: 1) norsk\api\shared\infrastructure\http\request\PayloadTest::testCanBeUsedByStdClassAsArray
Error: Call to protected method norsk\api\shared\infrastructure\http\request\Payload::by() from scope norsk\api\shared\infrastructure\http\request\PayloadTest

/app/api/tests/unit/shared/infrastructure/http/request/PayloadTest.php:49

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
