[Killed] PublicVisibility
infrastructure/http/response/ResponseHeaderApplier.php:16:5
     }
 
 
-    public static function fromHeaders(ResponseHeaders $headers): self
+    protected static function fromHeaders(ResponseHeaders $headers): self
     {
         return new self($headers);
killedBy: norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
statusReason: 1) norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
Error: Call to protected method norsk\api\shared\infrastructure\http\response\ResponseHeaderApplier::fromHeaders() from scope norsk\api\infrastructure\response\ResponseHeaderApplierTest

/app/api/tests/unit/infrastructure/response/ResponseHeaderApplierTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
infrastructure/http/response/ResponseHeaderApplier.php:22:5
     }
 
 
-    public function apply(ResponseInterface $response): ResponseInterface
+    protected function apply(ResponseInterface $response): ResponseInterface
     {
         foreach ($this->headers->asArray() as $key => $value) {
killedBy: norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
statusReason: 1) norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
Error: Call to protected method norsk\api\shared\infrastructure\http\response\ResponseHeaderApplier::apply() from scope norsk\api\infrastructure\response\ResponseHeaderApplierTest

/app/api/tests/unit/infrastructure/response/ResponseHeaderApplierTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
infrastructure/http/response/ResponseHeaderApplier.php:24:9
 
     public function apply(ResponseInterface $response): ResponseInterface
     {
-        foreach ($this->headers->asArray() as $key => $value) {
-            $response = $response->withHeader($key, (string)$value);
-        }
+        foreach ([] as $key => $value) {
 
         return $response;
killedBy: norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
statusReason: 1) norsk\api\infrastructure\response\ResponseHeaderApplierTest::testCanApplyHeader
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'application/json'
+''
