[Killed] PublicVisibility
infrastructure/http/response/Url.php:17:5
     }
 
 
-    public static function by(string $url): self
+    protected static function by(string $url): self
     {
         self::ensureIsValidUrl($url);
statusReason: 1) norsk\api\infrastructure\response\UrlTest::testUseUrlAsString with data set "http" ('http://someUrl')
Error: Call to protected method norsk\api\shared\infrastructure\http\response\Url::by() from scope norsk\api\infrastructure\response\UrlTest

/app/api/tests/unit/infrastructure/response/UrlTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/http/response/Url.php:19:9
 
     public static function by(string $url): self
     {
-        self::ensureIsValidUrl($url);
+        
 
         return new self($url);
killedBy: norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
statusReason: 1) norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Identical
infrastructure/http/response/Url.php:27:9
 
     private static function ensureIsValidUrl(string $url): void
     {
-        if (false === filter_var($url, FILTER_VALIDATE_URL)) {
+        if (false !== filter_var($url, FILTER_VALIDATE_URL)) {
             throw new InvalidArgumentException('The given URL is not a valid URL: ' . $url);
         }
statusReason: 1) norsk\api\infrastructure\response\UrlTest::testUseUrlAsString with data set "http" ('http://someUrl')
InvalidArgumentException: The given URL is not a valid URL: http://someUrl

/app/api/src/shared/infrastructure/http/response/Url.php:20
/app/api/src/shared/infrastructure/http/response/Url.php:14
/app/api/tests/unit/infrastructure/response/UrlTest.php:29

ERRORS!

[Killed] Throw_
infrastructure/http/response/Url.php:28:13
     private static function ensureIsValidUrl(string $url): void
     {
         if (false === filter_var($url, FILTER_VALIDATE_URL)) {
-            throw new InvalidArgumentException('The given URL is not a valid URL: ' . $url);
+            new InvalidArgumentException('The given URL is not a valid URL: ' . $url);
         }
     }
killedBy: norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
statusReason: 1) norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/http/response/Url.php:28:13
     private static function ensureIsValidUrl(string $url): void
     {
         if (false === filter_var($url, FILTER_VALIDATE_URL)) {
-            throw new InvalidArgumentException('The given URL is not a valid URL: ' . $url);
+            throw new InvalidArgumentException($url);
         }
     }
killedBy: norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
statusReason: 1) norsk\api\infrastructure\response\UrlTest::testThrowsExceptionIfUrlIsInvalid
Failed asserting that exception message 'false' contains 'The given URL is not a valid URL: false'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
