[Killed] PublicVisibility
http/response/exceptionMapper/ManagerExceptionMapper.php:17:5
 
 class ManagerExceptionMapper
 {
-    public static function mapForCreate(Throwable|Exception $throwable, Url $url): ResponseInterface
+    protected static function mapForCreate(Throwable|Exception $throwable, Url $url): ResponseInterface
     {
         $code = $throwable->getCode();
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForCreate with data set "ConflictException" (Exception Object (...), 409)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\exceptionMapper\ManagerExceptionMapper::mapForCreate() from scope norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest

/app/api/tests/u

[Killed] MatchArmRemoval
http/response/exceptionMapper/ManagerExceptionMapper.php:21:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $code === ResponseCode::conflict->value
-            => self::entryAlreadyExistsResponse($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForCreate with data set "ConflictException" (Exception Object (...), 409)
Failed asserting that 500 matches expected 409.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:32

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/ManagerExceptionMapper.php:22:13
         $code = $throwable->getCode();
 
         return match (true) {
-            $code === ResponseCode::conflict->value
+            $code !== ResponseCode::conflict->value => self::entryAlreadyExistsResponse($url, $throwable),
             => self::entryAlreadyExistsResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForCreate with data set "ConflictException" (Exception Object (...), 409)
Failed asserting that 500 matches expected 409.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:32

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
http/response/exceptionMapper/ManagerExceptionMapper.php:30:5
     }
 
 
-    public static function mapForUpdate(Throwable|Exception $throwable, Url $url): ResponseInterface
+    protected static function mapForUpdate(Throwable|Exception $throwable, Url $url): ResponseInterface
     {
         $code = $throwable->getCode();
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForUpdate with data set "ConflictException" (Exception Object (...), 409)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\exceptionMapper\ManagerExceptionMapper::mapForUpdate() from scope norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest

/app/api/tests/u

[Killed] MatchArmRemoval
http/response/exceptionMapper/ManagerExceptionMapper.php:34:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $code === ResponseCode::conflict->value
-            => self::entryAlreadyExistsResponse($url, $throwable),
-
-            $code === ResponseCode::notFound->value
-            => self::noVocabularyFoundForRequestedId($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForUpdate with data set "ConflictException" (Exception Object (...), 409)
Failed asserting that 500 matches expected 409.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:40

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/ManagerExceptionMapper.php:38:13
             $code === ResponseCode::conflict->value
             => self::entryAlreadyExistsResponse($url, $throwable),
 
-            $code === ResponseCode::notFound->value
+            $code !== ResponseCode::notFound->value => self::noVocabularyFoundForRequestedId($url, $throwable),
             => self::noVocabularyFoundForRequestedId($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForUpdate with data set "NotFoundException" (Exception Object (...), 404)
Failed asserting that 500 matches expected 404.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:40

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
http/response/exceptionMapper/ManagerExceptionMapper.php:46:5
     }
 
 
-    public static function mapForDelete(Throwable|Exception $throwable, Url $url): ResponseInterface
+    protected static function mapForDelete(Throwable|Exception $throwable, Url $url): ResponseInterface
     {
         $code = $throwable->getCode();
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForDelete with data set "NotFoundException" (Exception Object (...), 404)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\exceptionMapper\ManagerExceptionMapper::mapForDelete() from scope norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest

/app/api/tests/u

[Killed] MatchArmRemoval
http/response/exceptionMapper/ManagerExceptionMapper.php:50:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $code === ResponseCode::notFound->value
-            => self::noVocabularyFoundForRequestedId($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForDelete with data set "NotFoundException" (Exception Object (...), 404)
Failed asserting that 500 matches expected 404.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:48

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/ManagerExceptionMapper.php:51:13
         $code = $throwable->getCode();
 
         return match (true) {
-            $code === ResponseCode::notFound->value
+            $code !== ResponseCode::notFound->value => self::noVocabularyFoundForRequestedId($url, $throwable),
             => self::noVocabularyFoundForRequestedId($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\ManagerExceptionMapperTest::testMapForDelete with data set "NotFoundException" (Exception Object (...), 404)
Failed asserting that 500 matches expected 404.

/app/api/tests/unit/infrastructure/response/exceptionMapper/ManagerExceptionMapperTest.php:48

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.
