[Killed] PublicVisibility
http/response/exceptionMapper/RegisterExceptionMapper.php:20:5
     private const int DUPLICATE_KEY = 1062;
 
 
-    public static function map(Throwable|Exception $throwable, Url $url): ResponseInterface
+    protected static function map(Throwable|Exception $throwable, Url $url): ResponseInterface
     {
         $code = $throwable->getCode();
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\exceptionMapper\RegisterExceptionMapper::map() from scope norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest

/app/api/tests/unit/infrastru

[Killed] MatchArmRemoval
http/response/exceptionMapper/RegisterExceptionMapper.php:25:9
         $code = $throwable->getCode();
 
 
-        return match (true) {
-            $code === ResponseCode::badRequest->value
-            => self::parameterMissingResponse($url, $throwable),
-
-            $code === ResponseCode::unprocessable->value
-            => self::invalidPasswordResponse($url, $throwable),
-
-            $code === self::DUPLICATE_KEY
-            => self::userAlreadyExistsResponse($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Failed asserting that 500 matches expected 400.

/app/api/tests/unit/infrastructure/response/exceptionMapper/RegisterExceptionMapperTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/RegisterExceptionMapper.php:26:13
 
 
         return match (true) {
-            $code === ResponseCode::badRequest->value
+            $code !== ResponseCode::badRequest->value => self::parameterMissingResponse($url, $throwable),
             => self::parameterMissingResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Failed asserting that 500 matches expected 400.

/app/api/tests/unit/infrastructure/response/exceptionMapper/RegisterExceptionMapperTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/RegisterExceptionMapper.php:29:13
             $code === ResponseCode::badRequest->value
             => self::parameterMissingResponse($url, $throwable),
 
-            $code === ResponseCode::unprocessable->value
+            $code !== ResponseCode::unprocessable->value => self::invalidPasswordResponse($url, $throwable),
             => self::invalidPasswordResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest::testMap with data set "UnprocessableException" (Exception Object (...), 422)
Failed asserting that 500 matches expected 422.

/app/api/tests/unit/infrastructure/response/exceptionMapper/RegisterExceptionMapperTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/RegisterExceptionMapper.php:32:13
             $code === ResponseCode::unprocessable->value
             => self::invalidPasswordResponse($url, $throwable),
 
-            $code === self::DUPLICATE_KEY
+            $code !== self::DUPLICATE_KEY => self::userAlreadyExistsResponse($url, $throwable),
             => self::userAlreadyExistsResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\RegisterExceptionMapperTest::testMap with data set "DuplicateKeyException" (Exception Object (...), 409)
Failed asserting that 500 matches expected 409.

/app/api/tests/unit/infrastructure/response/exceptionMapper/RegisterExceptionMapperTest.php:34

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.
