[Killed] MatchArmRemoval
http/response/exceptionMapper/TrainerExceptionMapper.php:22:9
     {
         $code = $throwable->getCode();
 
-        return match (true) {
-            $code === ResponseCode::badRequest->value
-            => self::parameterMissingResponse($url, $throwable),
-
-            $code === ResponseCode::notFound->value
-            => self::vocabularyIdNotFoundResponse($url, $throwable),
-
-            default => ErrorResponse::serverError($url, $throwable),
-        };
+        
     }
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\TrainerExceptionMapperTest::testMap with data set "BadRequestException" (Exception Object (...), 400)
Failed asserting that 500 matches expected 400.

/app/api/tests/unit/infrastructure/response/exceptionMapper/TrainerExceptionMapperTest.php:32

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
http/response/exceptionMapper/TrainerExceptionMapper.php:26:13
             $code === ResponseCode::badRequest->value
             => self::parameterMissingResponse($url, $throwable),
 
-            $code === ResponseCode::notFound->value
+            $code !== ResponseCode::notFound->value => self::vocabularyIdNotFoundResponse($url, $throwable),
             => self::vocabularyIdNotFoundResponse($url, $throwable),
 
statusReason: 1) norsk\api\infrastructure\response\exceptionMapper\TrainerExceptionMapperTest::testMap with data set "NotFoundException" (Exception Object (...), 404)
Failed asserting that 500 matches expected 404.

/app/api/tests/unit/infrastructure/response/exceptionMapper/TrainerExceptionMapperTest.php:32

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
