[Killed] PublicVisibility
http/response/responses/CreatedResponse.php:14:5
 
 class CreatedResponse
 {
-    public static function savedNewUser(Url $url): Response
+    protected static function savedNewUser(Url $url): Response
     {
         return self::created($url);
killedBy: norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest::testCanCreateCreatedResponseForSavedNewUser
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest::testCanCreateCreatedResponseForSavedNewUser
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\CreatedResponse::savedNewUser() from scope norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/Cr

[Killed] PublicVisibility
http/response/responses/CreatedResponse.php:20:5
     }
 
 
-    public static function savedVocabulary(Url $url): Response
+    protected static function savedVocabulary(Url $url): Response
     {
         return self::created($url);
killedBy: norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest::testCanCreateCreatedResponseForSavedWord
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest::testCanCreateCreatedResponseForSavedWord
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\CreatedResponse::savedVocabulary() from scope norsk\api\shared\infrastructure\http\response\responses\CreatedResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/Cr
