[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:16:5
 
 class ErrorResponse
 {
-    public static function badRequest(Url $url, Throwable|Exception $throwable): Response
+    protected static function badRequest(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::badRequest);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForBadRequest
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForBadRequest
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::badRequest() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorResponseT

[Killed] ConcatOperandRemoval
http/response/responses/ErrorResponse.php:24:9
 
     private static function create(Url $url, Throwable|Exception $throwable, ResponseCode $responseCode): Response
     {
-        $responseBody = '{"message":"' . $throwable->getMessage() . '"}';
+        $responseBody = $throwable->getMessage() . '"}';
 
         return new Response(
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'{"message":"mööp"}'
+'mööp"}'

[Killed] ConcatOperandRemoval
http/response/responses/ErrorResponse.php:24:9
 
     private static function create(Url $url, Throwable|Exception $throwable, ResponseCode $responseCode): Response
     {
-        $responseBody = '{"message":"' . $throwable->getMessage() . '"}';
+        $responseBody = '{"message":"' . $throwable->getMessage();
 
         return new Response(
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'{"message":"mööp"}'
+'{"message":"mööp'

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:34:5
     }
 
 
-    public static function unauthorized(Url $url, Throwable|Exception $throwable): Response
+    protected static function unauthorized(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::unauthorized);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForUnauthorized
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForUnauthorized
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::unauthorized() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorRespo

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:40:5
     }
 
 
-    public static function forbidden(Url $url, Throwable|Exception $throwable): Response
+    protected static function forbidden(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::forbidden);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForForbidden
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForForbidden
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::forbidden() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorResponseTes

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:46:5
     }
 
 
-    public static function notFound(Url $url, Throwable|Exception $throwable): Response
+    protected static function notFound(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::notFound);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForNotFound
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForNotFound
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::notFound() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorResponseTest.

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:52:5
     }
 
 
-    public static function unprocessable(Url $url, Throwable|Exception $throwable): Response
+    protected static function unprocessable(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::unprocessable);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForUnprocessable
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForUnprocessable
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::unprocessable() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorRes

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:58:5
     }
 
 
-    public static function serverError(Url $url, Throwable|Exception $throwable): Response
+    protected static function serverError(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::serverError);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForServerError
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::serverError() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorRespons

[Killed] PublicVisibility
http/response/responses/ErrorResponse.php:64:5
     }
 
 
-    public static function conflict(Url $url, Throwable|Exception $throwable): Response
+    protected static function conflict(Url $url, Throwable|Exception $throwable): Response
     {
         return self::create($url, $throwable, ResponseCode::conflict);
killedBy: norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForConflict
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest::testCanCreateErrorResponseForConflict
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\ErrorResponse::conflict() from scope norsk\api\shared\infrastructure\http\response\responses\ErrorResponseTest

/app/api/tests/unit/shared/infrastructure/http/response/responses/ErrorResponseTest.
