[Killed] PublicVisibility
http/response/responses/NoContentResponse.php:14:5
 
 class NoContentResponse
 {
-    public static function vocabularyTrainedSuccessfully(Url $url): Response
+    protected static function vocabularyTrainedSuccessfully(Url $url): Response
     {
         return self::create($url);
killedBy: norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest::testCanCreateWordListResponseForWordTrainedSuccessfully
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest::testCanCreateWordListResponseForWordTrainedSuccessfully
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\NoContentResponse::vocabularyTrainedSuccessfully() from scope norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest

/app/api/tests/unit/shared/infras

[Killed] PublicVisibility
http/response/responses/NoContentResponse.php:30:5
     }
 
 
-    public static function updatedVocabularySuccessfully(Url $url): Response
+    protected static function updatedVocabularySuccessfully(Url $url): Response
     {
         return self::create($url);
killedBy: norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest::testCanCreateWordListResponseForUpdatedWordSuccessfully
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest::testCanCreateWordListResponseForUpdatedWordSuccessfully
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\NoContentResponse::updatedVocabularySuccessfully() from scope norsk\api\shared\infrastructure\http\response\responses\NoContentResponseTest

/app/api/tests/unit/shared/infras
