[Killed] PublicVisibility
http/response/responses/SuccessResponse.php:15:5
 
 class SuccessResponse
 {
-    public static function loggedIn(Url $url, Json $body): Response
+    protected static function loggedIn(Url $url, Json $body): Response
     {
         return self::create($url, $body);
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\SuccessResponseTest::testCanCreateSuccessResponses with data set "loggedIn" ('loggedIn', '{"message":"some ManageWord"}', norsk\api\shared\application\Json Object (...))
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\SuccessResponse::loggedIn() from scope norsk\api\shared\infrastructure\http\respons

[Killed] PublicVisibility
http/response/responses/SuccessResponse.php:21:5
     }
 
 
-    public static function deletedRecord(Url $url, Json $body): Response
+    protected static function deletedRecord(Url $url, Json $body): Response
     {
         return self::create($url, $body);
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\SuccessResponseTest::testCanCreateSuccessResponses with data set "deletedRecord" ('deletedRecord', '{"message":"some ManageWord"}', norsk\api\shared\application\Json Object (...))
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\SuccessResponse::deletedRecord() from scope norsk\api\shared\infrastructu

[Killed] PublicVisibility
http/response/responses/SuccessResponse.php:27:5
     }
 
 
-    public static function corsOptions(Url $url): Response
+    protected static function corsOptions(Url $url): Response
     {
         return self::create($url);
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\SuccessResponseTest::testCanCreateSuccessResponses with data set "corsOptions" ('corsOptions', null, null)
Error: Call to protected method norsk\api\shared\infrastructure\http\response\responses\SuccessResponse::corsOptions() from scope norsk\api\shared\infrastructure\http\response\responses\SuccessResponseTest

/app/api/tests/unit/shared/

[Killed] NullSafeMethodCall
http/response/responses/SuccessResponse.php:35:9
 
     private static function create(Url $url, ?Json $body = null): Response
     {
-        $validBody = $body?->asString();
+        $validBody = $body->asString();
 
         return new Response(
statusReason: 1) norsk\api\shared\infrastructure\http\response\responses\SuccessResponseTest::testCanCreateSuccessResponses with data set "corsOptions" ('corsOptions', null, null)
Error: Call to a member function asString() on null

/app/api/src/shared/infrastructure/http/response/responses/SuccessResponse.php:27
/app/api/src/shared/infrastructure/http/response/responses/SuccessResponse.php:23
/app/api/tests/un
