[Killed] PublicVisibility
trainer/application/verbTraining/VerbProgressUpdater.php:17:5
     }
 
 
-    public function handle(SaveTrainedVerb $command): void
+    protected function handle(SaveTrainedVerb $command): void
     {
         $this->verbRepository->saveAsTrainedVerb($command->getUserName(), $command->getId());
killedBy: norsk\api\trainer\application\verbTraining\VerbProgressUpdaterTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\verbTraining\VerbProgressUpdaterTest::testCanHandleCommand
Error: Call to protected method norsk\api\trainer\application\verbTraining\VerbProgressUpdater::handle() from scope norsk\api\trainer\application\verbTraining\VerbProgressUpdaterTest

/app/api/tests/unit/trainer/application/verbTraining/VerbProgressUpdaterTest.php:37

ERRORS!
Tests: 1, Assertions: 0, Errors

[Killed] MethodCallRemoval
trainer/application/verbTraining/VerbProgressUpdater.php:19:9
 
     public function handle(SaveTrainedVerb $command): void
     {
-        $this->verbRepository->saveAsTrainedVerb($command->getUserName(), $command->getId());
+        
     }
 }
killedBy: norsk\api\trainer\application\verbTraining\VerbProgressUpdaterTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\verbTraining\VerbProgressUpdaterTest::testCanHandleCommand
Expectation failed for method name is "getUserName" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
