[Killed] PublicVisibility
trainer/application/verbTraining/VerbToTrainProvider.php:21:5
     }
 
 
-    public function handle(GetVerbToTrain $command): TrainingVerb
+    protected function handle(GetVerbToTrain $command): TrainingVerb
     {
         $allVerbsForUser = $this->verbRepository->getAllVerbsFor($command->getUserName());
killedBy: norsk\api\trainer\application\verbTraining\VerbToTrainProviderTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\verbTraining\VerbToTrainProviderTest::testCanHandleCommand
Error: Call to protected method norsk\api\trainer\application\verbTraining\VerbToTrainProvider::handle() from scope norsk\api\trainer\application\verbTraining\VerbToTrainProviderTest

/app/api/tests/unit/trainer/application/verbTraining/VerbToTrainProviderTest.php:49

ERRORS!
Tests: 1, Assertions: 0, Errors
