[Killed] PublicVisibility
application/verbTraining/useCases/GetVerbToTrain.php:16:5
     }
 
 
-    public static function for(UserName $userName): self
+    protected static function for(UserName $userName): self
     {
         return new self($userName);
killedBy: norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest::testCanGetUserName
statusReason: 1) norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest::testCanGetUserName
Error: Call to protected method norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrain::for() from scope norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest

/app/api/tests/unit/trainer/application/verbTraining/useCases/GetVerbToTrainTest.php:25

ERRORS!
Tests: 1, Assertions

[Killed] PublicVisibility
application/verbTraining/useCases/GetVerbToTrain.php:22:5
     }
 
 
-    public function getUserName(): UserName
+    protected function getUserName(): UserName
     {
         return $this->userName;
killedBy: norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest::testCanGetUserName
statusReason: 1) norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest::testCanGetUserName
Error: Call to protected method norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrain::getUserName() from scope norsk\api\trainer\application\verbTraining\useCases\GetVerbToTrainTest

/app/api/tests/unit/trainer/application/verbTraining/useCases/GetVerbToTrainTest.php:25

ERRORS!
Tests: 1, As
