[Killed] PublicVisibility
application/verbTraining/useCases/SaveTrainedVerb.php:19:5
     }
 
 
-    public static function for(UserName $userName, Id $id): self
+    protected static function for(UserName $userName, Id $id): self
     {
         return new self($userName, $id);
killedBy: norsk\api\trainer\application\verbTraining\useCases\SaveTrainedVerbTest::testCanGetUserName
statusReason: 1) norsk\api\trainer\application\verbTraining\useCases\SaveTrainedVerbTest::testCanGetUserName
Error: Call to protected method norsk\api\trainer\application\verbTraining\useCases\SaveTrainedVerb::for() from scope norsk\api\trainer\application\verbTraining\useCases\SaveTrainedVerbTest

/app/api/tests/unit/trainer/application/verbTraining/useCases/SaveTrainedVerbTest.php:26

ERRORS!
Tests: 1, Assert
