[Killed] PublicVisibility
trainer/application/wordTraining/WordProgressUpdater.php:17:5
     }
 
 
-    public function handle(SaveTrainedWord $command): void
+    protected function handle(SaveTrainedWord $command): void
     {
         $this->verbRepository->saveAsTrainedWord($command->getUserName(), $command->getId());
killedBy: norsk\api\trainer\application\wordTraining\WordProgressUpdaterTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\wordTraining\WordProgressUpdaterTest::testCanHandleCommand
Error: Call to protected method norsk\api\trainer\application\wordTraining\WordProgressUpdater::handle() from scope norsk\api\trainer\application\wordTraining\WordProgressUpdaterTest

/app/api/tests/unit/trainer/application/wordTraining/WordProgressUpdaterTest.php:37

ERRORS!
Tests: 1, Assertions: 0, Errors

[Killed] MethodCallRemoval
trainer/application/wordTraining/WordProgressUpdater.php:19:9
 
     public function handle(SaveTrainedWord $command): void
     {
-        $this->verbRepository->saveAsTrainedWord($command->getUserName(), $command->getId());
+        
     }
 }
killedBy: norsk\api\trainer\application\wordTraining\WordProgressUpdaterTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\wordTraining\WordProgressUpdaterTest::testCanHandleCommand
Expectation failed for method name is "getUserName" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
