[Killed] PublicVisibility
trainer/application/wordTraining/WordToTrainProvider.php:21:5
     }
 
 
-    public function handle(GetWordToTrain $command): TrainingWord
+    protected function handle(GetWordToTrain $command): TrainingWord
     {
         $allWordsForUser = $this->wordRepository->getAllWordsFor($command->getUserName());
killedBy: norsk\api\trainer\application\wordTraining\WordToTrainProviderTest::testCanHandleCommand
statusReason: 1) norsk\api\trainer\application\wordTraining\WordToTrainProviderTest::testCanHandleCommand
Error: Call to protected method norsk\api\trainer\application\wordTraining\WordToTrainProvider::handle() from scope norsk\api\trainer\application\wordTraining\WordToTrainProviderTest

/app/api/tests/unit/trainer/application/wordTraining/WordToTrainProviderTest.php:49

ERRORS!
Tests: 1, Assertions: 0, Errors
