[Killed] PublicVisibility
trainer/domain/RandomGenerator.php:25:5
     }
 
 
-    public function pickFrom(Vocabularies $allVocabulariesForUser): TrainingWord|TrainingVerb
+    protected function pickFrom(Vocabularies $allVocabulariesForUser): TrainingWord|TrainingVerb
     {
         $possibilities = $this->calculatePossibilities($allVocabulariesForUser);
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
Error: Call to protected method norsk\api\trainer\domain\RandomGenerator::pickFrom() from scope norsk\api\trainer\domain\RandomGeneratorTest

/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
trainer/domain/RandomGenerator.php:39:9
         $possibilities = [];
 
         /** @var TrainingWord|TrainingVerb $vocabulary */
-        foreach ($allVocabulariesForUser as $vocabulary) {
-            $this->ensureIsNotManaging($vocabulary);
-            $successCounter = $vocabulary->getSuccessCounter();
-            $vocabularyId = $vocabulary->getId()->asInt();
-            if ($successCounter->isInitial()) {
-                $possibilities = $this->unratedVocabulariesHaveHighestPossibilityWeight($possibilities, $vocabularyId);
-            } else {
-                $possibilities = $this->reverseWeightForPossibilities($successCounter, $possibilities, $vocabularyId);
-            }
-        }
+        foreach ([] as $vocabulary) {
 
         return $this->normalizePossibilitiesInPerCent($possibilities);
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Survived] MethodCallRemoval
trainer/domain/RandomGenerator.php:40:13
 
         /** @var TrainingWord|TrainingVerb $vocabulary */
         foreach ($allVocabulariesForUser as $vocabulary) {
-            $this->ensureIsNotManaging($vocabulary);
+            
             $successCounter = $vocabulary->getSuccessCounter();
             $vocabularyId = $vocabulary->getId()->asInt();

[Killed] IfNegation
trainer/domain/RandomGenerator.php:43:13
             $this->ensureIsNotManaging($vocabulary);
             $successCounter = $vocabulary->getSuccessCounter();
             $vocabularyId = $vocabulary->getId()->asInt();
-            if ($successCounter->isInitial()) {
-                $possibilities = $this->unratedVocabulariesHaveHighestPossibilityWeight($possibilities, $vocabularyId);
-            } else {
-                $possibilities = $this->reverseWeightForPossibilities($successCounter, $possibilities, $vocabularyId);
-            }
+            if (!$successCounter->isInitial()) {
         }
 
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
DivisionByZeroError: Division by zero

/app/api/src/trainer/domain/RandomGenerator.php:54
/app/api/src/trainer/domain/RandomGenerator.php:36
/app/api/src/trainer/domain/RandomGenerator.php:21
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

[Killed] InstanceOf_
trainer/domain/RandomGenerator.php:56:9
 
     private function ensureIsNotManaging(TrainingVocabulary $vocabulary): void
     {
-        if (!$vocabulary instanceof TrainingWord && !$vocabulary instanceof TrainingVerb) {
+        if ($vocabulary instanceof TrainingWord && !$vocabulary instanceof TrainingVerb) {
             throw new LogicException('Vocabulary type has to be TrainingWord or TrainingVerb');
         }
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
LogicException: Vocabulary type has to be TrainingWord or TrainingVerb

/app/api/src/trainer/domain/RandomGenerator.php:44
/app/api/src/trainer/domain/RandomGenerator.php:30
/app/api/src/trainer/domain/RandomGenerator.php:21
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

[Survived] Throw_
trainer/domain/RandomGenerator.php:57:13
     private function ensureIsNotManaging(TrainingVocabulary $vocabulary): void
     {
         if (!$vocabulary instanceof TrainingWord && !$vocabulary instanceof TrainingVerb) {
-            throw new LogicException('Vocabulary type has to be TrainingWord or TrainingVerb');
+            new LogicException('Vocabulary type has to be TrainingWord or TrainingVerb');
         }
     }

[Survived] IncrementInteger
trainer/domain/RandomGenerator.php:64:9
 
     private function unratedVocabulariesHaveHighestPossibilityWeight(array $possibilities, int $vocabularyId): array
     {
-        $possibilities[$vocabularyId] = 1;
+        $possibilities[$vocabularyId] = 2;
 
         return $possibilities;

[Killed] IncrementInteger
trainer/domain/RandomGenerator.php:75:9
         array $possibilities,
         int $vocabularyId
     ): array {
-        $possibilities[$vocabularyId] = 1 / $successCounter->asInt();
+        $possibilities[$vocabularyId] = 2 / $successCounter->asInt();
 
         return $possibilities;
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\trainer\domain\words\TrainingWord Object (
     'id' => norsk\api\shared\domain\Id Object (
-        'id' => 3

[Survived] DecrementInteger
trainer/domain/RandomGenerator.php:75:9
         array $possibilities,
         int $vocabularyId
     ): array {
-        $possibilities[$vocabularyId] = 1 / $successCounter->asInt();
+        $possibilities[$vocabularyId] = 0 / $successCounter->asInt();
 
         return $possibilities;

[Killed] Foreach_
trainer/domain/RandomGenerator.php:85:9
     {
         $totalWeight = array_sum($possibilities);
 
-        foreach ($possibilities as $key => $possibility) {
-            $possibilities[$key] = $possibility / $totalWeight * self::PER_CENT;
-        }
+        foreach ([] as $key => $possibility) {
 
         return $possibilities;
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] Division
trainer/domain/RandomGenerator.php:86:13
         $totalWeight = array_sum($possibilities);
 
         foreach ($possibilities as $key => $possibility) {
-            $possibilities[$key] = $possibility / $totalWeight * self::PER_CENT;
+            $possibilities[$key] = $possibility * $totalWeight * self::PER_CENT;
         }
 
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\trainer\domain\words\TrainingWord Object (
     'id' => norsk\api\shared\domain\Id Object (
-        'id' => 3

[Killed] Multiplication
trainer/domain/RandomGenerator.php:86:13
         $totalWeight = array_sum($possibilities);
 
         foreach ($possibilities as $key => $possibility) {
-            $possibilities[$key] = $possibility / $totalWeight * self::PER_CENT;
+            $possibilities[$key] = $possibility / $totalWeight / self::PER_CENT;
         }
 
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] Foreach_
trainer/domain/RandomGenerator.php:98:9
         $randomInt = $this->randomNumber->asInt();
         $counter = 0;
 
-        foreach ($possibilities as $vocabularyId => $possibility) {
-            $counter += $possibility;
-            if ($randomInt <= $counter) {
-                return $vocabularyId;
-            }
-        }
+        foreach ([] as $vocabularyId => $possibility) {
 
         throw new OutOfBoundsException('No Vocabulary can be chosen randomly for RandomNumber: ' . $randomInt);
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] PlusEqual
trainer/domain/RandomGenerator.php:99:13
         $counter = 0;
 
         foreach ($possibilities as $vocabularyId => $possibility) {
-            $counter += $possibility;
+            $counter -= $possibility;
             if ($randomInt <= $counter) {
                 return $vocabularyId;
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] Assignment
trainer/domain/RandomGenerator.php:99:13
         $counter = 0;
 
         foreach ($possibilities as $vocabularyId => $possibility) {
-            $counter += $possibility;
+            $counter = $possibility;
             if ($randomInt <= $counter) {
                 return $vocabularyId;
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] LessThanOrEqualToNegotiation
trainer/domain/RandomGenerator.php:100:13
 
         foreach ($possibilities as $vocabularyId => $possibility) {
             $counter += $possibility;
-            if ($randomInt <= $counter) {
+            if ($randomInt > $counter) {
                 return $vocabularyId;
             }
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\trainer\domain\words\TrainingWord Object (
     'id' => norsk\api\shared\domain\Id Object (
-        'id' => 3

[Survived] LessThanOrEqualTo
trainer/domain/RandomGenerator.php:100:13
 
         foreach ($possibilities as $vocabularyId => $possibility) {
             $counter += $possibility;
-            if ($randomInt <= $counter) {
+            if ($randomInt < $counter) {
                 return $vocabularyId;
             }

[Killed] ReturnRemoval
trainer/domain/RandomGenerator.php:101:17
         foreach ($possibilities as $vocabularyId => $possibility) {
             $counter += $possibility;
             if ($randomInt <= $counter) {
-                return $vocabularyId;
+                
             }
         }
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testCanPickAWordFormAllWordsForUser
OutOfBoundsException: No Vocabulary can be chosen randomly for RandomNumber: 51

/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomGenerator.php:22
/app/api/tests/unit/trainer/domain/RandomGeneratorTest.php:48

ERRORS!

[Killed] ConcatOperandRemoval
trainer/domain/RandomGenerator.php:105:9
             }
         }
 
-        throw new OutOfBoundsException('No Vocabulary can be chosen randomly for RandomNumber: ' . $randomInt);
+        throw new OutOfBoundsException($randomInt);
     }
 }
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testThrowsExceptionIfRandomCannotBeChosenBecauseThereAreNone
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testThrowsExceptionIfRandomCannotBeChosenBecauseThereAreNone
Failed asserting that exception of type "TypeError" matches expected exception "OutOfBoundsException". Message was: "Exception::__construct(): Argument #1 ($message) must be of type string, int given" at
/app/api/src/trainer/domain/RandomGenerator.php:75
/app/api/src/trainer/domain/RandomG

[Killed] Throw_
trainer/domain/RandomGenerator.php:105:9
             }
         }
 
-        throw new OutOfBoundsException('No Vocabulary can be chosen randomly for RandomNumber: ' . $randomInt);
+        new OutOfBoundsException('No Vocabulary can be chosen randomly for RandomNumber: ' . $randomInt);
     }
 }
killedBy: norsk\api\trainer\domain\RandomGeneratorTest::testThrowsExceptionIfRandomCannotBeChosenBecauseThereAreNone
statusReason: 1) norsk\api\trainer\domain\RandomGeneratorTest::testThrowsExceptionIfRandomCannotBeChosenBecauseThereAreNone
Failed asserting that exception of type "TypeError" matches expected exception "OutOfBoundsException". Message was: "norsk\api\trainer\domain\RandomGenerator::pickARandomIdBasedOnPossibilityWeight(): Return value must be of type int, none returned" at
/app/api/src/trainer/domain/RandomGene
