[Killed] PublicVisibility
trainer/domain/SuccessCounter.php:17:5
     }
 
 
-    public static function by(?int $number): self
+    protected static function by(?int $number): self
     {
         $number = self::convertNullToZero($number);
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
Error: Call to protected method norsk\api\trainer\domain\SuccessCounter::by() from scope norsk\api\trainer\domain\SuccessCounterTest

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
trainer/domain/SuccessCounter.php:20:9
     public static function by(?int $number): self
     {
         $number = self::convertNullToZero($number);
-        self::ensureOnlyPositives($number);
+        
 
         return new self($number);
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
Failed asserting that exception of type "OutOfRangeException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] Identical
trainer/domain/SuccessCounter.php:28:9
 
     private static function convertNullToZero(?int $number): int
     {
-        if ($number === null) {
+        if ($number !== null) {
             return 0;
         }
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
Failed asserting that 0 is identical to 123.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:18

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
trainer/domain/SuccessCounter.php:29:13
     private static function convertNullToZero(?int $number): int
     {
         if ($number === null) {
-            return 0;
+            return -1;
         }
 
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntZeroFromNull
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntZeroFromNull
OutOfRangeException: Given SuccessCounter is not a positive number: -1

/app/api/src/trainer/domain/SuccessCounter.php:29
/app/api/src/trainer/domain/SuccessCounter.php:16
/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:30

ERRORS!

[Killed] IncrementInteger
trainer/domain/SuccessCounter.php:29:13
     private static function convertNullToZero(?int $number): int
     {
         if ($number === null) {
-            return 0;
+            return 1;
         }
 
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntZeroFromNull
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntZeroFromNull
Failed asserting that 1 is identical to 0.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:30

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] LessThan
trainer/domain/SuccessCounter.php:38:9
 
     private static function ensureOnlyPositives(int $number): void
     {
-        if ($number < 0) {
+        if ($number <= 0) {
             throw new OutOfRangeException(
                 'Given SuccessCounter is not a positive number: ' . $number,
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntWithZero
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsIntWithZero
OutOfRangeException: Given SuccessCounter is not a positive number: 0

/app/api/src/trainer/domain/SuccessCounter.php:29
/app/api/src/trainer/domain/SuccessCounter.php:16
/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:24

ERRORS!

[Killed] LessThanNegotiation
trainer/domain/SuccessCounter.php:38:9
 
     private static function ensureOnlyPositives(int $number): void
     {
-        if ($number < 0) {
+        if ($number >= 0) {
             throw new OutOfRangeException(
                 'Given SuccessCounter is not a positive number: ' . $number,
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testCanBeUsedAsInt
OutOfRangeException: Given SuccessCounter is not a positive number: 123

/app/api/src/trainer/domain/SuccessCounter.php:29
/app/api/src/trainer/domain/SuccessCounter.php:16
/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:18

ERRORS!

[Killed] Throw_
trainer/domain/SuccessCounter.php:39:13
     private static function ensureOnlyPositives(int $number): void
     {
         if ($number < 0) {
-            throw new OutOfRangeException(
-                'Given SuccessCounter is not a positive number: ' . $number,
-                ResponseCode::unprocessable->value
-            );
+            new OutOfRangeException('Given SuccessCounter is not a positive number: ' . $number, ResponseCode::unprocessable->value);
         }
     }
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
Failed asserting that exception of type "OutOfRangeException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
trainer/domain/SuccessCounter.php:40:17
     {
         if ($number < 0) {
             throw new OutOfRangeException(
-                'Given SuccessCounter is not a positive number: ' . $number,
+                throw new OutOfRangeException($number, ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testThrowsExceptionIfNegativeNumberIsGiven
Failed asserting that exception of type "TypeError" matches expected exception "OutOfRangeException". Message was: "Exception::__construct(): Argument #1 ($message) must be of type string, int given" at
/app/api/src/trainer/domain/SuccessCounter.php:29
/app/api/src/trainer/domain/SuccessCounter.php:16
/app/a

[Survived] ConcatOperandRemoval
trainer/domain/SuccessCounter.php:40:17
     {
         if ($number < 0) {
             throw new OutOfRangeException(
-                'Given SuccessCounter is not a positive number: ' . $number,
+                throw new OutOfRangeException('Given SuccessCounter is not a positive number: ', ResponseCode::unprocessable->value);
                 ResponseCode::unprocessable->value
             );

[Killed] PublicVisibility
trainer/domain/SuccessCounter.php:47:5
     }
 
 
-    public function isInitial(): bool
+    protected function isInitial(): bool
     {
         if ($this->asInt() === 0) {
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
Error: Call to protected method norsk\api\trainer\domain\SuccessCounter::isInitial() from scope norsk\api\trainer\domain\SuccessCounterTest

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:45

ERRORS!
Tests: 5, Assertions: 5, Errors: 1.

[Killed] Identical
trainer/domain/SuccessCounter.php:49:9
 
     public function isInitial(): bool
     {
-        if ($this->asInt() === 0) {
+        if ($this->asInt() !== 0) {
             return true;
         }
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
Failed asserting that false is true.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:45

FAILURES!
Tests: 5, Assertions: 6, Failures: 1.

[Killed] DecrementInteger
trainer/domain/SuccessCounter.php:49:9
 
     public function isInitial(): bool
     {
-        if ($this->asInt() === 0) {
+        if ($this->asInt() === -1) {
             return true;
         }
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
Failed asserting that false is true.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:45

FAILURES!
Tests: 5, Assertions: 6, Failures: 1.

[Killed] ReturnRemoval
trainer/domain/SuccessCounter.php:50:13
     public function isInitial(): bool
     {
         if ($this->asInt() === 0) {
-            return true;
+            
         }
 
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
Failed asserting that false is true.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:45

FAILURES!
Tests: 5, Assertions: 6, Failures: 1.

[Killed] TrueValue
trainer/domain/SuccessCounter.php:50:13
     public function isInitial(): bool
     {
         if ($this->asInt() === 0) {
-            return true;
+            return false;
         }
 
killedBy: norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
statusReason: 1) norsk\api\trainer\domain\SuccessCounterTest::testReturnsTrueIfIsInitial
Failed asserting that false is true.

/app/api/tests/unit/trainer/domain/SuccessCounterTest.php:45

FAILURES!
Tests: 5, Assertions: 6, Failures: 1.
