[Killed] PublicVisibility
trainer/domain/verbs/TrainingVerb.php:28:5
     }
 
 
-    public static function of(
+    protected static function of(Id $id, German $german, Norsk $norsk, Norsk $norskPresent, Norsk $norskPast, Norsk $norskPastPerfect, SuccessCounter $successCounter): self
         Id $id,
         German $german,
killedBy: norsk\api\trainer\domain\verbs\TrainingVerbTest::testCanGetId
statusReason: 1) norsk\api\trainer\domain\verbs\TrainingVerbTest::testCanGetId
Error: Call to protected method norsk\api\trainer\domain\verbs\TrainingVerb::of() from scope norsk\api\trainer\domain\verbs\TrainingVerbTest

/app/api/tests/unit/trainer/domain/verbs/TrainingVerbTest.php:56

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
