[Killed] PublicVisibility
trainer/domain/words/TrainingWord.php:25:5
     }
 
 
-    public static function of(Id $id, German $german, Norsk $norsk, SuccessCounter $successCounter): self
+    protected static function of(Id $id, German $german, Norsk $norsk, SuccessCounter $successCounter): self
     {
         return new self($id, $german, $norsk, $successCounter);
killedBy: norsk\api\trainer\domain\words\TrainingWordTest::testCanGetId
statusReason: 1) norsk\api\trainer\domain\words\TrainingWordTest::testCanGetId
Error: Call to protected method norsk\api\trainer\domain\words\TrainingWord::of() from scope norsk\api\trainer\domain\words\TrainingWordTest

/app/api/tests/unit/trainer/domain/words/TrainingWordTest.php:52

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
