[Killed] PublicVisibility
trainer/infrastructure/TrainerFactory.php:32:5
     }
 
 
-    public function wordTrainer(): WordTrainer
+    protected function wordTrainer(): WordTrainer
     {
         $reader = new WordTrainingReader($this->dbConnection);
killedBy: norsk\api\trainer\infrastructure\TrainerFactoryTest::testCreatesWordTrainer
statusReason: 1) norsk\api\trainer\infrastructure\TrainerFactoryTest::testCreatesWordTrainer
Error: Call to protected method norsk\api\trainer\infrastructure\TrainerFactory::wordTrainer() from scope norsk\api\trainer\infrastructure\TrainerFactoryTest

/app/api/tests/unit/trainer/infrastructure/TrainerFactoryTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
trainer/infrastructure/TrainerFactory.php:47:5
     }
 
 
-    public function verbTrainer(): VerbTrainer
+    protected function verbTrainer(): VerbTrainer
     {
         $reader = new VerbTrainingReader($this->dbConnection);
killedBy: norsk\api\trainer\infrastructure\TrainerFactoryTest::testCreatesVerbTrainer
statusReason: 1) norsk\api\trainer\infrastructure\TrainerFactoryTest::testCreatesVerbTrainer
Error: Call to protected method norsk\api\trainer\infrastructure\TrainerFactory::verbTrainer() from scope norsk\api\trainer\infrastructure\TrainerFactoryTest

/app/api/tests/unit/trainer/infrastructure/TrainerFactoryTest.php:41

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
