[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:39:9
 
     public function saveAsTrainedWord(UserName $userName, Id $id): void
     {
-        $this->saveAsTrained($userName, $id, VocabularyType::word);
+        
     }
 
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actu

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:45:9
 
     public function saveAsTrainedVerb(UserName $userName, Id $id): void
     {
-        $this->saveAsTrained($userName, $id, VocabularyType::verb);
+        
     }
 
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "verb" ('saveAsTrainedVerb', norsk\api\trainer\infrastructure\persistence\queries\verbs\SaveTrainedVerbSql Object (...), norsk\api\shared\domain\VocabularyType Enum (verb, 'verb'))
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actu

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:53:13
     {
         try {
             $params = Parameters::init();
-            $params->addString($userName->asString());
+            
             $params->addInt($id->asInt());
             $params->addInt($id->asInt());
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
RuntimeException: Failed to save trained word: Expectation failed for method name is "execute" when invoked 1 time

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:54:13
         try {
             $params = Parameters::init();
             $params->addString($userName->asString());
-            $params->addInt($id->asInt());
+            
             $params->addInt($id->asInt());
 
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
RuntimeException: Failed to save trained word: Expectation failed for method name is "execute" when invoked 1 time

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:55:13
             $params = Parameters::init();
             $params->addString($userName->asString());
             $params->addInt($id->asInt());
-            $params->addInt($id->asInt());
+            
 
             $sql = $this->getSql($vocabularyType);
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
RuntimeException: Failed to save trained word: Expectation failed for method name is "execute" when invoked 1 time

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:60:13
             $sql = $this->getSql($vocabularyType);
             $affectedRows = $this->dbConnector->execute($sql, $params);
 
-            $this->validateRecordWasActive($affectedRows, $id, $vocabularyType);
+            
         } catch (Throwable $throwable) {
             $this->ifNoRecordInDatabaseForId($throwable, $id, $vocabularyType);
statusReason: Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 3, Assertions: 9, Failures: 1.

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:62:13
 
             $this->validateRecordWasActive($affectedRows, $id, $vocabularyType);
         } catch (Throwable $throwable) {
-            $this->ifNoRecordInDatabaseForId($throwable, $id, $vocabularyType);
+            
             throw new RuntimeException(
                 'Failed to save trained ' . $vocabularyType->value . ': ' . $throwable->getMessage()
statusReason: Failed asserting that exception of type "RuntimeException" matches expected exception "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException". Message was: "Failed to save trained word: No record found in database for wordId: 1" at
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:49
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:31
/app/api/tests/uni

[Killed] Throw_
trainer/infrastructure/persistence/TrainingWriter.php:63:13
             $this->validateRecordWasActive($affectedRows, $id, $vocabularyType);
         } catch (Throwable $throwable) {
             $this->ifNoRecordInDatabaseForId($throwable, $id, $vocabularyType);
-            throw new RuntimeException(
-                'Failed to save trained ' . $vocabularyType->value . ': ' . $throwable->getMessage()
-            );
+            new RuntimeException('Failed to save trained ' . $vocabularyType->value . ': ' . $throwable->getMessage());
         }
     }
statusReason: Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 5, Assertions: 19, Failures: 1.

[Killed] Concat
trainer/infrastructure/persistence/TrainingWriter.php:64:17
         } catch (Throwable $throwable) {
             $this->ifNoRecordInDatabaseForId($throwable, $id, $vocabularyType);
             throw new RuntimeException(
-                'Failed to save trained ' . $vocabularyType->value . ': ' . $throwable->getMessage()
+                throw new RuntimeException('Failed to save trained ' . ': ' . $vocabularyType->value . $throwable->getMessage());
             );
         }
statusReason: Failed asserting that exception message 'Failed to save trained : wordoops' contains 'Failed to save trained word: oops'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] ConcatOperandRemoval
trainer/infrastructure/persistence/TrainingWriter.php:64:17
         } catch (Throwable $throwable) {
             $this->ifNoRecordInDatabaseForId($throwable, $id, $vocabularyType);
             throw new RuntimeException(
-                'Failed to save trained ' . $vocabularyType->value . ': ' . $throwable->getMessage()
+                throw new RuntimeException('Failed to save trained ' . ': ' . $throwable->getMessage());
             );
         }
statusReason: Failed asserting that exception message 'Failed to save trained : oops' contains 'Failed to save trained word: oops'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] IfNegation
trainer/infrastructure/persistence/TrainingWriter.php:72:9
 
     private function getSql(VocabularyType $vocabularyType): SaveTrainedVerbSql|SaveTrainedWordSql
     {
-        if ($vocabularyType->isWord($vocabularyType)) {
-            return $this->saveTrainedWordSql;
-        }
+        if (!$vocabularyType->isWord($vocabularyType)) {
 
         return $this->saveTrainedVerbSql;
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
RuntimeException: Failed to save trained word: Expectation failed for method name is "execute" when invoked 1 time

[Killed] ReturnRemoval
trainer/infrastructure/persistence/TrainingWriter.php:73:13
     private function getSql(VocabularyType $vocabularyType): SaveTrainedVerbSql|SaveTrainedWordSql
     {
         if ($vocabularyType->isWord($vocabularyType)) {
-            return $this->saveTrainedWordSql;
+            
         }
 
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
RuntimeException: Failed to save trained word: Expectation failed for method name is "execute" when invoked 1 time

[Killed] IfNegation
trainer/infrastructure/persistence/TrainingWriter.php:82:9
 
     private function validateRecordWasActive(AffectedRows $affectedRows, Id $id, VocabularyType $vocabularyType): void
     {
-        if ($affectedRows->notAtLeastOne()) {
-            $this->noRecordInDatabaseException($id, $vocabularyType);
-        }
+        if (!$affectedRows->notAtLeastOne()) {
     }
 
statusReason: 1) norsk\api\trainer\infrastructure\persistence\TrainingWriterTest::testCanSaveTrainedWord with data set "word" ('saveAsTrainedWord', norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSql Object (...), norsk\api\shared\domain\VocabularyType Enum (word, 'word'))
norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException: No record found in database for wordId: 1

/app/a

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:83:13
     private function validateRecordWasActive(AffectedRows $affectedRows, Id $id, VocabularyType $vocabularyType): void
     {
         if ($affectedRows->notAtLeastOne()) {
-            $this->noRecordInDatabaseException($id, $vocabularyType);
+            
         }
     }
statusReason: Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 3, Assertions: 9, Failures: 1.

[Killed] Throw_
trainer/infrastructure/persistence/TrainingWriter.php:90:9
 
     private function noRecordInDatabaseException(Id $id, VocabularyType $vocabularyType): void
     {
-        throw new NoRecordInDatabaseException(
-            'No record found in database for ' . $vocabularyType->value . 'Id: ' . $id->asString(),
-            ResponseCode::notFound->value
-        );
+        new NoRecordInDatabaseException('No record found in database for ' . $vocabularyType->value . 'Id: ' . $id->asString(), ResponseCode::notFound->value);
     }
 
statusReason: Failed asserting that exception of type "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException" is thrown.

FAILURES!
Tests: 3, Assertions: 9, Failures: 1.

[Killed] Concat
trainer/infrastructure/persistence/TrainingWriter.php:91:13
     private function noRecordInDatabaseException(Id $id, VocabularyType $vocabularyType): void
     {
         throw new NoRecordInDatabaseException(
-            'No record found in database for ' . $vocabularyType->value . 'Id: ' . $id->asString(),
+            throw new NoRecordInDatabaseException('No record found in database for ' . 'Id: ' . $vocabularyType->value . $id->asString(), ResponseCode::notFound->value);
             ResponseCode::notFound->value
         );
statusReason: Failed asserting that exception message 'No record found in database for Id: word1' contains 'No record found in database for wordId: 1'.

FAILURES!
Tests: 3, Assertions: 10, Failures: 1.

[Killed] ConcatOperandRemoval
trainer/infrastructure/persistence/TrainingWriter.php:91:13
     private function noRecordInDatabaseException(Id $id, VocabularyType $vocabularyType): void
     {
         throw new NoRecordInDatabaseException(
-            'No record found in database for ' . $vocabularyType->value . 'Id: ' . $id->asString(),
+            throw new NoRecordInDatabaseException('No record found in database for ' . $vocabularyType->value . $id->asString(), ResponseCode::notFound->value);
             ResponseCode::notFound->value
         );
statusReason: Failed asserting that exception message 'No record found in database for word1' contains 'No record found in database for wordId: 1'.

FAILURES!
Tests: 3, Assertions: 10, Failures: 1.

[Killed] Identical
trainer/infrastructure/persistence/TrainingWriter.php:100:13
     private function ifNoRecordInDatabaseForId(Throwable $throwable, Id $id, VocabularyType $vocabularyType): void
     {
         if (
-            $throwable->getCode() === self::CONSTRAINT_ERROR
+            if ($throwable->getCode() !== self::CONSTRAINT_ERROR || $throwable->getCode() === ResponseCode::notFound->value) {
             || $throwable->getCode() === ResponseCode::notFound->value
         ) {
statusReason: Failed asserting that exception message 'No record found in database for wordId: 1' contains 'Failed to save trained word: oops'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] LogicalOrAllSubExprNegation
trainer/infrastructure/persistence/TrainingWriter.php:100:13
     private function ifNoRecordInDatabaseForId(Throwable $throwable, Id $id, VocabularyType $vocabularyType): void
     {
         if (
-            $throwable->getCode() === self::CONSTRAINT_ERROR
-            || $throwable->getCode() === ResponseCode::notFound->value
+            if (!($throwable->getCode() === self::CONSTRAINT_ERROR) || !($throwable->getCode() === ResponseCode::notFound->value)) {und->value
         ) {
             $this->noRecordInDatabaseException($id, $vocabularyType);
statusReason: Failed asserting that exception message 'No record found in database for wordId: 1' contains 'Failed to save trained word: oops'.

FAILURES!
Tests: 5, Assertions: 20, Failures: 1.

[Killed] Identical
trainer/infrastructure/persistence/TrainingWriter.php:101:13
     {
         if (
             $throwable->getCode() === self::CONSTRAINT_ERROR
-            || $throwable->getCode() === ResponseCode::notFound->value
+            if ($throwable->getCode() === self::CONSTRAINT_ERROR || $throwable->getCode() !== ResponseCode::notFound->value) {
         ) {
             $this->noRecordInDatabaseException($id, $vocabularyType);
statusReason: Failed asserting that exception of type "RuntimeException" matches expected exception "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException". Message was: "Failed to save trained word: No record found in database for wordId: 1" at
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:49
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:31
/app/api/tests/uni

[Killed] MethodCallRemoval
trainer/infrastructure/persistence/TrainingWriter.php:103:13
             $throwable->getCode() === self::CONSTRAINT_ERROR
             || $throwable->getCode() === ResponseCode::notFound->value
         ) {
-            $this->noRecordInDatabaseException($id, $vocabularyType);
+            
         }
     }
statusReason: Failed asserting that exception of type "RuntimeException" matches expected exception "norsk\api\trainer\domain\exceptions\NoRecordInDatabaseException". Message was: "Failed to save trained word: No record found in database for wordId: 1" at
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:49
/app/api/src/trainer/infrastructure/persistence/TrainingWriter.php:31
/app/api/tests/uni
