[Survived] Foreach_
trainer/infrastructure/persistence/VerbTrainingReader.php:46:9
         $this->ensureDatabaseHasAnyVerbs($result);
 
         $verbs = Vocabularies::create();
-        foreach ($result as $verbRecord) {
-            $verb = TrainingVerb::of(
-                Id::by($verbRecord['id']),
-                German::of($verbRecord['german']),
-                Norsk::of($verbRecord['norsk']),
-                Norsk::of($verbRecord['norsk_present']),
-                Norsk::of($verbRecord['norsk_past']),
-                Norsk::of($verbRecord['norsk_past_perfekt']),
-                SuccessCounter::by($verbRecord['successCounter'])
-            );
-            $verbs->add($verb);
-        }
+        foreach ([] as $verbRecord) {
 
         return $verbs;

[Survived] MethodCallRemoval
trainer/infrastructure/persistence/VerbTrainingReader.php:56:13
                 Norsk::of($verbRecord['norsk_past_perfekt']),
                 SuccessCounter::by($verbRecord['successCounter'])
             );
-            $verbs->add($verb);
+            
         }
 
