[Survived] Foreach_
trainer/infrastructure/persistence/WordTrainingReader.php:46:9
         $this->ensureDatabaseHasAnyWords($result);
 
         $words = Vocabularies::create();
-        foreach ($result as $wordRecord) {
-            $word = TrainingWord::of(
-                Id::by($wordRecord['id']),
-                German::of($wordRecord['german']),
-                Norsk::of($wordRecord['norsk']),
-                SuccessCounter::by($wordRecord['successCounter'])
-            );
-            $words->add($word);
-        }
+        foreach ([] as $wordRecord) {
 
         return $words;
