[Killed] ConcatOperandRemoval
persistence/queries/verbs/SaveTrainedVerbSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `verbsSuccessCounterToUsers` (`username`, `verbId`, `successCounter`, `timestamp`) '
-                     . 'SELECT ?, ?, 1, NOW() '
+        $this->sql = 'SELECT ?, ?, 1, NOW() ' . 'FROM `verbs` ' . 'WHERE `id` = ? AND `active` = 1 ' . 'ON DUPLICATE KEY UPDATE ' . '`successCounter`=`successCounter`+1, `timestamp` = NOW();';
                      . 'FROM `verbs` '
                      . 'WHERE `id` = ? AND `active` = 1 '
killedBy: norsk\api\trainer\infrastructure\persistence\queries\verbs\SaveTrainedVerbSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\trainer\infrastructure\persistence\queries\verbs\SaveTrainedVerbSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `verbsSuccessCounterToUsers` (`username`, `verbId`, `successCounter`, `timestamp`) SELECT ?, ?, 1, NOW() FROM `verbs` WHERE `id` = ? AND `active` = 1 ON DUPLICATE KEY UPDATE `successCounter`=`success
