[Killed] ConcatOperandRemoval
persistence/queries/words/SaveTrainedWordSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `wordsSuccessCounterToUsers` (`username`, `wordId`, `successCounter`, `timestamp`) '
-                     . 'SELECT ?, ?, 1, NOW() '
+        $this->sql = 'SELECT ?, ?, 1, NOW() ' . 'FROM `words` ' . 'WHERE `id` = ? AND `active` = 1 ' . 'ON DUPLICATE KEY UPDATE ' . '`successCounter`=`successCounter`+1, `timestamp` = NOW();';
                      . 'FROM `words` '
                      . 'WHERE `id` = ? AND `active` = 1 '
killedBy: norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\trainer\infrastructure\persistence\queries\words\SaveTrainedWordSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `wordsSuccessCounterToUsers` (`username`, `wordId`, `successCounter`, `timestamp`) SELECT ?, ?, 1, NOW() FROM `words` WHERE `id` = ? AND `active` = 1 ON DUPLICATE KEY UPDATE `successCounter`=`success
