[Killed] PublicVisibility
infrastructure/web/controller/VerbTrainer.php:36:5
     }
 
 
-    public function getVerbToTrain(AuthenticatedUserInterface $user): ResponseInterface
+    protected function getVerbToTrain(AuthenticatedUserInterface $user): ResponseInterface
     {
         try {
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
Error: Call to protected method norsk\api\trainer\infrastructure\web\controller\VerbTrainer::getVerbToTrain() from scope norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:111

ERRORS!
Tests: 1, Assertions: 0, Errors:

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbTrainer.php:43:13
             $command = GetVerbToTrain::for($userName);
             $verbToTrain = $this->getVerbToTrainHandler->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Verb to train: ' . $verbToTrain->asJson()->asString()
-                    . ' for user: ' . $userName->asString()
-                )
-            );
+            
 
             return VocabularyToTrainResponse::create($this->url, $verbToTrain->asJson());
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbTrainer.php:45:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Verb to train: ' . $verbToTrain->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($verbToTrain->asJson()->asString() . ' for user: ' . $userName->asString()));
                     . ' for user: ' . $userName->asString()
                 )
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
Failed asserting that 500 is identical to 200.

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:120
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:112

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/VerbTrainer.php:45:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Verb to train: ' . $verbToTrain->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString('Verb to train: ' . ' for user: ' . $userName->asString()));
                     . ' for user: ' . $userName->asString()
                 )
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
Failed asserting that 500 is identical to 200.

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:120
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:112

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbTrainer.php:50:13
                 )
             );
 
-            return VocabularyToTrainResponse::create($this->url, $verbToTrain->asJson());
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanGetVerbToTrain
TypeError: norsk\api\trainer\infrastructure\web\controller\VerbTrainer::getVerbToTrain(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/trainer/infrastructure/web/controller/VerbTrainer.php:40
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerT

[Killed] PublicVisibility
infrastructure/web/controller/VerbTrainer.php:59:5
     }
 
 
-    public function saveSuccess(AuthenticatedUserInterface $user, ServerRequestInterface $request): ResponseInterface
+    protected function saveSuccess(AuthenticatedUserInterface $user, ServerRequestInterface $request): ResponseInterface
     {
         try {
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
Error: Call to protected method norsk\api\trainer\infrastructure\web\controller\VerbTrainer::saveSuccess() from scope norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:179

ERRORS!
Tests: 3, Assertions: 14, Errors: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbTrainer.php:66:13
             $id = Id::fromString($request->getAttribute('id'));
 
             $command = SaveTrainedVerb::for($userName, $id);
-            $this->saveTrainedVerbHandler->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 20, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/VerbTrainer.php:68:13
             $command = SaveTrainedVerb::for($userName, $id);
             $this->saveTrainedVerbHandler->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Saved successfully trained verbId: ' . $id->asString()
-                    . ' for user: ' . $userName->asString()
-                )
-            );
+            
 
             return NoContentResponse::vocabularyTrainedSuccessfully($this->url);
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 18, Failures: 1.

[Killed] Concat
infrastructure/web/controller/VerbTrainer.php:70:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Saved successfully trained verbId: ' . $id->asString()
-                    . ' for user: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Saved successfully trained verbId: ' . $id->asString() . $userName->asString() . ' for user: '));
                 )
             );
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
Failed asserting that 500 is identical to 204.

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:120
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:180

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] Concat
infrastructure/web/controller/VerbTrainer.php:70:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Saved successfully trained verbId: ' . $id->asString()
+                    $this->logger->info(LogMessage::fromString($id->asString() . 'Saved successfully trained verbId: ' . ' for user: ' . $userName->asString()));
                     . ' for user: ' . $userName->asString()
                 )
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
Failed asserting that 500 is identical to 204.

/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:120
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.php:180

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/VerbTrainer.php:75:13
                 )
             );
 
-            return NoContentResponse::vocabularyTrainedSuccessfully($this->url);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\VerbTrainerTest::testCanSaveSuccess
TypeError: norsk\api\trainer\infrastructure\web\controller\VerbTrainer::saveSuccess(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/trainer/infrastructure/web/controller/VerbTrainer.php:54
/app/api/tests/unit/trainer/infrastructure/web/controller/VerbTrainerTest.ph
