[Killed] PublicVisibility
infrastructure/web/controller/WordTrainer.php:36:5
     }
 
 
-    public function getWordToTrain(AuthenticatedUserInterface $user): ResponseInterface
+    protected function getWordToTrain(AuthenticatedUserInterface $user): ResponseInterface
     {
         try {
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
Error: Call to protected method norsk\api\trainer\infrastructure\web\controller\WordTrainer::getWordToTrain() from scope norsk\api\trainer\infrastructure\web\controller\WordTrainerTest

/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:110

ERRORS!
Tests: 1, Assertions: 0, Errors:

[Killed] MethodCallRemoval
infrastructure/web/controller/WordTrainer.php:43:13
             $command = GetWordToTrain::for($userName);
             $wordToTrain = $this->getWordToTrainHandler->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Word to train: ' . $wordToTrain->asJson()->asString()
-                    . ' for user: ' . $userName->asString()
-                )
-            );
+            
 
             return VocabularyToTrainResponse::create($this->url, $wordToTrain->asJson());
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordTrainer.php:45:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Word to train: ' . $wordToTrain->asJson()->asString()
-                    . ' for user: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Word to train: ' . ' for user: ' . $wordToTrain->asJson()->asString() . $userName->asString()));
                 )
             );
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
Failed asserting that 500 is identical to 200.

/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:119
/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:111

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordTrainer.php:45:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Word to train: ' . $wordToTrain->asJson()->asString()
+                    $this->logger->info(LogMessage::fromString($wordToTrain->asJson()->asString() . ' for user: ' . $userName->asString()));
                     . ' for user: ' . $userName->asString()
                 )
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
Failed asserting that 500 is identical to 200.

/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:119
/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:111

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/WordTrainer.php:50:13
                 )
             );
 
-            return VocabularyToTrainResponse::create($this->url, $wordToTrain->asJson());
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanGetWordToTrain
TypeError: norsk\api\trainer\infrastructure\web\controller\WordTrainer::getWordToTrain(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/trainer/infrastructure/web/controller/WordTrainer.php:40
/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerT

[Killed] MethodCallRemoval
infrastructure/web/controller/WordTrainer.php:66:13
             $id = Id::fromString($request->getAttribute('id'));
 
             $command = SaveTrainedWord::for($userName, $id);
-            $this->saveTrainedWordHandler->handle($command);
+            
 
             $this->logger->info(
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
Expectation failed for method name is "handle" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 20, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/WordTrainer.php:68:13
             $command = SaveTrainedWord::for($userName, $id);
             $this->saveTrainedWordHandler->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString(
-                    'Saved successfully trained wordId: ' . $id->asString()
-                    . ' for user: ' . $userName->asString()
-                )
-            );
+            
 
             return NoContentResponse::vocabularyTrainedSuccessfully($this->url);
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 18, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/WordTrainer.php:70:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Saved successfully trained wordId: ' . $id->asString()
-                    . ' for user: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Saved successfully trained wordId: ' . $id->asString() . ' for user: '));
                 )
             );
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
Failed asserting that 500 is identical to 204.

/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:119
/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:179

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] Concat
infrastructure/web/controller/WordTrainer.php:70:21
 
             $this->logger->info(
                 LogMessage::fromString(
-                    'Saved successfully trained wordId: ' . $id->asString()
-                    . ' for user: ' . $userName->asString()
+                    $this->logger->info(LogMessage::fromString('Saved successfully trained wordId: ' . ' for user: ' . $id->asString() . $userName->asString()));
                 )
             );
killedBy: norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
statusReason: 1) norsk\api\trainer\infrastructure\web\controller\WordTrainerTest::testCanSaveSuccess
Failed asserting that 500 is identical to 204.

/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:119
/app/api/tests/unit/trainer/infrastructure/web/controller/WordTrainerTest.php:179

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.
