[Killed] PublicVisibility
user/application/UserRegistration.php:21:5
     }
 
 
-    public function handle(RegisterUser $command): RegisteredUser
+    protected function handle(RegisterUser $command): RegisteredUser
     {
         $user = RegisteredUser::create(
killedBy: norsk\api\user\application\UserRegistrationTest::testCanHandleCommand
statusReason: 1) norsk\api\user\application\UserRegistrationTest::testCanHandleCommand
Error: Call to protected method norsk\api\user\application\UserRegistration::handle() from scope norsk\api\user\application\UserRegistrationTest

/app/api/tests/unit/user/application/UserRegistrationTest.php:61

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
user/application/UserRegistration.php:30:9
             $command->getInputPassword(),
             $this->passwordVector
         );
-        $this->userRepository->add($user);
+        
 
         return $user;
killedBy: norsk\api\user\application\UserRegistrationTest::testCanHandleCommand
statusReason: 1) norsk\api\user\application\UserRegistrationTest::testCanHandleCommand
Expectation failed for method name is "add" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
