[Killed] PublicVisibility
user/application/useCases/RegisterUser.php:32:5
     }
 
 
-    public static function by(Payload $payload): self
+    protected static function by(Payload $payload): self
     {
         $payloadArray = $payload->asArray();
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
Error: Call to protected method norsk\api\user\application\useCases\RegisterUser::by() from scope norsk\api\user\application\useCases\RegisterUserTest

/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:52

ERRORS!
Tests: 1, Assertions: 0, Errors: 1

[Killed] MethodCallRemoval
user/application/useCases/RegisterUser.php:35:9
     public static function by(Payload $payload): self
     {
         $payloadArray = $payload->asArray();
-        self::ensureParameterExist($payloadArray);
+        
 
         $userName = UserName::by($payloadArray[self::USERNAME]);
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/RegisterUser.php:26
/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:102
.

FAILURES!

[Killed] Foreach_
user/application/useCases/RegisterUser.php:55:9
             self::PASSWORD,
         ];
 
-        foreach ($neededKeys as $neededKey) {
-            if (!array_key_exists($neededKey, $payloadArray)) {
-                throw new ParameterMissingException(Parameter::by($neededKey));
-            }
-        }
+        foreach ([] as $neededKey) {
     }
 
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/RegisterUser.php:26
/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:102
.

FAILURES!

[Killed] LogicalNot
user/application/useCases/RegisterUser.php:56:13
         ];
 
         foreach ($neededKeys as $neededKey) {
-            if (!array_key_exists($neededKey, $payloadArray)) {
+            if (array_key_exists($neededKey, $payloadArray)) {
                 throw new ParameterMissingException(Parameter::by($neededKey));
             }
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
norsk\api\user\domain\exceptions\ParameterMissingException: Missing required parameter: username

/app/api/src/user/application/useCases/RegisterUser.php:37
/app/api/src/user/application/useCases/RegisterUser.php:25
/app/api/tests/unit/user/application/useCases/Reg

[Killed] Throw_
user/application/useCases/RegisterUser.php:57:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $payloadArray)) {
-                throw new ParameterMissingException(Parameter::by($neededKey));
+                new ParameterMissingException(Parameter::by($neededKey));
             }
         }
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/application/useCases/RegisterUser.php:26
/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:102
.

FAILURES!

[Killed] PublicVisibility
user/application/useCases/RegisterUser.php:69:5
     }
 
 
-    public function getFirstName(): FirstName
+    protected function getFirstName(): FirstName
     {
         return $this->firstName;
killedBy: norsk\api\user\application\useCases\RegisterUserTest::testCanGetFirstName
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testCanGetFirstName
Error: Call to protected method norsk\api\user\application\useCases\RegisterUser::getFirstName() from scope norsk\api\user\application\useCases\RegisterUserTest

/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:64

ERRORS!
Tests: 6, Assertions: 13, Errors: 1.

[Killed] PublicVisibility
user/application/useCases/RegisterUser.php:75:5
     }
 
 
-    public function getLastName(): LastName
+    protected function getLastName(): LastName
     {
         return $this->lastName;
killedBy: norsk\api\user\application\useCases\RegisterUserTest::testCanGetLastName
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testCanGetLastName
Error: Call to protected method norsk\api\user\application\useCases\RegisterUser::getLastName() from scope norsk\api\user\application\useCases\RegisterUserTest

/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:70

ERRORS!
Tests: 7, Assertions: 14, Errors: 1.

[Killed] PublicVisibility
user/application/useCases/RegisterUser.php:81:5
     }
 
 
-    public function getInputPassword(): InputPassword
+    protected function getInputPassword(): InputPassword
     {
         return $this->inputPassword;
killedBy: norsk\api\user\application\useCases\RegisterUserTest::testCanGetInputPassword
statusReason: 1) norsk\api\user\application\useCases\RegisterUserTest::testCanGetInputPassword
Error: Call to protected method norsk\api\user\application\useCases\RegisterUser::getInputPassword() from scope norsk\api\user\application\useCases\RegisterUserTest

/app/api/tests/unit/user/application/useCases/RegisterUserTest.php:76

ERRORS!
Tests: 8, Assertions: 15, Errors: 1.
