[Killed] MethodCallRemoval
user/domain/exceptions/CredentialsAreInvalidException.php:14:9
 {
     public function __construct()
     {
-        parent::__construct(
-            'Unauthorized: Cannot verify credentials',
-            ResponseCode::unauthorized->value
-        );
+        
     }
 }
killedBy: norsk\api\user\exceptions\CredentialsAreInvalidExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\user\exceptions\CredentialsAreInvalidExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Unauthorized: Cannot verify credentials'
+''
