[Killed] MethodCallRemoval
user/domain/exceptions/ParameterMissingException.php:15:9
 {
     public function __construct(Parameter $parameter)
     {
-        parent::__construct(
-            'Missing required parameter: ' . $parameter->asString(),
-            ResponseCode::badRequest->value
-        );
+        
     }
 }
killedBy: norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Missing required parameter: testParameter'
+''

[Killed] ConcatOperandRemoval
user/domain/exceptions/ParameterMissingException.php:16:13
     public function __construct(Parameter $parameter)
     {
         parent::__construct(
-            'Missing required parameter: ' . $parameter->asString(),
+            parent::__construct($parameter->asString(), ResponseCode::badRequest->value);
             ResponseCode::badRequest->value
         );
killedBy: norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Missing required parameter: testParameter'
+'testParameter'

[Killed] Concat
user/domain/exceptions/ParameterMissingException.php:16:13
     public function __construct(Parameter $parameter)
     {
         parent::__construct(
-            'Missing required parameter: ' . $parameter->asString(),
+            parent::__construct($parameter->asString() . 'Missing required parameter: ', ResponseCode::badRequest->value);
             ResponseCode::badRequest->value
         );
killedBy: norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
statusReason: 1) norsk\api\user\exceptions\ParameterMissingExceptionTest::testExceptionMessage
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Missing required parameter: testParameter'
+'testParameterMissing required parameter: '
