[Killed] PublicVisibility
user/domain/model/LoggedInUser.php:21:5
     }
 
 
-    public static function by(ValidatedUser $validatedUser, JsonWebToken $jwToken): self
+    protected static function by(ValidatedUser $validatedUser, JsonWebToken $jwToken): self
     {
         return new self($validatedUser, $jwToken);
killedBy: norsk\api\user\LoggedInUserTest::testCanGetUserName
statusReason: 1) norsk\api\user\LoggedInUserTest::testCanGetUserName
Error: Call to protected method norsk\api\user\domain\model\LoggedInUser::by() from scope norsk\api\user\LoggedInUserTest

/app/api/tests/unit/user/domain/model/LoggedInUserTest.php:63

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
user/domain/model/LoggedInUser.php:27:5
     }
 
 
-    public function asBodyJson(): Json
+    protected function asBodyJson(): Json
     {
         return Json::encodeFromArray(
killedBy: norsk\api\user\LoggedInUserTest::testAsBodyJsonReturnsCorrectJson
statusReason: 1) norsk\api\user\LoggedInUserTest::testAsBodyJsonReturnsCorrectJson
Error: Call to protected method norsk\api\user\domain\model\LoggedInUser::asBodyJson() from scope norsk\api\user\LoggedInUserTest

/app/api/tests/unit/user/domain/model/LoggedInUserTest.php:44

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
