[Killed] PublicVisibility
user/domain/model/RegisteredUser.php:27:5
     }
 
 
-    public static function create(
+    protected static function create(UserName $userName, FirstName $firstName, LastName $lastName, InputPassword $inputPassword, PasswordVector $passwordVector): self
         UserName $userName,
         FirstName $firstName,
killedBy: norsk\api\user\RegisteredUserTest::testCanGetUserName
statusReason: 1) norsk\api\user\RegisteredUserTest::testCanGetUserName
Error: Call to protected method norsk\api\user\domain\model\RegisteredUser::create() from scope norsk\api\user\RegisteredUserTest

/app/api/tests/unit/user/domain/model/RegisteredUserTest.php:46

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
user/domain/model/RegisteredUser.php:41:5
     }
 
 
-    public function getSalt(): Salt
+    protected function getSalt(): Salt
     {
         return $this->salt;
killedBy: norsk\api\user\RegisteredUserTest::testCanGetSalt
statusReason: 1) norsk\api\user\RegisteredUserTest::testCanGetSalt
Error: Call to protected method norsk\api\user\domain\model\RegisteredUser::getSalt() from scope norsk\api\user\RegisteredUserTest

/app/api/tests/unit/user/domain/model/RegisteredUserTest.php:82

ERRORS!
Tests: 5, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
user/domain/model/RegisteredUser.php:65:5
     }
 
 
-    public function getPasswordHash(): PasswordHash
+    protected function getPasswordHash(): PasswordHash
     {
         return $this->passwordHash;
killedBy: norsk\api\user\RegisteredUserTest::testCanGetPasswordHash
statusReason: 1) norsk\api\user\RegisteredUserTest::testCanGetPasswordHash
Error: Call to protected method norsk\api\user\domain\model\RegisteredUser::getPasswordHash() from scope norsk\api\user\RegisteredUserTest

/app/api/tests/unit/user/domain/model/RegisteredUserTest.php:76

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.
