[Killed] PublicVisibility
user/domain/model/ValidatedUser.php:40:5
     }
 
 
-    public static function createBySqlResultAndPasswordHash(
+    protected static function createBySqlResultAndPasswordHash(SqlResult $sqlResult, InputPassword $inputPassword, Pepper $pepper): self
         SqlResult $sqlResult,
         InputPassword $inputPassword,
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
Error: Call to protected method norsk\api\user\domain\model\ValidatedUser::createBySqlResultAndPasswordHash() from scope norsk\api\user\ValidatedUserTest

/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:167

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IncrementInteger
user/domain/model/ValidatedUser.php:45:9
         InputPassword $inputPassword,
         Pepper $pepper
     ): self {
-        $resultArray = $sqlResult->asArray()[0];
+        $resultArray = $sqlResult->asArray()[1];
         self::ensureParameterExist($resultArray);
         self::ensureUserIsActive($resultArray[self::ACTIVE]);
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
TypeError: norsk\api\user\domain\model\ValidatedUser::ensureParameterExist(): Argument #1 ($payloadArray) must be of type array, null given, called in /app/api/src/user/domain/model/ValidatedUser.php on line 33

/app/api/src/user/domain/model/ValidatedUser.php:45
/app/api/src/user/dom

[Killed] MethodCallRemoval
user/domain/model/ValidatedUser.php:46:9
         Pepper $pepper
     ): self {
         $resultArray = $sqlResult->asArray()[0];
-        self::ensureParameterExist($resultArray);
+        
         self::ensureUserIsActive($resultArray[self::ACTIVE]);
 
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/domain/model/ValidatedUser.php:35
/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:105
.

FAILURES!

[Killed] MethodCallRemoval
user/domain/model/ValidatedUser.php:47:9
     ): self {
         $resultArray = $sqlResult->asArray()[0];
         self::ensureParameterExist($resultArray);
-        self::ensureUserIsActive($resultArray[self::ACTIVE]);
+        
 
         $userName = UserName::by($resultArray[self::USERNAME]);
killedBy: norsk\api\user\ValidatedUserTest::testThrowsExceptionIfUserIsNotActive
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfUserIsNotActive
Failed asserting that exception of type "norsk\api\user\domain\exceptions\NoActiveUserException" is thrown.

FAILURES!
Tests: 11, Assertions: 23, Failures: 1.

[Killed] MethodCallRemoval
user/domain/model/ValidatedUser.php:58:9
         $storedSalt = Salt::by($resultArray[self::SALT]);
         $passwordVector = PasswordVector::by($storedSalt, $pepper);
 
-        PasswordHash::byValidatedInputPassword(
-            $inputPassword,
-            $passwordVector,
-            $storedPasswordHash
-        );
+        
 
         return new self($userName, $firstName, $lastName, $role);
killedBy: norsk\api\user\ValidatedUserTest::testThrowsExceptionOnInvalidPassword
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionOnInvalidPassword
Failed asserting that exception of type "norsk\api\user\domain\exceptions\CredentialsAreInvalidException" is thrown.

FAILURES!
Tests: 10, Assertions: 20, Failures: 1.

[Killed] Foreach_
user/domain/model/ValidatedUser.php:79:9
             self::ACTIVE,
         ];
 
-        foreach ($neededKeys as $neededKey) {
-            if (!array_key_exists($neededKey, $payloadArray)) {
-                throw new InvalidArgumentException('Missing field: ' . $neededKey);
-            }
-        }
+        foreach ([] as $neededKey) {
     }
 
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
/app/api/src/user/domain/valueObjects/UserName.php:22
/app/api/src/user/domain/model/ValidatedUser.php:35
/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:105
.

FAILURES!

[Killed] ConcatOperandRemoval
user/domain/model/ValidatedUser.php:81:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $payloadArray)) {
-                throw new InvalidArgumentException('Missing field: ' . $neededKey);
+                throw new InvalidArgumentException($neededKey);
             }
         }
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
Failed asserting that exception message 'username' contains 'Missing field: username'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
user/domain/model/ValidatedUser.php:81:17
 
         foreach ($neededKeys as $neededKey) {
             if (!array_key_exists($neededKey, $payloadArray)) {
-                throw new InvalidArgumentException('Missing field: ' . $neededKey);
+                throw new InvalidArgumentException('Missing field: ');
             }
         }
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
Failed asserting that exception message 'Missing field: ' contains 'Missing field: username'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IfNegation
user/domain/model/ValidatedUser.php:89:9
 
     private static function ensureUserIsActive(int $active): void
     {
-        if (self::isNotActive($active)) {
-            throw new NoActiveUserException('Forbidden: user is not active', ResponseCode::forbidden->value);
-        }
+        if (!self::isNotActive($active)) {
     }
 
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
norsk\api\user\domain\exceptions\NoActiveUserException: Forbidden: user is not active

/app/api/src/user/domain/model/ValidatedUser.php:57
/app/api/src/user/domain/model/ValidatedUser.php:34
/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:167

ERRORS!

[Killed] Throw_
user/domain/model/ValidatedUser.php:90:13
     private static function ensureUserIsActive(int $active): void
     {
         if (self::isNotActive($active)) {
-            throw new NoActiveUserException('Forbidden: user is not active', ResponseCode::forbidden->value);
+            new NoActiveUserException('Forbidden: user is not active', ResponseCode::forbidden->value);
         }
     }
killedBy: norsk\api\user\ValidatedUserTest::testThrowsExceptionIfUserIsNotActive
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfUserIsNotActive
Failed asserting that exception of type "norsk\api\user\domain\exceptions\NoActiveUserException" is thrown.

FAILURES!
Tests: 11, Assertions: 23, Failures: 1.

[Killed] IncrementInteger
user/domain/model/ValidatedUser.php:97:9
 
     private static function isNotActive(int $active): bool
     {
-        return $active !== 1;
+        return $active !== 2;
     }
 
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
norsk\api\user\domain\exceptions\NoActiveUserException: Forbidden: user is not active

/app/api/src/user/domain/model/ValidatedUser.php:57
/app/api/src/user/domain/model/ValidatedUser.php:34
/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:167

ERRORS!

[Killed] NotIdentical
user/domain/model/ValidatedUser.php:97:9
 
     private static function isNotActive(int $active): bool
     {
-        return $active !== 1;
+        return $active === 1;
     }
 
statusReason: 1) norsk\api\user\ValidatedUserTest::testThrowsExceptionIfParameterIsMissing with data set "username" ('username')
norsk\api\user\domain\exceptions\NoActiveUserException: Forbidden: user is not active

/app/api/src/user/domain/model/ValidatedUser.php:57
/app/api/src/user/domain/model/ValidatedUser.php:34
/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:167

ERRORS!

[Killed] PublicVisibility
user/domain/model/ValidatedUser.php:119:5
     }
 
 
-    public function getRole(): Role
+    protected function getRole(): Role
     {
         return $this->role;
killedBy: norsk\api\user\ValidatedUserTest::testCanGetRole
statusReason: 1) norsk\api\user\ValidatedUserTest::testCanGetRole
Error: Call to protected method norsk\api\user\domain\model\ValidatedUser::getRole() from scope norsk\api\user\ValidatedUserTest

/app/api/tests/unit/user/domain/model/ValidatedUserTest.php:79

ERRORS!
Tests: 9, Assertions: 18, Errors: 1.
