[Killed] PublicVisibility
user/domain/valueObjects/FirstName.php:17:5
     }
 
 
-    public static function by(string $firstName): self
+    protected static function by(string $firstName): self
     {
         $trimmed = trim($firstName);
statusReason: 1) norsk\api\user\FirstNameTest::testCanBeUsedAsString with data set "Jan-Elías Räy Jr." ('Jan-Elías Räy Jr.')
Error: Call to protected method norsk\api\user\domain\valueObjects\FirstName::by() from scope norsk\api\user\FirstNameTest

/app/api/tests/unit/user/domain/valueObjects/FirstNameTest.php:54

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] UnwrapTrim
user/domain/valueObjects/FirstName.php:19:9
 
     public static function by(string $firstName): self
     {
-        $trimmed = trim($firstName);
+        $trimmed = $firstName;
 
         self::ensureIsNotEmpty($trimmed);
killedBy: norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/FirstName.php:21:9
     {
         $trimmed = trim($firstName);
 
-        self::ensureIsNotEmpty($trimmed);
+        
 
         return new self(SanitizedClientInput::of($trimmed)->asString());
killedBy: norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] Throw_
user/domain/valueObjects/FirstName.php:30:13
     private static function ensureIsNotEmpty(string $trimmed): void
     {
         if ($trimmed === '') {
-            throw new InvalidArgumentException('First name cannot be empty.');
+            new InvalidArgumentException('First name cannot be empty.');
         }
     }
killedBy: norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
statusReason: 1) norsk\api\user\FirstNameTest::testThrowsExceptionIfFirstNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.
