[Killed] PublicVisibility
user/domain/valueObjects/LastName.php:17:5
     }
 
 
-    public static function by(string $lastName): self
+    protected static function by(string $lastName): self
     {
         $trimmed = trim($lastName);
statusReason: 1) norsk\api\user\LastNameTest::testCanBeUsedAsString with data set "Otto vor dem-Gäntßschenfelde" ('Otto vor dem-Gäntßschenfelde', 'Otto vor dem-Gäntßschenfelde')
Error: Call to protected method norsk\api\user\domain\valueObjects\LastName::by() from scope norsk\api\user\LastNameTest

/app/api/tests/unit/user/domain/valueObjects/LastNameTest.php:52

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] UnwrapTrim
user/domain/valueObjects/LastName.php:19:9
 
     public static function by(string $lastName): self
     {
-        $trimmed = trim($lastName);
+        $trimmed = $lastName;
 
         self::ensureIsNotEmpty($trimmed);
killedBy: norsk\api\user\LastNameTest::testThrowsExceptionIfLastNameIsEmpty
statusReason: 1) norsk\api\user\LastNameTest::testThrowsExceptionIfLastNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 27, Assertions: 27, Failures: 1.

[Killed] Throw_
user/domain/valueObjects/LastName.php:30:13
     private static function ensureIsNotEmpty(string $trimmed): void
     {
         if ($trimmed === '') {
-            throw new InvalidArgumentException('Last name cannot be empty.');
+            new InvalidArgumentException('Last name cannot be empty.');
         }
     }
killedBy: norsk\api\user\LastNameTest::testThrowsExceptionIfLastNameIsEmpty
statusReason: 1) norsk\api\user\LastNameTest::testThrowsExceptionIfLastNameIsEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 27, Assertions: 27, Failures: 1.
