[Killed] PublicVisibility
user/domain/valueObjects/Pepper.php:20:5
     }
 
 
-    public static function by(string $string): self
+    protected static function by(string $string): self
     {
         self::ensureIsNotNull($string);
killedBy: norsk\api\user\PepperTest::testCanCreatePepperWithValidString
statusReason: 1) norsk\api\user\PepperTest::testCanCreatePepperWithValidString
Error: Call to protected method norsk\api\user\domain\valueObjects\Pepper::by() from scope norsk\api\user\PepperTest

/app/api/tests/unit/user/domain/valueObjects/PepperTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/Pepper.php:22:9
 
     public static function by(string $string): self
     {
-        self::ensureIsNotNull($string);
+        
         self::ensureIsLongEnough($string);
 
killedBy: norsk\api\user\PepperTest::testCannotCreatePepperWithEmptyString
statusReason: 1) norsk\api\user\PepperTest::testCannotCreatePepperWithEmptyString
Failed asserting that exception message 'Pepper is too short' contains 'Pepper not set'.

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/Pepper.php:23:9
     public static function by(string $string): self
     {
         self::ensureIsNotNull($string);
-        self::ensureIsLongEnough($string);
+        
 
         return new self($string);
killedBy: norsk\api\user\PepperTest::testCannotCreatePepperWithShortString
statusReason: 1) norsk\api\user\PepperTest::testCannotCreatePepperWithShortString
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] Identical
user/domain/valueObjects/Pepper.php:31:9
 
     private static function ensureIsNotNull(string $pepper): void
     {
-        if ($pepper === '') {
+        if ($pepper !== '') {
             throw new RuntimeException('Pepper not set');
         }
killedBy: norsk\api\user\PepperTest::testCanCreatePepperWithValidString
statusReason: 1) norsk\api\user\PepperTest::testCanCreatePepperWithValidString
RuntimeException: Pepper not set

/app/api/src/user/domain/valueObjects/Pepper.php:26
/app/api/src/user/domain/valueObjects/Pepper.php:19
/app/api/tests/unit/user/domain/valueObjects/PepperTest.php:22

ERRORS!

[Killed] Throw_
user/domain/valueObjects/Pepper.php:32:13
     private static function ensureIsNotNull(string $pepper): void
     {
         if ($pepper === '') {
-            throw new RuntimeException('Pepper not set');
+            new RuntimeException('Pepper not set');
         }
     }
killedBy: norsk\api\user\PepperTest::testCannotCreatePepperWithEmptyString
statusReason: 1) norsk\api\user\PepperTest::testCannotCreatePepperWithEmptyString
Failed asserting that exception message 'Pepper is too short' contains 'Pepper not set'.

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] LessThan
user/domain/valueObjects/Pepper.php:39:9
 
     private static function ensureIsLongEnough(string $pepper): void
     {
-        if (strlen($pepper) < self::LENGTH) {
+        if (strlen($pepper) <= self::LENGTH) {
             throw new RuntimeException('Pepper is too short');
         }
killedBy: norsk\api\user\PepperTest::testCanCreatePepperWithValidString
statusReason: 1) norsk\api\user\PepperTest::testCanCreatePepperWithValidString
RuntimeException: Pepper is too short

/app/api/src/user/domain/valueObjects/Pepper.php:32
/app/api/src/user/domain/valueObjects/Pepper.php:20
/app/api/tests/unit/user/domain/valueObjects/PepperTest.php:22

ERRORS!

[Killed] LessThanNegotiation
user/domain/valueObjects/Pepper.php:39:9
 
     private static function ensureIsLongEnough(string $pepper): void
     {
-        if (strlen($pepper) < self::LENGTH) {
+        if (strlen($pepper) >= self::LENGTH) {
             throw new RuntimeException('Pepper is too short');
         }
killedBy: norsk\api\user\PepperTest::testCanCreatePepperWithValidString
statusReason: 1) norsk\api\user\PepperTest::testCanCreatePepperWithValidString
RuntimeException: Pepper is too short

/app/api/src/user/domain/valueObjects/Pepper.php:32
/app/api/src/user/domain/valueObjects/Pepper.php:20
/app/api/tests/unit/user/domain/valueObjects/PepperTest.php:22

ERRORS!

[Killed] Throw_
user/domain/valueObjects/Pepper.php:40:13
     private static function ensureIsLongEnough(string $pepper): void
     {
         if (strlen($pepper) < self::LENGTH) {
-            throw new RuntimeException('Pepper is too short');
+            new RuntimeException('Pepper is too short');
         }
     }
killedBy: norsk\api\user\PepperTest::testCannotCreatePepperWithShortString
statusReason: 1) norsk\api\user\PepperTest::testCannotCreatePepperWithShortString
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.
