[Killed] PublicVisibility
user/domain/valueObjects/Salt.php:28:5
     }
 
 
-    public static function by(string $salt): self
+    protected static function by(string $salt): self
     {
         $trimmed = trim($salt);
killedBy: norsk\api\user\SaltTest::testCanCreateSaltFromString
statusReason: 1) norsk\api\user\SaltTest::testCanCreateSaltFromString
Error: Call to protected method norsk\api\user\domain\valueObjects\Salt::by() from scope norsk\api\user\SaltTest

/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:28

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Survived] UnwrapTrim
user/domain/valueObjects/Salt.php:30:9
 
     public static function by(string $salt): self
     {
-        $trimmed = trim($salt);
+        $trimmed = $salt;
         self::ensureIsNotEmpty($trimmed);
         self::ensureIs32CharsLong($trimmed);

[Killed] MethodCallRemoval
user/domain/valueObjects/Salt.php:31:9
     public static function by(string $salt): self
     {
         $trimmed = trim($salt);
-        self::ensureIsNotEmpty($trimmed);
+        
         self::ensureIs32CharsLong($trimmed);
 
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsEmpty
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsEmpty
Failed asserting that exception message 'Salt does not have at least 32 characters' contains 'Salt is empty'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/Salt.php:32:9
     {
         $trimmed = trim($salt);
         self::ensureIsNotEmpty($trimmed);
-        self::ensureIs32CharsLong($trimmed);
+        
 
         return new self(SanitizedClientInput::of($salt)->asString());
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsTooShort
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsTooShort
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Identical
user/domain/valueObjects/Salt.php:40:9
 
     private static function ensureIsNotEmpty(string $salt): void
     {
-        if ($salt === '') {
+        if ($salt !== '') {
             throw new InvalidArgumentException('Salt is empty');
         }
killedBy: norsk\api\user\SaltTest::testCanCreateSaltFromString
statusReason: 1) norsk\api\user\SaltTest::testCanCreateSaltFromString
InvalidArgumentException: Salt is empty

/app/api/src/user/domain/valueObjects/Salt.php:33
/app/api/src/user/domain/valueObjects/Salt.php:26
/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:28

ERRORS!

[Killed] Throw_
user/domain/valueObjects/Salt.php:41:13
     private static function ensureIsNotEmpty(string $salt): void
     {
         if ($salt === '') {
-            throw new InvalidArgumentException('Salt is empty');
+            new InvalidArgumentException('Salt is empty');
         }
     }
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsEmpty
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsEmpty
Failed asserting that exception message 'Salt does not have at least 32 characters' contains 'Salt is empty'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] LessThanNegotiation
user/domain/valueObjects/Salt.php:48:9
 
     private static function ensureIs32CharsLong(string $salt): void
     {
-        if (strlen($salt) < self::LENGTH) {
+        if (strlen($salt) >= self::LENGTH) {
             throw new InvalidArgumentException('Salt does not have at least 32 characters');
         }
killedBy: norsk\api\user\SaltTest::testCanCreateSaltFromString
statusReason: 1) norsk\api\user\SaltTest::testCanCreateSaltFromString
InvalidArgumentException: Salt does not have at least 32 characters

/app/api/src/user/domain/valueObjects/Salt.php:39
/app/api/src/user/domain/valueObjects/Salt.php:27
/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:28

ERRORS!

[Survived] LessThan
user/domain/valueObjects/Salt.php:48:9
 
     private static function ensureIs32CharsLong(string $salt): void
     {
-        if (strlen($salt) < self::LENGTH) {
+        if (strlen($salt) <= self::LENGTH) {
             throw new InvalidArgumentException('Salt does not have at least 32 characters');
         }

[Killed] Throw_
user/domain/valueObjects/Salt.php:49:13
     private static function ensureIs32CharsLong(string $salt): void
     {
         if (strlen($salt) < self::LENGTH) {
-            throw new InvalidArgumentException('Salt does not have at least 32 characters');
+            new InvalidArgumentException('Salt does not have at least 32 characters');
         }
     }
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsTooShort
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsTooShort
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/Salt.php:56:9
 
     public function asString(): string
     {
-        $this->ensureSaltIsNotNull();
+        
 
         return $this->salt;
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsUsedEmpty
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsUsedEmpty
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\user\domain\valueObjects\Salt::asString(): Return value must be of type string, null returned" at
/app/api/src/user/domain/valueObjects/Salt.php:45
/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:68
.

[Killed] Identical
user/domain/valueObjects/Salt.php:64:9
 
     private function ensureSaltIsNotNull(): void
     {
-        if (null === $this->salt) {
+        if (null !== $this->salt) {
             throw new RuntimeException('Salt not set');
         }
killedBy: norsk\api\user\SaltTest::testCanCreateSaltWithValue
statusReason: 1) norsk\api\user\SaltTest::testCanCreateSaltWithValue
RuntimeException: Salt not set

/app/api/src/user/domain/valueObjects/Salt.php:50
/app/api/src/user/domain/valueObjects/Salt.php:44
/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:20

ERRORS!

[Killed] Throw_
user/domain/valueObjects/Salt.php:65:13
     private function ensureSaltIsNotNull(): void
     {
         if (null === $this->salt) {
-            throw new RuntimeException('Salt not set');
+            new RuntimeException('Salt not set');
         }
     }
killedBy: norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsUsedEmpty
statusReason: 1) norsk\api\user\SaltTest::testThrowsExceptionIfSaltIsUsedEmpty
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "norsk\api\user\domain\valueObjects\Salt::asString(): Return value must be of type string, null returned" at
/app/api/src/user/domain/valueObjects/Salt.php:45
/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:68
.

[Killed] PublicVisibility
user/domain/valueObjects/Salt.php:70:5
     }
 
 
-    public function generate(): void
+    protected function generate(): void
     {
         $this->salt = bin2hex(random_bytes(self::LENGTH));
killedBy: norsk\api\user\SaltTest::testCanCreateSaltWithValue
statusReason: 1) norsk\api\user\SaltTest::testCanCreateSaltWithValue
Error: Call to protected method norsk\api\user\domain\valueObjects\Salt::generate() from scope norsk\api\user\SaltTest

/app/api/tests/unit/user/domain/valueObjects/SaltTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
