[Killed] PublicVisibility
user/domain/valueObjects/UserName.php:22:5
     }
 
 
-    public static function by(string $userName): self
+    protected static function by(string $userName): self
     {
         $trimmed = trim($userName);
statusReason: 1) norsk\api\user\UserNameTest::testCanBeUsedAsString with data set #0 ('1234')
Error: Call to protected method norsk\api\user\domain\valueObjects\UserName::by() from scope norsk\api\user\UserNameTest

/app/api/tests/unit/user/domain/valueObjects/UserNameTest.php:71

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] UnwrapTrim
user/domain/valueObjects/UserName.php:24:9
 
     public static function by(string $userName): self
     {
-        $trimmed = trim($userName);
+        $trimmed = $userName;
         self::ensureHasValidLength($trimmed);
         $sanitized = self::ensureContainsNoInvalidChars($trimmed);
statusReason: 1) norsk\api\user\UserNameTest::testThrowsExceptionIfUserNameIsTooShortOrTooLong with data set "space" ('    ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 26, Assertions: 26, Failures: 1.

[Killed] MethodCallRemoval
user/domain/valueObjects/UserName.php:25:9
     public static function by(string $userName): self
     {
         $trimmed = trim($userName);
-        self::ensureHasValidLength($trimmed);
+        
         $sanitized = self::ensureContainsNoInvalidChars($trimmed);
 
statusReason: 1) norsk\api\user\UserNameTest::testThrowsExceptionIfUserNameIsTooShortOrTooLong with data set "space" ('    ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 26, Assertions: 26, Failures: 1.

[Killed] LessThan
user/domain/valueObjects/UserName.php:34:9
 
     private static function ensureHasValidLength(string $trimmed): void
     {
-        if ((strlen($trimmed) < self::MIN_LENGTH) || (strlen($trimmed) > self::MAX_LENGTH)) {
+        if (strlen($trimmed) <= self::MIN_LENGTH || strlen($trimmed) > self::MAX_LENGTH) {
             throw new InvalidArgumentException(
                 sprintf(
statusReason: 1) norsk\api\user\UserNameTest::testCanBeUsedAsString with data set #0 ('1234')
InvalidArgumentException: The username must be between 4 and 30 characters long.

/app/api/src/user/domain/valueObjects/UserName.php:26
/app/api/src/user/domain/valueObjects/UserName.php:19
/app/api/tests/unit/user/domain/valueObjects/UserNameTest.php:71

ERRORS!

[Killed] LogicalOrAllSubExprNegation
user/domain/valueObjects/UserName.php:34:9
 
     private static function ensureHasValidLength(string $trimmed): void
     {
-        if ((strlen($trimmed) < self::MIN_LENGTH) || (strlen($trimmed) > self::MAX_LENGTH)) {
+        if (!(strlen($trimmed) < self::MIN_LENGTH) || !(strlen($trimmed) > self::MAX_LENGTH)) {
             throw new InvalidArgumentException(
                 sprintf(
statusReason: 1) norsk\api\user\UserNameTest::testCanBeUsedAsString with data set #0 ('1234')
InvalidArgumentException: The username must be between 4 and 30 characters long.

/app/api/src/user/domain/valueObjects/UserName.php:26
/app/api/src/user/domain/valueObjects/UserName.php:19
/app/api/tests/unit/user/domain/valueObjects/UserNameTest.php:71

ERRORS!

[Killed] Throw_
user/domain/valueObjects/UserName.php:35:13
     private static function ensureHasValidLength(string $trimmed): void
     {
         if ((strlen($trimmed) < self::MIN_LENGTH) || (strlen($trimmed) > self::MAX_LENGTH)) {
-            throw new InvalidArgumentException(
-                sprintf(
-                    'The username must be between %d and %d characters long.',
-                    self::MIN_LENGTH,
-                    self::MAX_LENGTH
-                ),
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException(sprintf('The username must be between %d and %d characters long.', self::MIN_LENGTH, self::MAX_LENGTH), ResponseCode::unprocessable->value);
         }
     }
statusReason: 1) norsk\api\user\UserNameTest::testThrowsExceptionIfUserNameIsTooShortOrTooLong with data set "space" ('    ')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 26, Assertions: 26, Failures: 1.

[Killed] NotIdentical
user/domain/valueObjects/UserName.php:50:9
     private static function ensureContainsNoInvalidChars(string $trimmed): string
     {
         $sanitized = SanitizedClientInput::of($trimmed)->asString();
-        if ($sanitized !== $trimmed) {
+        if ($sanitized === $trimmed) {
             throw new InvalidArgumentException(
                 'User name contains invalid characters: \' or &.',
statusReason: 1) norsk\api\user\UserNameTest::testCanBeUsedAsString with data set #0 ('1234')
InvalidArgumentException: User name contains invalid characters: ' or &.

/app/api/src/user/domain/valueObjects/UserName.php:33
/app/api/src/user/domain/valueObjects/UserName.php:20
/app/api/tests/unit/user/domain/valueObjects/UserNameTest.php:71

ERRORS!

[Killed] Throw_
user/domain/valueObjects/UserName.php:51:13
     {
         $sanitized = SanitizedClientInput::of($trimmed)->asString();
         if ($sanitized !== $trimmed) {
-            throw new InvalidArgumentException(
-                'User name contains invalid characters: \' or &.',
-                ResponseCode::unprocessable->value
-            );
+            new InvalidArgumentException('User name contains invalid characters: \' or &.', ResponseCode::unprocessable->value);
         }
 
statusReason: 1) norsk\api\user\UserNameTest::testThrowsExceptionIfUserNameHasInvalidChars with data set "Fir'efly!Dänce33" ('Fir'efly!Dänce33')
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 29, Assertions: 35, Failures: 1.
