[Killed] PublicVisibility
user/infrastructure/UserManagementFactory.php:31:5
     }
 
 
-    public function login(): Login
+    protected function login(): Login
     {
         return new Login(
killedBy: norsk\api\user\infrastructure\UserManagementFactoryTest::testCreatesLogin
statusReason: 1) norsk\api\user\infrastructure\UserManagementFactoryTest::testCreatesLogin
Error: Call to protected method norsk\api\user\infrastructure\UserManagementFactory::login() from scope norsk\api\user\infrastructure\UserManagementFactoryTest

/app/api/tests/unit/user/infrastructure/UserManagementFactoryTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
user/infrastructure/UserManagementFactory.php:41:5
     }
 
 
-    public function registration(): Registration
+    protected function registration(): Registration
     {
         return new Registration(
killedBy: norsk\api\user\infrastructure\UserManagementFactoryTest::testCreatesRegistration
statusReason: 1) norsk\api\user\infrastructure\UserManagementFactoryTest::testCreatesRegistration
Error: Call to protected method norsk\api\user\infrastructure\UserManagementFactory::registration() from scope norsk\api\user\infrastructure\UserManagementFactoryTest

/app/api/tests/unit/user/infrastructure/UserManagementFactoryTest.php:43

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
