[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/EnhancedClock.php:23:5
     }
 
 
-    public function addSeconds(int $seconds): DateTimeImmutable
+    protected function addSeconds(int $seconds): DateTimeImmutable
     {
         return $this->clock->now()->modify('+' . $seconds . ' seconds');
killedBy: norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\EnhancedClock::addSeconds() from scope norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/EnhancedClockTest.php:45

ERR

[Killed] ConcatOperandRemoval
user/infrastructure/identityAccessManagement/EnhancedClock.php:25:9
 
     public function addSeconds(int $seconds): DateTimeImmutable
     {
-        return $this->clock->now()->modify('+' . $seconds . ' seconds');
+        return $this->clock->now()->modify('+' . ' seconds');
     }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
DateMalformedStringException: DateTimeImmutable::modify(): Failed to parse time string (+ seconds) at position 0 (+): Unexpected character

/app/api/src/user/infrastructure/identityAccessManagement/EnhancedClock.php:19
/app/api/tests/unit/user/infrastructure/identityAccessManagement/EnhancedCl

[Killed] ConcatOperandRemoval
user/infrastructure/identityAccessManagement/EnhancedClock.php:25:9
 
     public function addSeconds(int $seconds): DateTimeImmutable
     {
-        return $this->clock->now()->modify('+' . $seconds . ' seconds');
+        return $this->clock->now()->modify('+' . $seconds);
     }
 
killedBy: norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanAddSecondsToTimestamp
DateMalformedStringException: DateTimeImmutable::modify(): Failed to parse time string (+7200) at position 4 (0): Unexpected character

/app/api/src/user/infrastructure/identityAccessManagement/EnhancedClock.php:19
/app/api/tests/unit/user/infrastructure/identityAccessManagement/EnhancedClockT

[Killed] PublicVisibility
user/infrastructure/identityAccessManagement/EnhancedClock.php:29:5
     }
 
 
-    public function getTimestamp(): int
+    protected function getTimestamp(): int
     {
         return $this->clock->now()->getTimestamp();
killedBy: norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanCreateNowByCall
statusReason: 1) norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest::testCanCreateNowByCall
Error: Call to protected method norsk\api\user\infrastructure\identityAccessManagement\EnhancedClock::getTimestamp() from scope norsk\api\user\infrastructure\identityAccessManagement\EnhancedClockTest

/app/api/tests/unit/user/infrastructure/identityAccessManagement/EnhancedClockTest.php:33

ERRORS!
