[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersReader.php:51:9
             $params
         );
 
-        $this->ensureUserExists($result);
+        
 
         return ValidatedUser::createBySqlResultAndPasswordHash($result, $inputPassword, $pepper);
killedBy: norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfGettingDataForUserFailsBecauseUserDoesNotExist
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfGettingDataForUserFailsBecauseUserDoesNotExist
/app/api/src/user/domain/model/ValidatedUser.php:68
/app/api/src/user/domain/model/ValidatedUser.php:46
/app/api/src/user/infrastructure/persistence/UsersReader.php:36
/app/api/tests/unit/user/infrastructure/persistence/UsersReaderTest.php:80
.

[Killed] Identical
user/infrastructure/persistence/UsersReader.php:59:9
 
     private function ensureUserExists(SqlResult $result): void
     {
-        if ($result->count() === 0) {
+        if ($result->count() !== 0) {
             throw new CredentialsAreInvalidException();
         }
killedBy: norsk\api\user\infrastructure\persistence\UsersReaderTest::testCanGetDataForUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersReaderTest::testCanGetDataForUser
norsk\api\user\domain\exceptions\CredentialsAreInvalidException: Unauthorized: Cannot verify credentials

/app/api/src/user/infrastructure/persistence/UsersReader.php:41
/app/api/src/user/infrastructure/persistence/UsersReader.php:35
/app/api/tests/unit/user/infrastructure/persistence/UsersReaderTest.php:65

ERRORS

[Killed] Throw_
user/infrastructure/persistence/UsersReader.php:60:13
     private function ensureUserExists(SqlResult $result): void
     {
         if ($result->count() === 0) {
-            throw new CredentialsAreInvalidException();
+            new CredentialsAreInvalidException();
         }
     }
killedBy: norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfGettingDataForUserFailsBecauseUserDoesNotExist
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfGettingDataForUserFailsBecauseUserDoesNotExist
/app/api/src/user/domain/model/ValidatedUser.php:68
/app/api/src/user/domain/model/ValidatedUser.php:46
/app/api/src/user/infrastructure/persistence/UsersReader.php:36
/app/api/tests/unit/user/infrastructure/persistence/UsersReaderTest.php:80
.

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersReader.php:89:9
             $params
         );
 
-        $this->ensureUserIsActiveManager($result);
+        
     }
 
killedBy: norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfUserIsNoActiveManager
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfUserIsNoActiveManager
Failed asserting that exception of type "norsk\api\user\domain\exceptions\NoActiveManagerException" is thrown.

FAILURES!
Tests: 6, Assertions: 25, Failures: 1.

[Killed] Throw_
user/infrastructure/persistence/UsersReader.php:96:13
     private function ensureUserIsActiveManager(SqlResult $result): void
     {
         if ($result->count() === 0) {
-            throw new NoActiveManagerException('Unauthorized: Current user is no active manager');
+            new NoActiveManagerException('Unauthorized: Current user is no active manager');
         }
     }
killedBy: norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfUserIsNoActiveManager
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersReaderTest::testThrowsExceptionIfUserIsNoActiveManager
Failed asserting that exception of type "norsk\api\user\domain\exceptions\NoActiveManagerException" is thrown.

FAILURES!
Tests: 6, Assertions: 25, Failures: 1.
