[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:27:9
     public function add(RegisteredUser $user): void
     {
         $params = Parameters::init();
-        $params->addString($user->getUserName()->asString());
+        
         $params->addString($user->getFirstName()->asString());
         $params->addString($user->getLastName()->asString());
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\persistence\Parameters Object (

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:28:9
     {
         $params = Parameters::init();
         $params->addString($user->getUserName()->asString());
-        $params->addString($user->getFirstName()->asString());
+        
         $params->addString($user->getLastName()->asString());
         $params->addString($user->getPasswordHash()->asHashString());
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 norsk\api\infrastructure\persistence\Parameters Object (

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:29:9
         $params = Parameters::init();
         $params->addString($user->getUserName()->asString());
         $params->addString($user->getFirstName()->asString());
-        $params->addString($user->getLastName()->asString());
+        
         $params->addString($user->getPasswordHash()->asHashString());
         $params->addString($user->getSalt()->asString());
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
     'value' => Array (

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:30:9
         $params->addString($user->getUserName()->asString());
         $params->addString($user->getFirstName()->asString());
         $params->addString($user->getLastName()->asString());
-        $params->addString($user->getPasswordHash()->asHashString());
+        
         $params->addString($user->getSalt()->asString());
 
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
         0 => 'someUserName'

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:31:9
         $params->addString($user->getFirstName()->asString());
         $params->addString($user->getLastName()->asString());
         $params->addString($user->getPasswordHash()->asHashString());
-        $params->addString($user->getSalt()->asString());
+        
 
         $this->dbConnector->execute(
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
         1 => 'someFirstName'

[Killed] MethodCallRemoval
user/infrastructure/persistence/UsersWriter.php:33:9
         $params->addString($user->getPasswordHash()->asHashString());
         $params->addString($user->getSalt()->asString());
 
-        $this->dbConnector->execute(
-            $this->addingUserSql,
-            $params
-        );
+        
     }
 }
killedBy: norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
statusReason: 1) norsk\api\user\infrastructure\persistence\UsersWriterTest::testCanAddUser
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
