[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/ActiveManagerSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username` '
-                     . 'FROM `users` '
-                     . 'WHERE `username` = ? AND `active` = 1 AND `role` = "manager";';
+        $this->sql = 'SELECT `username` ' . 'FROM `users` ';= ? AND `active` = 1 AND `role` = "manager";';
     }
 
killedBy: norsk\api\user\infrastructure\persistence\queries\ActiveManagerSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\ActiveManagerSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username` FROM `users` WHERE `username` = ? AND `active` = 1 AND `role` = "manager";'
+'SELECT `username` FROM `users` '

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/ActiveManagerSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username` '
-                     . 'FROM `users` '
+        $this->sql = 'FROM `users` ' . 'WHERE `username` = ? AND `active` = 1 AND `role` = "manager";';
                      . 'WHERE `username` = ? AND `active` = 1 AND `role` = "manager";';
     }
killedBy: norsk\api\user\infrastructure\persistence\queries\ActiveManagerSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\ActiveManagerSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username` FROM `users` WHERE `username` = ? AND `active` = 1 AND `role` = "manager";'
+'FROM `users` WHERE `username` = ? AND `active` = 1 AND `role` = "manager";'
