[Killed] Concat
infrastructure/persistence/queries/AddUserSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `users` '
-                     . '(`username`, `firstname`, `lastname`, `password_hash`, `salt`, `active`) '
-                     . 'VALUES (?, ?, ?, ?, ?, 0);';
+        $this->sql = 'INSERT INTO `users` ' . 'VALUES (?, ?, ?, ?, ?, 0);' . '(`username`, `firstname`, `lastname`, `password_hash`, `salt`, `active`) '; ?, 0);';
     }
 
killedBy: norsk\api\user\infrastructure\persistence\queries\AddUserSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\AddUserSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `users` (`username`, `firstname`, `lastname`, `password_hash`, `salt`, `active`) VALUES (?, ?, ?, ?, ?, 0);'
+'INSERT INTO `users` VALUES (?, ?, ?, ?, ?, 0);(`username`, `firstname`, `lastname`, `password_hash`, `sal

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/AddUserSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'INSERT INTO `users` '
-                     . '(`username`, `firstname`, `lastname`, `password_hash`, `salt`, `active`) '
+        $this->sql = 'INSERT INTO `users` ' . 'VALUES (?, ?, ?, ?, ?, 0);';name`, `lastname`, `password_hash`, `salt`, `active`) '
                      . 'VALUES (?, ?, ?, ?, ?, 0);';
     }
killedBy: norsk\api\user\infrastructure\persistence\queries\AddUserSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\AddUserSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INSERT INTO `users` (`username`, `firstname`, `lastname`, `password_hash`, `salt`, `active`) VALUES (?, ?, ?, ?, ?, 0);'
+'INSERT INTO `users` VALUES (?, ?, ?, ?, ?, 0);'
