[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/FindUserDataSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` '
-                     . 'FROM `users` '
+        $this->sql = 'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` ' . 'WHERE `username` = ?;';
                      . 'WHERE `username` = ?;';
     }
killedBy: norsk\api\user\infrastructure\persistence\queries\FindUserDataSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\FindUserDataSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` FROM `users` WHERE `username` = ?;'
+'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` WHERE `userna

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/FindUserDataSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` '
-                     . 'FROM `users` '
-                     . 'WHERE `username` = ?;';
+        $this->sql = 'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` ' . 'FROM `users` ';
     }
 
killedBy: norsk\api\user\infrastructure\persistence\queries\FindUserDataSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\FindUserDataSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` FROM `users` WHERE `username` = ?;'
+'SELECT `username`, `firstname`, `lastname`, `password_hash`, `salt`, `role`, `active` FROM `users`
