[Killed] Concat
infrastructure/persistence/queries/FindUserSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username` '
-                     . 'FROM `users` '
-                     . 'WHERE `username` = ? AND `active` = 1;';
+        $this->sql = 'SELECT `username` ' . 'WHERE `username` = ? AND `active` = 1;' . 'FROM `users` ';= ? AND `active` = 1;';
     }
 
killedBy: norsk\api\user\infrastructure\persistence\queries\FindUserSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\FindUserSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username` FROM `users` WHERE `username` = ? AND `active` = 1;'
+'SELECT `username` WHERE `username` = ? AND `active` = 1;FROM `users` '

[Killed] ConcatOperandRemoval
infrastructure/persistence/queries/FindUserSql.php:16:9
 
     private function __construct()
     {
-        $this->sql = 'SELECT `username` '
-                     . 'FROM `users` '
-                     . 'WHERE `username` = ? AND `active` = 1;';
+        $this->sql = 'SELECT `username` ' . 'FROM `users` ';= ? AND `active` = 1;';
     }
 
killedBy: norsk\api\user\infrastructure\persistence\queries\FindUserSqlTest::testCanBeUsedAsString
statusReason: 1) norsk\api\user\infrastructure\persistence\queries\FindUserSqlTest::testCanBeUsedAsString
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'SELECT `username` FROM `users` WHERE `username` = ? AND `active` = 1;'
+'SELECT `username` FROM `users` '
