[Killed] PublicVisibility
infrastructure/web/controller/Registration.php:29:5
     }
 
 
-    public function registerUser(Request $request): ResponseInterface
+    protected function registerUser(Request $request): ResponseInterface
     {
         return $this->createRegisterResponse($request);
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
Error: Call to protected method norsk\api\user\infrastructure\web\controller\Registration::registerUser() from scope norsk\api\user\infrastructure\web\controller\RegistrationTest

/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:123
/app/api/tests/unit/user/infrastructure/web/control

[Killed] MethodCallRemoval
infrastructure/web/controller/Registration.php:38:13
     private function createRegisterResponse(Request $request): ResponseInterface
     {
         try {
-            $this->logger->info(LogMessage::fromString('Getting request for user registration'));
+            
             $payload = Payload::of($request);
 
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
Failed asserting that 500 is identical to 201.

/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:124
/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:93

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
infrastructure/web/controller/Registration.php:44:13
             $command = RegisterUser::by($payload);
             $registeredUser = $this->userRegistration->handle($command);
 
-            $this->logger->info(
-                LogMessage::fromString('Added new User: ' . $registeredUser->getUserName()->asString())
-            );
+            
 
             return CreatedResponse::savedNewUser($this->url);
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
Expectation failed for method name is "info" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Concat
infrastructure/web/controller/Registration.php:45:17
             $registeredUser = $this->userRegistration->handle($command);
 
             $this->logger->info(
-                LogMessage::fromString('Added new User: ' . $registeredUser->getUserName()->asString())
+                $this->logger->info(LogMessage::fromString($registeredUser->getUserName()->asString() . 'Added new User: '));
             );
 
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
Failed asserting that 500 is identical to 201.

/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:124
/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:93

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
infrastructure/web/controller/Registration.php:45:17
             $registeredUser = $this->userRegistration->handle($command);
 
             $this->logger->info(
-                LogMessage::fromString('Added new User: ' . $registeredUser->getUserName()->asString())
+                $this->logger->info(LogMessage::fromString('Added new User: '));
             );
 
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
Failed asserting that 500 is identical to 201.

/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:124
/app/api/tests/unit/user/infrastructure/web/controller/RegistrationTest.php:93

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
infrastructure/web/controller/Registration.php:48:13
                 LogMessage::fromString('Added new User: ' . $registeredUser->getUserName()->asString())
             );
 
-            return CreatedResponse::savedNewUser($this->url);
+            
         } catch (Throwable $throwable) {
             $this->logger->error($throwable);
killedBy: norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
statusReason: 1) norsk\api\user\infrastructure\web\controller\RegistrationTest::testCanRegisterNewUser
TypeError: norsk\api\user\infrastructure\web\controller\Registration::createRegisterResponse(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned

/app/api/src/user/infrastructure/web/controller/Registration.php:39
/app/api/src/user/infrastructure/web/controller/Registration.php:24
